{
    "source": "hpo",
    "main-entities": ["Chris Christie"],
    "main-event": "Chris Christie announces bid for presidency",
    "title": "Chris Christie Announces He's Running For President In 2016",
    "url": "https://www.huffingtonpost.com/2015/06/30/chris-christie-president_n_6480964.html",
    "word-count": 614,
    "date": "2015-06-30",
    "uuid": "48d9863f-62d0-487e-b928-8a169a5048c5",
    "triplet-uuid": "13792511-5142-449f-8d3e-d77d790f65ec",
    "body-paragraphs": [
        [
            "Chris Christie Announces He's Running For President In 2016"
        ],
        [
            "New Jersey Gov. Chris Christie (R) announced he's running for president in 2016."
        ],
        [
            "Christie told supporters of his plans in a phone call Tuesday morning, according to NBC and the AP."
        ],
        [
            "Christie made a public announcement Tuesday afternoon at Livingston High School, his alma mater, in Livingston, New Jersey."
        ],
        [
            "\"I am now ready to fight for the people of the United States of America,\" Christie said at the public announcement."
        ],
        [
            "He praised his home state during his speech, sharing how working as governor inspired him to run for president.",
            "Christie also took hits at lawmakers in Washington, including President Barack Obama, claiming a lack of productivity from Congress is giving Americans anxiety."
        ],
        [
            "\"Both parties have failed our country... both parties have led us to believe that America, a country that was built on compromise -- that compromise is somehow a dirty word,\" Christie said."
        ],
        [
            "\"We need to have the courage to choose, we need to have the courage to stand up and say 'enough,'\" Christie added."
        ],
        [
            "Christie, a tough-talking former federal prosecutor whose reputation for political bullying was reinforced by a George Washington Bridge lane-closing scandal last year, has served as New Jersey governor since January 2010, winning election twice in a state where Democrats greatly outnumber Republicans."
        ],
        [
            "He notably led the state during catastrophic damage from Hurricane Sandy in 2012.",
            "Christie's favorability rating among voters skyrocketed after he made himself visible through interviews, press conferences and tours of storm damage during the disaster."
        ],
        [
            "Christie focused on his state rather than the presidential election that took place days after New Jersey's shore was ravaged by the storm.",
            "HuffPost reported in November 2012 Christie turned down an invitation to appear at an event with Republican presidential candidate Mitt Romney days ahead of the election.",
            "Instead, Christie was seen that October praising President Barack Obama for responsiveness and \"leadership\" in the storm's aftermath."
        ],
        [
            "In an October 2012 interview with Fox News, Christie said he didn't \"give a damn about presidential politics\" in the wake of the storm."
        ],
        [
            "\"I have got a job to do here in New Jersey that is much bigger than presidential politics.",
            "And I could care less about any of that stuff,\" Christie said."
        ],
        [
            "Christie was elected chairman of the Republican Governors Association in November 2013.",
            "He worked within that role to raise money and contribute to the campaigns of Republican governors across the U.S., many of whom won in the 2014 midterm elections."
        ],
        [
            "While serving as chair of the governors association, Christie held prep sessions on foreign policy with officials, business leaders and academics in an attempt to ready himself for a White House run, according The Associated Press."
        ],
        [
            "Known for his blunt speaking style, Christie has acknowledged that he can come off brash and confrontational."
        ],
        [
            "\"I'm not everybody's cup of tea, but I'm not in this business to get elected to prom king.",
            "My job is to lead, and that's what I try to do,\" Christie said in 2014, according to the AP."
        ],
        [
            "His image suffered a major blow in 2014, when it was revealed members of his administration, including his deputy chief of staff, were involved in a plot to cause traffic jams near the George Washington Bridge to retaliate against a mayor who hadn't supported Christie's 2013 re-election.",
            "Dubbed \"Bridgegate,\" the controversy caused Christie, who had enjoyed high favorability ratings, to see his negatives rise sharply."
        ],
        [
            "Christie has also faced criticism for reversinghis position recently on Common Core education standards.",
            "Christie initially supported the standards but said recently that he no longer supports them because of how they've played out in his state."
        ],
        [
            "According to HuffPost Pollster, Christie is in the middle of the pack of GOP presidential candidates."
        ]
    ]
}
