{
    "keywords": "Presidential Election of 2016,Christie  Christopher J,New Jersey,Republican Party",
    "word-count": 1193,
    "date": "2015-06-30",
    "uuid": "43e30ed6-f9c4-4d7a-842b-0d9fb2dbeab4",
    "body-paragraphs": [
        [
            "LIVINGSTON, N.J. — Gov. Chris Christie declared an uphill candidacy for president on Tuesday with New Jersey-style swagger, unconcealed disgust for Washington and a high regard for his own candor, vowing that “there is one thing you will know for sure: I say what I mean and I mean what I say.”"
        ],
        [
            "Relying on his biggest, and perhaps his last, remaining advantage in a field of better-financed and better-liked rivals — his personality — Mr. Christie portrayed himself as the only candidate in the Republican field who is forthright and forceful enough to run the country."
        ],
        [
            "“We need strength and decision-making and authority back in the Oval Office,” he said."
        ],
        [
            "Pacing the stage without a prepared text and raising his voice to a shout at times, he vowed to campaign and govern as a colorful teller of difficult truths, even if “it makes you cringe every once in a while.”"
        ],
        [
            "“I am not running for president of the United States as surrogate for being elected prom king of America,” Mr. Christie said inside the gymnasium at the high school where he was president of his class all three years."
        ],
        [
            "“I am not going to be the most popular guy who looks into your eye every day and says what you want to hear,” he continued."
        ],
        [
            "Trying to claw his way back to the top of the Republican field, Mr. Christie took a pointed swipe at his rivals who are in the United States Senate, like Marco Rubio and Ted Cruz, who have never run a state government."
        ],
        [
            "“Unlike some people who offer themselves for president in 2016, you won’t have to wonder whether I can do it or not,” he said, invoking the “economic calamity” he said he inherited in 2010 and the “unprecedented natural disaster,” Hurricane Sandy, that he weathered as governor."
        ],
        [
            "But he reserved his deepest disdain for Congress and for the president’s stewardship of foreign affairs, and extended that critique to President Obama’s former secretary of state."
        ],
        [
            "“After seven years of a weak and feckless foreign policy run by Barack Obama, we better not turn it over to his second mate, Hillary Clinton,” Mr. Christie said."
        ],
        [
            "Still, he blamed both parties for dysfunction and gridlock in Washington.",
            "“If Washington and Adams and Jefferson believed that compromise was a dirty word, we’d still be under the crown of England,” he said."
        ],
        [
            "Mr. Christie, whose dazzling rise as a national Republican in his first term was matched only by his spectacular loss of stature at home in his second, entered the presidential race bearing little resemblance to the candidate he once expected to be."
        ],
        [
            "The economic recovery he promised has turned into a cascade of ugly credit downgrades and anemic job growth.",
            "The state pension system he vowed to fix has descended into a morass of missed payments and lawsuits.",
            "The administration he pledged would be a paragon of ethics has instead conspired to mire an entire town in traffic and the governor’s office in scandal."
        ],
        [
            "Three and a half years ago, Mr. Christie seemed such an antidote to all that ailed the Republican brand that senior figures in the party pleaded with him to run for president as a substitute for the eventual nominee, Mitt Romney."
        ],
        [
            "But now, a staggering 55 percent of Republican primary voters say that they cannot envision voting for Mr. Christie, according to an NBC-Wall Street Journal Poll.",
            "The only candidate less palatable: Donald J. Trump, the bombastic developer turned reality television star."
        ],
        [
            "With two pillars of his presidential run — his record and his judgment — looking wobbly, Mr. Christie must now build a campaign around his most raw and prodigious asset: his personality, a magnetic mix of quick-witted charm, insult-trading banter, vulnerability, empathy and effrontery."
        ],
        [
            "It was on vivid display Tuesday before hundreds of supporters, including many of Mr. Christie’s oldest friends and most loyal aides.",
            "He joked about the need for a new and refined tax code that would finally put his father, a certified public account standing nearby, out of business.",
            "He described the decision to enter politics as a “coin toss” between him and his wife, Mary Pat, herself a nimble political mind.",
            "And he put an unusual twist on the dilemma facing the financially stretched Social Security system."
        ],
        [
            "“The lying and stealing has already happened, the horse is out of the barn, we need to get it back in, and the only way to do it is by force,” he said."
        ],
        [
            "Mr. Christie, 52, honed his political technique, and developed a YouTube following, during a remarkable run of 137 town-hall-style meetings across New Jersey.",
            "Not surprisingly, he plans to put the town hall meeting at the center of his candidacy — and to put his hopes in a state, New Hampshire, that is famed for its own town hall meetings.",
            "He is forgoing the customary tour of early-voting states that usually follows a formal announcement, aides said.",
            "Instead, Mr. Christie will plant himself in New Hampshire for a week, holding one town hall after another."
        ],
        [
            "Such single-mindedness belies the serious and stubborn vulnerabilities of his campaign."
        ],
        [
            "As a centrist candidate from the Northeast, he would have a difficult path to the Republican presidential nomination under the best circumstances.",
            "And circumstances are anything but optimal for him: He faces a wide field of candidates, including several who are better financed and beloved by mainstream donors (Jeb Bush), hold greater appeal to conservative voters who dominate the primary process (Scott Walker), are agile public speakers with persuasive biographies (Mr. Rubio), or are better liked by Republican voters (all of the above)."
        ],
        [
            "At his announcement, Mr. Christie sought political rebirth, as he has before, by relying on his powers as a narrator, and mythologizer, of his own story."
        ],
        [
            "Running for president is a new and bigger stage, though, and both Mr. Christie’s stagecraft and his oratory showed room for improvement.",
            "The first speaker who preceded him to the stage had no microphone, causing a delay; later on, she was booed when she disclosed that she was a Democrat."
        ],
        [
            "Without a text, Mr. Christie frequently descended into clichés.",
            "“The truth will set us free,” he said at one point.",
            "“One person can make a difference,” he said at another."
        ],
        [
            "But he also spoke with emotional power, as when he recalled his father’s early job in an ice cream factory in Newark."
        ],
        [
            "“Think about how amazing this country is,” Mr. Christie said.",
            "“That one generation removed from that guy who was working on the floor of the Breyers ice cream plant, his son is the two-term governor of the state that he was born and raised in.”"
        ],
        [
            "The question for Mr. Christie, after a bruising year of watching his story rewritten by others, may be whether Republican voters, who can choose from among a long and intriguing list of fresher faces, will give him a fighting chance to sell himself anew."
        ]
    ],
    "triplet-uuid": "13792511-5142-449f-8d3e-d77d790f65ec",
    "title": "Chris Christie Announces Run, Pledging ‘Truth’ About Nation’s Woes",
    "source": "nyt",
    "url": "https://www.nytimes.com/2015/07/01/us/politics/chris-christie-presidential-campaign.html",
    "main-event": "Chris Christie announces bid for presidency",
    "main-entities": ["Chris Christie"]
}
