{
    "source": "nyt",
    "main-entities": ["Asa Hutchinson","Seth Hutchinson"],
    "main-event": "Seth Hutchinson disagrees with Asa Hutchinson's stand on the religious freedom bill",
    "title": "Arkansas Governor’s Son Thrust Into Spotlight Over Religious Exception Bill",
    "url": "https://mobile.nytimes.com/2015/04/02/us/arkansas-governors-son-thurst-into-spotlight-over-religious-freedom-bill.html",
    "word-count": 606,
    "date": "2015-04-01",
    "uuid": "a1794a8c-74a2-417a-8099-540b3d7d61eb",
    "triplet-uuid": "2742e9c1-2943-496f-8b23-faf5332e1612",
    "body-paragraphs": [
        [
            "When Gov. Asa Hutchinson, Republican of Arkansas, spoke on Wednesday about the future of what proponents call the religious freedom bill pending in his state, he disclosed that the proposal had drawn resistance from a particularly noteworthy critic: his son, Seth Hutchinson."
        ],
        [
            "But to people familiar with the Hutchinsons, long one of the most influential families in Arkansas, the news was hardly a bombshell."
        ],
        [
            "“It would be surprising to me if he didn’t do that,” said Shawn Standefer, a childhood friend of the younger Mr. Hutchinson who captained their national championship-winning Quiz Bowl team in high school.",
            "“He’s always been concerned with justice, however he’s thought of it.”"
        ],
        [
            "And so it was on Saturday, with lawmakers nearing a vote on the legislation that critics said would legalize discrimination against gay people, that the younger Mr. Hutchinson wrote to his father and warned that the proposal could damage Arkansas’s reputation and economy.",
            "It was only the latest chapter in a politically complicated relationship between Asa Hutchinson, a former congressman, and Seth Hutchinson, 31, an organizer for the Texas State Employees Union."
        ],
        [
            "“I love my dad, and we have a good, close relationship,” Seth Hutchinson said on Wednesday.",
            "“But we disagree a lot on political issues.",
            "This is just another one, but a lot of families disagree politically.",
            "But we stay close.”"
        ],
        [
            "Mr. Hutchinson has not always been what he described as the family’s political “black sheep.”"
        ],
        [
            "“I kind of grew up on the campaign trail,” he said.",
            "“Having a political opinion just came naturally to me.",
            "At first, I pretty much followed the values that my family and my parents laid out for me.”"
        ],
        [
            "But, starting when he was about 15 and working as a dishwasher at a diner, Mr. Hutchinson’s views began to change as he shuffled through other jobs, including stints at Chuck E. Cheese’s and Sears.",
            "He grew frustrated when he saw older workers enduring financial hardships in low-paying jobs."
        ],
        [
            "“It just showed me that there’s something wrong,” he said, adding that he became interested in gay rights at about the same time, when friends began discussing their sexual orientations and after the arrest of an art teacher, who was gay."
        ],
        [
            "“He was not out,” Mr. Hutchinson said of the teacher.",
            "“And he was arrested in a park — I think the official charge was attempting to loiter — and it was obvious he was there because he couldn’t be out and keep his job.”"
        ],
        [
            "Mr. Hutchinson had robust political discussions with his father even as a high school student, long before their views diverged so vastly."
        ],
        [
            "“He would defend his views,” Mr. Standefer said.",
            "“And as they changed, he tried to stand by his new views.”"
        ],
        [
            "Mr. Hutchinson spent a year at Georgetown University before enrolling at the University of Central Arkansas, where he joined groups like the Young Democratic Socialists, and rallied for gay rights during the tenure of another Republican, Gov. Mike Huckabee.",
            "He would contact a cousin, Tim C. Hutchinson, who sat in the State House of Representatives, to register his views."
        ],
        [
            "Seth Hutchinson later moved to Texas and became a labor activist, which the governor mentions to left-leaning audiences."
        ],
        [
            "Father and son communicate regularly, Seth Hutchinson said, and the family gathers at least once or twice a year."
        ],
        [
            "“It’s always a lively and engaging conversation,” Mr. Hutchinson said."
        ],
        [
            "On Wednesday, the governor said he would ask lawmakers to either recall or rewrite portions of the bill.",
            "Seth Hutchinson, though, refused to take credit."
        ],
        [
            "“I did not sway my dad,” he said.",
            "“I think my dad is rethinking this because of the pressure that’s coming at him from all sides.”"
        ]
    ]
}
