{
    "source": "fox",
    "main-entities": ["Mike Pence","Ed Murray","Jay Inslee","Religious Freedom Restoration Act"],
    "main-event": "Washington gov, Seattle mayor oppose the Religious Freedom Restoration Act",
    "title": "Washington gov, Seattle mayor ban official travel to Indiana in wake of 'religious freedom' law",
    "url": "http://www.foxnews.com/politics/2015/03/31/seattle-mayor-bans-official-travel-to-indiana-amid-opposition-to-state-new.html",
    "word-count": 726,
    "date": "2015-03-31",
    "uuid": "19e13838-5b2c-469b-a473-0cb10e093330",
    "triplet-uuid": "4f473faf-f928-4cfd-8bed-00578be9db9a",
    "body-paragraphs": [
        [
            "The backlash to Indiana's new religious freedom law grew Monday, even as state lawmakers move to clarify the legislation, with Wash. Gov. Jay Inslee and Seattle Mayor Ed Murray banning government-funded travel to Indiana."
        ],
        [
            "The statements are the latest boycott threats to emerge over claims that the law has the potential to discriminate against gays and others."
        ],
        [
            "Murray, a Democrat who is openly gay, issued his ban via executive order over the weekend, and Inslee issued his Monday afternoon."
        ],
        [
            "“I find Indiana’s new law disturbing, particularly at a time when more and more states and people in America are embracing civil rights for everyone,\" Inslee said in a statement.",
            "\"Washington will join other states and cities in opposing this law and I will impose an administration-wide ban on state-funded travel to Indiana.\""
        ],
        [
            "Murray says the law doesn't reflect Seattle residents’ values.",
            "He also has told all city departments to review their contracts to see whether Seattle is doing business with any company whose headquarters is in Indiana."
        ],
        [
            "“Seattleites know that discrimination has no place in our city,” he said in a statement.",
            "“That’s just equality 101.”"
        ],
        [
            "The primary concern is that the law might allow a business to discriminate against gay residents, such as a baker being allowed refuse an order from a gay couple for a wedding cake."
        ],
        [
            "But state lawmakers and Republican Gov. Mike Pence have been defending and trying to explain the Religious Freedom Restoration Act ever since the governor signed it into law on Thursday.",
            "They note that then-President Bill Clinton in 1993 signed similar federal legislation into law, and 19 other states also have similar policies."
        ],
        [
            "However, the Indiana law differs in several ways, primarily in that it allows a business to assert a right to \"the free exercise of religion.\""
        ],
        [
            "On Monday, state Senate President Pro Tem David Long and House Speaker Brian Bosma, both Republicans, held a press conference to further explain the law.",
            "They said they will swiftly try to \"clarify\" its language."
        ],
        [
            "“The new law does not discriminate,” Long said.",
            "“And it will not be allowed.",
            "To the extent that we need to clarify through legislative action, we plan to do just that.”"
        ],
        [
            "Aside from Indiana, 15 other states have introduced legislation in 2015 to craft or alter their religious freedom laws.",
            "Oklahoma, South Carolina and Texas have introduced legislation to amend their laws.",
            "Arkansas, Colorado, Georgia, Hawaii, Michigan, Montana, Nevada, North Carolina, South Dakota, Utah, West Virginia and Wyoming are looking to put a similar law on their books."
        ],
        [
            "Bosma acknowledged a major concern is whether businesses will now be legally permitted to deny services to some people, as a result of the law, and that even he is unclear."
        ],
        [
            "“We don’t believe that will be the effect,” he said.",
            "“We are looking at options to clarify that that's the case.”"
        ],
        [
            "Long and Bosma also conceded they called the press conference because Pence failed to clearly explain the law during an appearance Sunday on ABC’s “This Week.”"
        ],
        [
            "Pence said the legislation prohibits Indiana laws that \"substantially burden\" a person's ability to follow his or her religious beliefs, with the definition of \"person\" including religious institutions, businesses and associations."
        ],
        [
            "However, he did not answer directly when asked six times whether, under the law, it would be legal for a merchant to refuse to serve gay customers."
        ],
        [
            "Long on Monday also denied that a clarification of the law would be needed before this weekend’s men’s NCAA Final Four basketball championships, in Indianapolis."
        ],
        [
            "A record-breaking 158,682 people attended the games last year in Texas.",
            "And any boycott would have the potential to cut much anticipated revenue for Indianapolis-area hotels, restaurants and other businesses."
        ],
        [
            "The NCAA, whose headquarters is in Indianapolis, also has expressed concern about the law, as figures in corporate America and Hollywood voice their opposition."
        ],
        [
            "“We are especially concerned about how this legislation could affect our student-athletes and employees,” said NCAA President Mark Emmert.",
            "“We intend to closely examine the implications of this bill and how it might affect future events as well as our workforce.\""
        ],
        [
            "Angie’s List, the business-rating website, this weekend put on hold plans to expand its Indianapolis headquarters."
        ],
        [
            "Actor George Takei is calling for a boycott.",
            "And actor Ashton Kutcher recently tweeted: “Indiana are you also going to allow Christian establishments to ban Jews from coming in? Or Vice Versa? Religious freedom??? #OUTRAGE.”"
        ]
    ]
}
