{
    "source": "fox",
    "main-entities": ["Marco Rubio", "Barack Obama"],
    "main-event": "Marco Rubio announces his foreign policy",
    "title": "In first foreign policy speech, candidate Rubio pushes stronger U.S. leadership",
    "url": "http://www.foxnews.com/politics/2015/05/13/in-first-foreign-policy-speech-candidate-marco-rubio-pushes-stronger-us.html",
    "word-count": 909,
    "date": "2015-05-13",
    "uuid": "c430a2e0-646b-477b-927f-770e81a15118",
    "triplet-uuid": "7f9c83f7-3efa-4c7a-adef-3ebdeda96042",
    "keywords": "",
    "body-paragraphs": [
        [
            "New York – In his first major foreign policy speech since launching his presidential campaign, U.S. Sen. Marco Rubio said if elected, he would prioritize a strong military, take aggressive steps to fight nations that undermine global commerce and ensure that U.S. is a world moral leader."
        ],
        [
            "The Florida Republican, who delivered his speech at the Council on Foreign Relations in Manhattan on Wednesday, said that the United States was losing its place as a world military and moral power because of what he depicted as the Obama administration’s overly cautious responses to crises overseas."
        ],
        [
            "“Since the end of the Cold War, the threats facing America have changed, but the need for American strength has not,” Rubio said.",
            "“It has only grown more pressing as the world has grown more interconnected.”"
        ],
        [
            "“It takes forethought to design and many years to build the capabilities we may need at a moment’s notice,\" the 43-year-old said.",
            "\"So to restore American strength, my first priority will be to adequately fund our military.",
            "This would be a priority even in times of peace and stability, though the world today is neither peaceful nor stable.”"
        ],
        [
            "Rubio repeated his characterization of Obama as a president so concerned with softening any perception other nations has of the United States as a bully that he erred in acting in the other extreme, eager to acquiesce to foreign governments that have thumbed their noses at the U.S. and international laws."
        ],
        [
            "“[Obama] demonstrated a disregard for our moral purpose that at times flirted with disdain,” said Rubio, the son of Cuban immigrants.",
            "“He criticized America for having ‘arrogance’ and the audacity to ‘dictate our terms’ to other nations.",
            "From his reset with Russia, to his open hand to Iran, to his unreciprocated opening to Cuba, he has embraced regimes that systematically oppose every principle our nation has long championed.”"
        ],
        [
            "Rubio also said that the United States must move decisively when aggressive nations such as China and Iran attempt to undermine the economic interests of the United States as well as other nations."
        ],
        [
            "\"Russia, China, Iran or any other nation that attempts to block global commerce will know to expect a response from my administration.”"
        ],
        [
            "The Democratic National Committee issued a brief statement shortly after Rubio's speech:"
        ],
        [
            "“Okay. So here’s Rubio’s alleged ‘new’ foreign policy.",
            "Troops in the Middle East permanently.",
            "A Cuba policy that is stuck in the Cold War.",
            "Unwillingness to even start a discussion of a two state solution.",
            "Keeping Guantanamo Bay open.",
            "No plan forward on Iran.\""
        ],
        [
            "And it ended with: “Neoconservative meets Cold War: that’s the Rubio doctrine.”"
        ],
        [
            "Rubio’s foreign policy agenda – often hawkish in approach – has been a hallmark of his service in the Senate, and now in his campaign.",
            "He says that as a member of Senate Foreign Relations Committee, and the Senate Committee on Intelligence, he is privy to information that form the basis of his decision on how the United States must approach foreign policy."
        ],
        [
            "Rubio said Obama \"wasted no time stripping parts from the engine of American strength,\" and cast former Secretary of State Hillary Clinton as his loyal deputy."
        ],
        [
            "\"[Clinton] was the chief architect of a foreign policy that was a disaster,\" he said during an interview with Charlie Rose following the speech."
        ],
        [
            "\"We simply cannot afford to elect as our next president one of the leading agents of this administration's foreign policy — a leader from yesterday whose tenure as secretary of state was ineffective at best and dangerously negligent at worst,\" Rubio said, according to the prepared text of remarks he was to deliver at the Council on Foreign Relations in New York."
        ],
        [
            "He even has taken tougher stances on foreign policy than some of his Republican colleagues, who have softened their views on diplomatic relations with Cuba – to which Rubio objects – and how to handle the nuclear talks with Iran."
        ],
        [
            "Some in the GOP have called for spending cuts in military spending, with which he disagrees."
        ],
        [
            "As he often has in Senate hearings, Rubio assailed Obama for stressing dialogues and diplomacy over ironclad dealings with heads of foreign governments that have been openly hostile to the United States, and which continue to exercise oppression against political dissidents."
        ],
        [
            "“The world is at its safest when America is at its strongest,” Rubio said.",
            "“When America has the mightiest Army, Navy, Air Force, Marine Corps, Coast Guard, and intelligence community in the world, the result is more peace, not more conflict.”"
        ],
        [
            "Rubio said, after his speech, in a question-and-answer session with TV host Charlie Rose, that \"Obama has embraced regimes that systematically opposed our principles.\""
        ],
        [
            "Rose asked Rubio what he though of Pope Francis's embrace of diplomatic relations between the U.S. and Cuba."
        ],
        [
            "Rubio said his priorities and those of the pope's are by necessity different."
        ],
        [
            "He defended keeping the embargo."
        ],
        [
            "He said having anything to do with Cuba is to avail oneself of properties stolen from Cubans by the Cuban government during the revolution."
        ],
        [
            "Rubio said the embargo is not to blame for Cuba's failed economy."
        ],
        [
            "He said the rest of the world does not have an embargo against Cuba.",
            "So why, he asked, does Cuba not have Toyotas or modern goods from other nations?"
        ],
        [
            "As for Iran, Rubio said it cannot be trusted."
        ],
        [
            "\"Iran has always had a secret component to its nuclear program,\" he said.",
            "\"They know once international sanctions are lifted, they can never be reimposed.\""
        ]
    ]
}
