{
    "source": "fox",
    "main-entities": ["Hillary Clinton", "Barack Obama"],
    "main-event": "Questions raised about Clinton's stance on the trade deal",
    "title": "Clinton, advisers have lots to say on key trade legislation, except where candidate stands",
    "url": "http://www.foxnews.com/politics/2015/06/14/clinton-stays-mum-on-critical-trade-agreement-adviser-says-waiting-for-final.html",
    "word-count": 805,
    "date": "2015-06-15",
    "uuid": "c86aca6f-3cec-4089-8a0a-2746c2020474",
    "triplet-uuid": "8dac6c12-b5ca-468c-a249-7e0ab42f6b52",
    "body-paragraphs": [
        [
            "Hillary Clinton said Sunday the problems that Congress has with President Obama’s trade agenda should be an opportunity for the president to ask fellow Democrats about their concerns with the proposal but still declined to say whether she supports or opposes the legislation."
        ],
        [
            "\"Let's take the lemons and turn it into lemonade,\" Clinton told about 600 supporters at the Iowa State Fairgrounds, addressing the controversial Trans Pacific Partnership trade proposal that has splintered Obama from House Minority Leader Nancy Pelosi, D-Calif., and rank-and-file Democrats."
        ],
        [
            "The legislation would give the president “fast-track” authority to approve pending trade deals with 11 Pacific Rim nations.",
            "The measure also allows Congress to approve or reject such deals, but not amend them."
        ],
        [
            "Courting Iowa voters, Clinton sought to address Democratic opponents of the trade legislation, including liberals and labor unions, who have said the Obama-backed plan will cost U.S. jobs.",
            "The agreement has not been finalized or submitted to Congress."
        ],
        [
            "\"The president should listen to and work with his allies in Congress, starting with Nancy Pelosi, who had expressed their concerns about the impact that a weak agreement would have on our workers to make sure we get the best strongest deal possible,\" Clinton said.",
            "\"And if we don't get it, there should be no deal.\""
        ],
        [
            "The White House and Republican leaders in Congress now face long odds in trying to revive the trade legislation after congressional Democrats helped defeat a job retraining program to jeopardize Obama's attempt to secure the fast-track authority."
        ],
        [
            "Clinton appeared to be seeking a middle ground, saying while some support the deal and others vehemently oppose it, \"I kind of fall in the group that says ‘what's in it?’ And ‘let's make it as good as it can be, and then let's make a decision.’ ”"
        ],
        [
            "She said Obama had an \"amazing opportunity\" to negotiate better terms and reiterated the criteria of worker protections, wages and national security provisions she would seek in a final deal."
        ],
        [
            "Clinton said any deal should include the scuttled Trade Adjustment Assistance program to help retrain workers."
        ],
        [
            "Trade has emerged as an early divider within the Democratic primary."
        ],
        [
            "Vermont Independent Sen. Bernie Sanders, who was campaigning in Iowa on Sunday, has opposed the trade deal and questioned Clinton's refusal to say where she stood."
        ],
        [
            "\"It is a failed trade policy, and I would hope that the Secretary joins Elizabeth Warren, and vast majority of Democrats in the Congress in saying, ‘No, we've got to defeat this piece of legislation,’ ” Sanders said on CBS' \"Face the Nation.\""
        ],
        [
            "Former Maryland Gov. Martin O'Malley has also opposed the deal.",
            "In a sign of its resonance within the party, his campaign noted in an email to supporters Saturday that Clinton's speech in New York didn't \"weigh in on the secretive TPP deal that could depress American wages and cost American jobs.\""
        ],
        [
            "The Obama administration has said it remains confident there are ways to get the trade provisions through Congress."
        ],
        [
            "Republican leaders generally support Obama's trade proposal and have suggested they may try to revive the bill as early as this week."
        ],
        [
            "\"Republicans delivered,\" Wisconsin GOP Rep. Paul Ryan, chairman of the House Ways and Means Committee, said on \"Fox News Sunday.\"",
            "\"The question is: Are the Democrats going to do this to their president?\""
        ],
        [
            "While Clinton called the pact the \"gold standard\" of trade agreements while serving as secretary of state, she has refused to take a position on the deal since announcing her candidacy."
        ],
        [
            "That brought criticism from Republican National Committee spokesman Michael Short on Sunday."
        ],
        [
            "\"By waffling on a trade deal she helped negotiate and once called a \"gold standard,\" Hillary Clinton continues to show why voters overwhelmingly see her as dishonest and untrustworthy,\" Short said in a statement."
        ],
        [
            "Clinton was spending most of the weekend in Iowa after formally launching her campaign in New York City, seeking to build an organizational edge in the state that tripped up her first presidential campaign against Obama."
        ],
        [
            "Sanders was campaigning across the state and former Virginia Sen. Jim Webb, who is exploring a potential Democratic bid, also was holding events in Iowa on Sunday.",
            "O'Malley held a day's events in the state last week."
        ],
        [
            "Earlier in the day, top Clinton advisers, including senior spokeswoman Karen Finney, said that Clinton is waiting to see the final deal and that she has explained her position in recent weeks."
        ],
        [
            "\"We’ll see where this process goes,\" Finney told Fox News.",
            "\"This is someone who has voted for trade agreements when they have been good for the country and against trade agreements when she thought they were bad for the country.\""
        ],
        [
            "Campaign Chairman John Podesta told NBC’s “Meet the Press” that Clinton “has a clear standard that (the deal) has got to be good for American workers or she thinks the United States should walk away from it.”"
        ]
    ]
}
