{
    "source": "hpo",
    "main-entities": ["Hillary Clinton","George W. Bush"],
    "main-event": "John McCain suggests Hillary Clinton's use of personal email was hypocritical",
    "title": "John McCain Suggests Hillary Clinton's Use Of Personal Email Was Hypocritical",
    "url": "http://www.huffingtonpost.com/2015/03/05/john-mccain-hillary-clinton_n_6812422.html",
    "word-count": 350,
    "date": "2015-03-05",
    "uuid": "716084b8-2a43-4f01-ad49-7681a0a8a016",
    "triplet-uuid": "a4edca3f-931f-4785-8c3f-f3d8fa84cbec",
    "body-paragraphs": [
        [
            "He may have a personal fondness for her, but Sen. John McCain (R-Ariz.) suggested Thursday that Hillary Clinton’s exclusive use of personal email while serving as secretary of state was hypocritical. "
        ],
        [
            "“This is the same individual that just excoriated the Bush administration for supposedly hiding communications within the administration,” McCain said on MSNBC’s “Andrea Mitchell Reports.”"
        ],
        [
            "While serving as a senator from New York in 2007, Clinton criticized the Bush administration for its \"secrecy,\" according to The Hill.",
            "\"We know about the secret wiretaps, we know about the secret military tribunals, the secret White House email accounts,\" she said.",
            "\"It’s a stunning record of secrecy and corruption, of cronyism run amok.\""
        ],
        [
            "Clinton, who is often described as the Democratic presidential frontrunner for 2016, has faced scrutiny since Monday when The New York Times reported that she may have violated federal records law by using a personal email account for all of her work messages as secretary of state.",
            "She served in that position from 2009 to 2013."
        ],
        [
            "Democrats came to her defense, and other media outlets soon pointed out that the rules against using personal email were not relayed to government officials until 2014.",
            "But likely GOP presidential candidate Jeb Bush suggested that the use of personal email demonstrated a lack of transparency."
        ],
        [
            "Clinton responded to the controversy on Wednesday, tweeting that she had asked the State Department to make her private emails publicly available."
        ],
        [
            "While on Mitchell's show, McCain also raised the concern that there's no way of knowing if all of Clinton's emails have been saved, since they were not originally retained by the government."
        ],
        [
            "\"The question that I think's gonna rise over time is, how can we be confident that once she carries out what she tweeted -- that she wants all the emails known -- how are we gonna know that?",
            "How are we gonna have verification of that?\" McCain said.",
            "\"So I think this is serious. And I'm willing to give her or anyone who defends her the benefit of defending it or explaining it, but on its face, it seems to be rather serious.\""
        ]
    ]
}
