{
    "source": "fox",
    "main-entities": ["Mike Huckabee"],
    "main-event": "Mike Huckabee announced his run for the presidency",
    "title": "Huckabee announces 2016 White House bid, with focus on economy and security | Fox News",
    "url": "http://www.foxnews.com/politics/2015/05/05/huckabee-announces-2016-white-house-bid.html",
    "word-count": 875,
    "date": "2015-05-05",
    "uuid": "9d39afe0-4041-4e06-86e5-ff2a92a08a32",
    "triplet-uuid": "af4a3f41-eeb5-49fa-a276-e97c230b25f0",
    "body-paragraphs": [
        [
            "Former Arkansas Gov. Mike Huckabee announced Tuesday he is running for president, delivering an economy- and security-centered message that he hopes will appeal to everyday Americans and distinguish him from the already-crowded Republican field."
        ],
        [
            "Huckabee, who is embarking on his second presidential run, made the announcement in his hometown of Hope, Ark.",
            "In a 30-minute speech that focused on his humble beginnings, Huckabee vowed to end “stagnant wages,” protect Medicare and defeat radical Islamic terrorism."
        ],
        [
            "“Folks cannot seem to get ahead or even stay even,” he said."
        ],
        [
            "Huckabee, a former Baptist minister, ran for president in 2008, winning eight states including the first-in-the-nation Iowa caucuses before running out of money and exiting the race."
        ],
        [
            "“Folks, it’s a long way from a little brick rented house on Second Street in Hope, Arkansas, to the White House,” he said.",
            "\"But here in this small town called Hope, I was raised to believe where a person started didn't mean that is where he had to stop.",
            "I always believed that kid could go from hope to higher ground.\""
        ],
        [
            "The 59-year-old Huckabee has a strong following among the party’s evangelical Christian base but this time will face stiff competition for that vote from such primary candidates as Dr. Ben Carson and Sen. Ted Cruz, of Texas."
        ],
        [
            "He frequently repeated the phrase, “Hope to higher ground,” which appears to be a slogan of sorts for his 2016 campaign."
        ],
        [
            "He also took a swipe at President Obama for declining to recognize the Islamic State group as radical Islamic terrorists and vowed to stop them."
        ],
        [
            "\"I wonder if he can watch a Western from the '50s and be able to figure out who the good guy and the bad guys really are,\" Huckabee said.",
            "\"As president, I promise you, we will no longer try to contain Jihadism. We will conquer it.”"
        ],
        [
            "He also vowed to protect Medicare and give states more of a say in government and education."
        ],
        [
            "Huckabee, who left his job as a Fox News host earlier this year in preparation for a potential 2016 run, was Arkansas governor from 1996 to 2007, serving after Bill Clinton, who also is from Hope.",
            "And he was the state’s lieutenant governor from 1993 to 1996."
        ],
        [
            "Even before the speech, Huckabee was trying to position himself as the GOP candidate best equipped to defeat Hillary Clinton, the Democratic frontrunner."
        ],
        [
            "In a recent campaign video, Huckabee argued that in his more than 10 years as governor, he took on Democrats in \"Bill Clinton's Arkansas\" after then-candidate Bill Clinton won election to the White House in 1992."
        ],
        [
            "\"Every day in my life in politics was a fight,\" Huckabee says in the video, released as a preview of his Tuesday announcement.",
            "\"But any drunken redneck can walk into a bar and start a fight.",
            "A leader only starts a fight he's prepared to finish.\""
        ],
        [
            "The field of confirmed and potential GOP presidential candidates includes more than a dozen people."
        ],
        [
            "A new NBC/ Wall Street Journal poll of GOP primary voters shows 23 percent picked former Florida Gov. Jeb Bush as their first choice."
        ],
        [
            "Bush is followed in the poll by Florida Sen. Marco Rubio with 18 percent, Wisconsin Gov. Scott Walker with 14 percent, Cruz and Kentucky Sen. Rand Paul with 11 percent, Carson with 7 percent, Huckabee and New Jersey Gov. Chris Christie at 5 percent, former Texas Gov. Rick Perry at 2 percent and former Hewlett-Packard chief executive Carly Fiorina at 1 percent."
        ],
        [
            "Huckabee is the third Republican this week to announce a 2016 White House bid, following Fiorina and Carson, a retired neurosurgeon They join Cruz, Paul and Rubio."
        ],
        [
            "Campaign aides say Huckabee’s path to winning the party nomination this time will be to appeal to working-class cultural conservatives, pitching their candidate as an economic populist and foreign affairs hawk who holds deeply conservative views on social issues such as abortion and gay marriage."
        ],
        [
            "Huckabee advocates a national consumption tax, which is similar to a sales tax, to replace the existing federal taxes on personal income and payrolls.",
            "He rejects calls for a minimum wage hike, saying his proposals will yield a \"maximum wage\" for workers."
        ],
        [
            "On immigration, he insists on a secure border and bemoans the presence of millions of people who are living in the country illegally, though he favors a creating a path to citizenship for children of immigrant parents who brought them to the U.S. illegally."
        ],
        [
            "Like other Republican White House hopefuls, Huckabee is sharply critical of Obama's foreign policy.",
            "He has called for \"bombing the daylights\" out of Islamic State targets in the Middle East, though he says American troops should be deployed to the region only as part of an international coalition that includes nations such as Saudi Arabia and Jordan."
        ],
        [
            "But whatever the issue, Huckabee, also an author, wraps his appeal as a pitch to everyday Americans who he says \"don't feel like anybody understands or knows who they are, much less cares what's happening to them.\""
        ],
        [
            "Evangelical Christian voters helped Huckabee win the Iowa caucuses in 2008 and finish a strong second in South Carolina, the largest of the early-voting states."
        ],
        [
            "He would need to replicate that early success to create an opening to build a wider coalition and compete deep into the primary schedule."
        ]
    ]
}
