{
    "source": "hpo",
    "main-entities": ["Mike Huckabee"],
    "main-event": "Mike Huckabee announced his run for the presidency",
    "title": "Mike Huckabee Is Running For President",
    "url": "http://www.huffingtonpost.com/2015/05/05/mike-huckabee-2016_n_7120826.html",
    "word-count": 671,
    "date": "2015-05-05",
    "uuid": "6222fc9f-4cdf-435f-bbf0-41eff396a3e0",
    "triplet-uuid": "af4a3f41-eeb5-49fa-a276-e97c230b25f0",
    "body-paragraphs": [
        [
            "Mike Huckabee, the Baptist minister who became Arkansas governor, announced Tuesday he'll run for the 2016 Republican presidential nomination."
        ],
        [
            "Huckabee made the announcement in his hometown of Hope, Arkansas."
        ],
        [
            "\"I am a candidate for president of the United States of America,\" he said."
        ],
        [
            "During his announcement, Huckabee said that he would \"conquer Jihadism\" and protect Social Security.",
            "He also criticized the Supreme Court for potentially overturning bans on same-sex marriage.",
            "He also said that he favored term limits for individuals in all branches of the federal government -- including the judiciary."
        ],
        [
            "\"The Supreme Court is not the supreme being,\" he said."
        ],
        [
            "Huckabee, 59, quit his job hosting his own Fox News show, \"Huckabee,\" in January.",
            "Last month, he began plotting campaign strategy and hiring staff."
        ],
        [
            "Huckabee ran for president in 2008.",
            "He joins an already crowded 2016 Republican field, and will likely enlist support from the party's far right wing, where he faces competition from Sen. Ted Cruz (R-Texas), who has positioned himself as a tea party favorite.",
            "Huckabee said on CBS's \"Face the Nation\" last month that he's confident he can broaden his appeal beyond evangelical Christians and social conservatives to reach working-class Republicans concerned about the economy."
        ],
        [
            "\"There's a real sense in the Republican Party that there's no one speaking, not only to them, but speaking for them,\" Huckabee said then.",
            "\"And if someone can capture both the blue-collar, working-class Republicans, the conservatives, many of them even union members, as well as evangelicals, there's a real pathway to the nomination.\""
        ],
        [
            "Huckabee, an ordained Southern Baptist minister, is a celebrated figure among evangelical Christians.",
            "He was the longest-serving Arkansas governor, from 1996 to 2007.",
            "He made national headlines for losing more than 110 pounds from 2003 to 2006, and he publicly addressed his struggles with weight.",
            "His book, \"Quit Digging Your Grave with a Knife and Fork,\" became a bestseller and he made obesity a major policy initiative as governor."
        ],
        [
            "He ran for the GOP presidential nomination in 2008, capturing strong support from evangelical Christians and winning the Iowa caucuses.",
            "But Sen. John McCain (R-Ariz.), won most of the subsequent primaries, and Huckabee withdrew from the race that March.",
            "His supporters expected him to run again in 2012, but he declined.",
            "Since then, he has continued to influence the conservative movement as a charismatic public speaker and radio and television host."
        ],
        [
            "Huckabee's religion has played a prominent role in his political career and shaped him as a staunch social conservative.",
            "He wrote in his memoir, \"From Hope to Higher Ground,\" that his work as a pastor helps him understand how politics and policy affect people."
        ],
        [
            "\"My experience dealing every day with real people who were genuinely affected by policies created by government gave me a deep understanding of the fragility of the human spirit and vulnerability of so many families who struggled from week to week,\" he wrote.",
            "\"I was in the ICU at 2 a.m. with families faced with the decision to disconnect a respirator on their loved one; I counseled fifteen-year-old pregnant girls who were afraid to tell their parents about their condition; I spent hours hearing the grief of women who had been physically and emotionally clobbered by an abusive husband.\""
        ],
        [
            "As governor, Huckabee signed a ban on gay marriage (which was overturned by a federal judge last year), and he has been outspoken in his opposition against states legalizing marriage equality.",
            "Last year, he argued that he's on \"the right side of the Bible.\""
        ],
        [
            "\"You've got to understand, this for me is not about the right side or the wrong side of history, this is the right side of the Bible, and unless God rewrites it, edits it, sends it down with his signature on it, it's not my book to change.",
            "Folks, that's why I stand where I stand,\" he said."
        ],
        [
            "According to HuffPost Pollster, Huckabee falls behind a few other GOP 2016 candidates, trailing Sens. Rand Paul (Ky.) and Ted Cruz (Texas), and Marco Rubio (Fla.), but slightly edging out former neurosurgeon Ben Carson."
        ]
    ]
}
