{
    "source": "nyt",
    "main-entities": ["Hillary Clinton", "Trey Gowdy"],
    "main-event": "Benghazi committee wants to interview Clinton about emails",
    "title": "House Panel Seeks Private Talk With Hillary Clinton About Email",
    "url": "https://www.nytimes.com/2015/04/01/us/politics/hillary-clinton-email-benghazi-inquiry.html",
    "word-count": 833,
    "date": "2015-03-31",
    "uuid": "6257d6b8-9698-44c9-b320-fe5e18536c42",
    "triplet-uuid": "c5534b7e-a373-4962-8345-3847bc41a636",
    "body-paragraphs": [
        [
            "WASHINGTON — The chairman of the House committee investigating the Benghazi attacks asked Hillary Rodham Clinton on Tuesday to appear for a private interview about her exclusive use of a personal email account when she was secretary of state."
        ],
        [
            "Mrs. Clinton’s “email arrangement with herself is highly unusual, if not unprecedented,” the committee’s chairman, Representative Trey Gowdy, Republican of South Carolina, wrote in a letter to Mrs. Clinton’s lawyer Tuesday morning.",
            "He added that Mrs. Clinton’s disclosure last week that all of the emails from the personal account had been deleted “only exacerbates our need to better understand what the secretary did, when she did it and why she did it.”"
        ],
        [
            "The emails were on a server at her home in Chappaqua, N.Y. Mr. Gowdy had asked Mrs. Clinton to turn over that server to a neutral third party, like the State Department’s inspector general, to determine which emails were personal and which were government records."
        ],
        [
            "But in a letter to Mr. Gowdy on Friday, a lawyer for Mrs. Clinton said there was no need to turn over the server because an examination of it showed that it had no copies of emails she sent during her time as secretary of state."
        ],
        [
            "In October, the State Department asked former secretaries of state dating back to Madeleine Albright to provide it with any government records — like emails — they might have in their possession.",
            "The lawyer for Mrs. Clinton, David Kendall, said that in response to that request, Mrs. Clinton’s representatives had determined which of her roughly 60,000 emails were personal and private.",
            "Then, he said, a setting on the email account was changed to retain only messages sent in the previous two months."
        ],
        [
            "Since the report by The New York Times on March 2 that Mrs. Clinton used only a personal email account and did not even have a government account, she seems to have provided two answers about whether she still has copies of her emails."
        ],
        [
            "At a news conference at the United Nations a little more than a week after The Times’s report, Mrs. Clinton first said she “chose not to keep” her private personal emails.",
            "But she then said that the server, which contained personal communications of her husband, former President Bill Clinton, “will remain private.”"
        ],
        [
            "Mr. Gowdy said the committee believed that “a transcribed interview would best protect Secretary Clinton’s privacy, the security of the information queried and the public’s interest in ensuring this committee has all information needed to accomplish the task set before it.”"
        ],
        [
            "But Mrs. Clinton indicated on Tuesday that she wanted to give her testimony in a public setting.",
            "In a written statement, a spokesman for her said she had told the committee months ago that she was prepared to testify at a public hearing.",
            "“It is by their choice that hasn’t happened,” said the spokesman, Nick Merrill.",
            "“To be clear, she remains ready to appear at a hearing open to the American public.”"
        ],
        [
            "The committee’s ranking member, Elijah E. Cummings, Democrat of Maryland, said the panel should hold a public hearing instead of a private interview.",
            "“Rather than drag out this political charade into 2016 and selectively leak portions of a closed-door interview, the committee should schedule the public hearing, make her records public and refocus its efforts on the attacks in Benghazi,” he said."
        ],
        [
            "Mr. Gowdy has sought to prevent his inquiry into the attacks in 2012 on an American diplomatic compound in Benghazi, Libya — and its burgeoning examination of Mrs. Clinton’s email practices — from being dismissed as a strictly partisan effort to embarrass a likely Democratic nominee for president.",
            "But the time frame in which he is asking Mrs. Clinton to submit to questioning — at any time before May 1 — coincides with the period in which she is widely expected to make her candidacy official."
        ],
        [
            "Some Republicans on Capitol Hill — including Mr. Gowdy — are growing frustrated with Reince Priebus, the chairman of the Republican National Committee, who they contend is politicizing the email issue.",
            "On Monday, Mr. Priebus said in an appearance on Fox News that Mrs. Clinton’s decision to delete her emails “is criminal in nature.”"
        ],
        [
            "“I mean, you cannot just destroy documents when an agency is telling you to turn them over,” Mr. Priebus said on “Fox and Friends.”"
        ],
        [
            "“Even Nixon didn’t destroy the tapes,” Mr. Priebus said, referring to the Watergate scandal that ultimately led to President Richard M. Nixon’s resignation.",
            "“There are thousands and thousands of emails that are missing.”"
        ],
        [
            "In an interview Tuesday, Mr. Gowdy said Mr. Priebus had overstepped his expertise."
        ],
        [
            "“As far as I know, he’s not an expert in federal record-keeping law,” Mr. Gowdy said of Mr. Priebus.",
            "“And I’m 100 percent positive he is not a member of the executive branch, which is charged with investigating and prosecuting under the law.”"
        ],
        [
            "“We don’t know enough facts, so why speculate?” Mr. Gowdy added.",
            "“We should keep our conclusions and speculation to a minimum and follow the facts.”"
        ]
    ]
}
