{
    "source": "hpo",
    "main-entities": [
        "Michael Flynn",
        "Donald Trump"
    ],
    "main-event": "Flynn pleaded guilty",
    "title": "Donald Trump Defends Michael Flynn By Saying Hillary Clinton Is The Real Liar",
    "url": "https://www.huffingtonpost.com/entry/donald-trump-defends-michael-flynn_us_5a255146e4b03c44072ed3e1",
    "word-count": 377,
    "date": "2017-12-04",
    "uuid": "f404bddb-8ab6-4fc7-a3e4-3622ddf4256f",
    "triplet-uuid": "0c78e748-efbf-417c-a8c1-beeb6480147f",
    "body-paragraphs": [
        [
            "WASHINGTON ― President Donald Trump on Monday defended his former national security adviser, Michael Flynn, by invoking his 2016 election opponent, Hillary Clinton."
        ],
        [
            "“I feel very badly for Gen. Flynn,” Trump told reporters before leaving for a trip to Utah, saying that Flynn’s life has been “ruined.”"
        ],
        [
            "Trump then pivoted to Clinton, apparently referring to the FBI’s investigation into her use of a private email server."
        ],
        [
            "“Hillary Clinton lied many times to the FBI, and nothing happened to her.",
            "Flynn lied, and it destroyed his life, and I think it’s a shame,” Trump said, before again claiming that Clinton “lied many times, [and] nothing happened to her.",
            "Flynn lied, and it’s like, it ruined his life.",
            "It’s very unfair.”"
        ],
        [
            "The president this morning says 'I feel badly for General Flynn.'",
            "#MorningJoe pic.twitter.com/tBp5aXWhBj — Morning Joe (@Morning_Joe) December 4, 2017"
        ],
        [
            "Flynn pleaded guilty on Friday for lying to the FBI in special counsel Robert Mueller’s investigation into possible collusion between Trump’s campaign and Russia, becoming the first former administration official to face charges in the probe."
        ],
        [
            "Trump and the White House have long claimed that the investigations into the campaign have nothing to do with Trump himself.",
            "Flynn’s indictment, however, makes it increasingly difficult for the president to distance himself."
        ],
        [
            "Flynn stepped down in February, saying that he had misled the transition team, including then Vice President-elect Mike Pence, about the extent of his contacts with Russian officials, which included discussing sanctions and the creation of a backchannel with the Kremlin."
        ],
        [
            "Trump and his lawyer, John Dowd, now claim that the president already knew about Flynn lying to the FBI, renewing questions of whether Trump obstructed justice in the investigation."
        ],
        [
            "In May, Trump told NBC’s Lester Holt that he fired then-FBI Director James Comey with “this Russia thing” in mind.",
            "The following month, Comey testified before the Senate that Trump had requested that Comey put an end to the agency’s investigation into Flynn."
        ],
        [
            "In an interview with Axios published Monday, Dowd brought out a new defense: Trump isn’t guilty of obstructing justice because he is the president."
        ],
        [
            "The “President cannot obstruct justice because he is the chief law enforcement officer under [the Constitution’s Article II] and has every right to express his view of any case,” Dowd said."
        ]
    ]
}
