{
    "uuid": "6fdef7db-1260-4505-ade6-94dda1d19569",
    "main-event": "Flynn pleaded guilty",
    "main-entities": [
        "Michael Flynn",
        "Donald Trump"
    ],
    "title": "Trump calls Flynn treatment 'unfair,' claims Clinton 'lied many times' with impunity",
    "triplet-uuid": "0c78e748-efbf-417c-a8c1-beeb6480147f",
    "body-paragraphs": [
        [
            "President Trump on Monday called the criminal case against former national security adviser Michael Flynn “very unfair,” claiming he and Hillary Clinton both “lied” to the FBI but only Flynn faced consequences."
        ],
        [
            "The president’s comments, made to reporters as he left Washington for a policy announcement in Utah, saw Trump wading deeper into the Flynn investigation even after a weekend tweet landed the White House in hot water."
        ],
        [
            "On Monday, Trump said he feels “badly” for Flynn, who pleaded guilty on Friday to giving false statements to the FBI about his Russia contacts."
        ],
        [
            "“Hillary Clinton lied many times to the FBI, nothing happened to her. Flynn lied and they destroyed his life,” Trump said. "
        ],
        [
            "The president, without offering specifics, said his 2016 Democratic rival “lied many times” during her FBI interview in early July."
        ],
        [
            "“Nothing happened to her. Flynn lied and it’s like they ruined his life. Very unfair,” Trump said, echoing a weekend tweet in which he asked whether a “double standard” was at play."
        ],
        [
            "Clinton was interviewed by FBI agents as part of the investigation into her exclusive use of a private email system while secretary of state. "
        ],
        [
            "After that interview, then-FBI Director James Comey called her actions extremely careless without recommending criminal charges."
        ],
        [
            "Trump also noted over the weekend that Clinton was not recorded or under oath during that interview."
        ],
        [
            "On Sunday, Sen. Lindsey Graham, R-S.C., suggested Trump might want to think twice before tweeting and commenting on the Russia case. "
        ],
        [
            "“You tweet and comment regarding ongoing criminal investigations at your own peril,” he said on CBS’ “Face the Nation.”"
        ],
        [
            "This was after Trump’s account tweeted Saturday: “I had to fire General Flynn because he lied to the Vice President and the FBI. "
        ],
        [
            "He has pled guilty to those lies. "
        ],
        [
            "It is a shame because his actions during the transition were lawful. "
        ],
        [
            "There was nothing to hide!”"
        ],
        [
            "That tweet immediately caused problems for the White House, as some legal experts said it potentially exposed the president to obstruction of justice allegations – since, according to the tweet, he would have known Flynn lied to agents when he allegedly asked Comey to lay off the Flynn investigation and later fired Comey. "
        ],
        [
            "Trump said earlier this year that he fired Flynn only for lying to Vice President Pence about the issue."
        ],
        [
            "Trump’s personal lawyer John Dowd later said he was the one who wrote that tweet, saying he “did not mean to break news.”"
        ],
        [
            "Dowd attempted to explain Sunday that the tweet was referring to then-acting Attorney General Sally Yates telling White House Counsel Don McGahn in January that Flynn had “given the agents the same story he gave the vice president.”"
        ],
        [
            "He also said the agents seemed to think Flynn was confused. "
        ],
        [
            "“All the president knew was that the department was not accusing him of lying,” Dowd said."
        ],
        [
            "Trump over the weekend denied that he asked Comey to stop investigating Flynn."
        ],
        [
            "Sen. Dianne Feinstein, D-Calif., the top Democrat on the Senate Judiciary Committee, said on NBC’s “Meet the Press” on Sunday that the panel has begun to see \"the putting together of a case of obstruction of justice\" against Trump."
        ],
        [
            "Flynn is now cooperating with Special Counsel Robert Mueller’s investigators in the Russia meddling case, though it’s unclear what exactly he might reveal about Trump and his associates."
        ],
        [
            ""
        ]
    ],
    "source": "fox",
    "url": "https://www.foxnews.com/politics/trump-calls-flynn-treatment-unfair-claims-clinton-lied-many-times-with-impunity",
    "date": "2017-12-04"
}
