{
    "source": "hpo",
    "main-entities": [
        "Neil Gorsuch",
        "Democratic lawmakers",
        "Republican lawmakers"
    ],
    "main-event": "Supreme Court nomination of Judge Neil M. Gorsuch",
    "title": "Democrats Concerned That The Supreme Court May Be Rigged For The Rich And Republicans",
    "url": "https://www.huffingtonpost.com/entry/neil-gorsuch-supreme-court_us_58d681b5e4b03787d35908d1",
    "word-count": 1072,
    "date": "2017-03-25",
    "uuid": "f0a234a6-9142-44dd-abc3-e12336a00c75",
    "triplet-uuid": "47a209b0-fc26-4a0a-a1fe-e4310d1d2419",
    "body-paragraphs": [
        [
            "WASHINGTON ― In recent years, the opposing party approached Supreme Court nomination hearings by honing in on the nominee’s character and temperament or on one particular case that could possibly derail the nominee.",
            "Nominees have, in turn, generally refused to answer any question directly, in an appparent fear of revealing any bias about a potential future case they may hear."
        ],
        [
            "The four days of Senate Judiciary Committee hearings held this past week for President Donald Trump’s nominee to fill the late Justice Antonin Scalia’s seat, Judge Neil Gorsuch, were different.",
            "Democrats on the Senate Judiciary Committee took a different tack.",
            "They made an argument against the Supreme Court itself and its false presentation as a body above politics and power.",
            "That judges do not, as Chief Justice John Roberts once famously said, only call “balls and strikes.”"
        ],
        [
            "At the base of this argument was a simple question that has been dogging Democrats ever since the infamous Bush v. Gore decision on the 2000 presidential election: Is the Supreme Court rigged to benefit corporations, the wealthy and, well, Republicans?"
        ],
        [
            "Pressing this question did not knock Gorsuch off his steady stream of non-answers.",
            "The polished Gorsuch certainly did not make any deluded or deranged statements, as many have come to expect from the president, that could lead a Republican to flip on his nomination.",
            "The Democrats’ argument was instead directed at both their base and their caucus to provide a clear rationale for opposing the nominee ― no matter his qualifications."
        ],
        [
            "Sen. Sheldon Whitehouse (D-R.I.) made this point abundantly clear when he pointed to the series of 5-4 decisions made under Roberts’ leadership that have changed laws to help Republicans get elected, big donors gain more influence in politics through campaign contributions and corporations gain more economic and political power."
        ],
        [
            "“I think these 5-4 decisions are a problem, you said sometimes ― I think I’m quoting you correctly ― sometimes big corporations can capture an agency,” Whitehouse said to Gorsuch.",
            "“That’s a well known principle of administrative law and of economics.",
            "Just let’s be sure that our Supreme Court doesn’t get to be one of those agencies that’s captured on any subject.”"
        ],
        [
            "On this week’s episode of The Huffington Post’s “So That Happened” podcast, 2016 Democratic House candidate Zephyr Teachout, a constitutional law professor at Fordham University School of Law, said the Democrats took the right approach by aiming their fire at the court as an institution that shapes our economy and our politics."
        ],
        [
            "“I thought both Whitehouse and others rightly pointed out that after Roberts’ confirmation we gotta pull away that fake story that you’re just calling balls and strikes,” Teachout said.",
            "“We know, and we know and have seen, that the Supreme Court reshapes power in our country.”"
        ],
        [
            "Gorsuch, who worked on former President George W. Bush’s 2004 reelection campaign and as a lawyer in his Justice Department, provided the expected performance past court nominees had given during his appearance; he stated that he would be shocked by politics coming into a courtroom.",
            "“I’m distressed to hear you think that judges of the Supreme Court is an organ of a party,” Gorsuch told Whitehouse."
        ],
        [
            "It is no surprise that Democrats find little need to take this opinion seriously anymore.",
            "Former President Barack Obama had nominated Judge Merrick Garland to fill Scalia’s seat practically one year to the date before Gorsuch’s confirmation hearing.",
            "Senate Republicans refused to hold public hearings for Garland and declined to meet with him in private.",
            "Gorsuch’s nomination represents the fruit of the Republicans’ decision to block Garland."
        ],
        [
            "Sen. Pat Leahy (D-Vt.) called this “an extraordinary blockade.” “It was totally unprecedented in our country’s whole history,” he added.",
            "“Some likened it to the action of the tyrannical kings who claim that they have sole control, as one of our senators referred to here a few minutes ago.”"
        ],
        [
            "Responding to Gorsuch’s stated belief that justices have no partisan leanings, Sen. Al Franken (D-Minn.) explained, “And you know, you said earlier, there are no Democratic judges, there are no Republican judges.",
            "If that’s the case, what was Merrick Garland about?",
            "That’s what it was about.”"
        ],
        [
            "In addition, Democrats are still irritated at Roberts for promising to call only “balls and strikes” in his 2005 confirmation hearing.",
            "Instead, he went on to anchor the five vote conservative majority’s decisions in controversial cases.",
            "These included Citizens United v. Federal Election Commission, which opened the door to unlimited corporate spending in politics; Shelby County v. Holder, which overturned a key section of the voting rights act; and numerous pro-corporate decisions limiting the rights of citizens to challenge corporations in courts, reducing the ability of states to protect patient and privacy and allowing mutual funds to lie to investors."
        ],
        [
            "Sen. Mazie Hirono (D-Hawaii) blasted Roberts’ decision in Shelby County for creating a whole new constitutional doctrine out of whole cloth, “So, so much for judicial modesty,” she said.",
            "“So much for balls and strikes.",
            "So much for judges judge best when they judge least, which you mentioned tonight as a virtue.”"
        ],
        [
            "The Roberts Court has done much to reshape power in the United States.",
            "The five vote conservative majority that included Scalia has sided with corporations and corporate lobby groups more than any other Supreme Court majority in recent history."
        ],
        [
            "After Gorsuch repeatedly stated that there was ample room for Congress to legislate without worrying about court decisions, Democrats reminded him of how the court’s decisions play a key role in shaping who is elected to Congress and, therefore, what bills can be passed in the first place."
        ],
        [
            "“[B]y tilting the political playing field so heavily toward corporations and against individuals, hasn’t the court impacted the composition of who is in Congress and made it therefore even harder for Congress to taking meaningful,” Hirono said.",
            "“Meaningful action to say past laws to protect worker safety or the access of students with special needs to an education?”"
        ],
        [
            "Whitehouse asked about the court’s controversial Citizens United decision, “What could be more involved in politics than to open this ocean of dark money that’s flooded into our politics?”"
        ],
        [
            "Democrats on the committee appeared frustrated that Gorsuch refused to acknowledge the court’s role in transforming both the political and economic worlds the country’s citizens operate in.",
            "Senate Democratic Leader Chuck Schumer (D-N.Y.) told Politico that Gorsuch “did not win anybody over with his testimony.”",
            "Schumer added that he believed he had the 41 votes necessary to filibuster the nomination."
        ]
    ]
}
