{
    "source": "hpo",
    "main-entities": ["Donald Trump"],
    "main-event": "Trump reverses decision to allow import of elephant trophies",
    "title": "Trump Calls Elephant Trophy Hunting A 'Horror Show,' Says He's Unlikely To Allows Imports",
    "url": "https://www.huffingtonpost.com/entry/trump-elephant-trophy-on-hold_us_5a0f83bbe4b045cf437178c6",
    "word-count": 809,
    "date": "2017-11-17",
    "uuid": "11f3a9af-cabd-4f6c-907e-5e99fcc27f00",
    "triplet-uuid": "542cd22c-ea80-4669-995b-6ac6a33823f7",
    "body-paragraphs": [
        [
            "WASHINGTON — Two days after suddenly halting his own administration’s decision to begin allowing hunters to import elephants killed in two African countries, President Donald Trump called such trophy hunting a “horror show” and said he’s unlikely to change his mind and allow such imports."
        ],
        [
            "“Big-game trophy decision will be announced next week but will be very hard pressed to change my mind that this horror show in any way helps conservation of Elephants or any other animal,” he posted to Twitter Sunday evening."
        ],
        [
            "In the face of widespread public backlash, Tump announced late Friday that he has suspended — at least for now — his administration’s decision to reverse an Obama-era ban on the importation of elephant trophies from Zimbabwe and Zambia."
        ],
        [
            "“Put big game trophy decision on hold until such time as I review all conservation facts,” he posted to Twitter.",
            "He adding that the issue has been “under study for years” but that he would provide an update after additional review."
        ],
        [
            "Interior Secretary Ryan Zinke said in a statement on Twitter that he and Trump “believe that conservation & healthy herds are critical.”"
        ],
        [
            "As HuffPost reported Wednesday, the administration optedto lift the 2014 ban after determining that sport hunting of elephants in those African countries would “enhance the survival of the species in the wild,” a spokesperson for the U.S. Fish and Wildlife Service said.",
            "It also recently rolled back protections for African lions, releasing new guidelines that allow big game hunters to bring back to the U.S. animal trophies from hunts in parts of Africa."
        ],
        [
            "The decision regarding elephants was made public not by the federal agency but via a celebratory news release early Tuesday from Safari Club International, a trophy hunting advocacy group that, along with the National Rifle Association, sued to block the 2014 ban.",
            "Greg Sheehan, principal deputy director of the FWS, broke the news to the hunting organization during the African Wildlife Consultative Forum in Tanzania, an agency spokesperson told HuffPost.",
            "The forum, which ended Friday, was hosted by the Safari Club International Foundation and the United Republic of Tanzania."
        ],
        [
            "The Safari Club’s political action committees donated a collective $24,500 to Trump’s presidential campaign and Zinke’s 2014 and 2016 congressional campaigns, according to Federal Election Commission data.",
            "Zinke is a former Montana congressman and Navy SEAL."
        ],
        [
            "Conservation groups celebrated Trump’s sudden change in course Friday, which was believed to be a response to public pressure."
        ],
        [
            "“It’s great that public outrage has forced Trump to reconsider this despicable decision, but it takes more than a tweet to stop trophy hunters from slaughtering elephants and lions,” Tanya Sanerib, senior attorney with the Center for Biological Diversity, said in a statement.",
            "“We need immediate federal action to reverse these policies and protect these amazing animals.”"
        ],
        [
            "In a post to Twitter, Wayne Pacelle, the CEO of The Humane Society of the United States, said he was “grateful” that Trump would reconsider.",
            "“This is the kind of trade we don’t need.”"
        ],
        [
            "The elephant trophy decision drew national headlines and a fierce response from celebrities and others across social media.",
            "Talk-show host Ellen DeGeneres launched a campaign called #BeKindToElephants.",
            "By lifting the ban, she said, Trump was “encouraging Americans to kill elephants.”"
        ],
        [
            "A day after Trump’s suspension, the Safari Club sent out a “call to arms,” encouraging hunters to contact Trump and Zinke and “tell them how much you appreciate the efforts of the Fish & Wildlife Service to remove barriers to sustainable use conservation for African wildlife.”",
            "And they blasted “hysterical anti-hunters and news media outlets.”"
        ],
        [
            "“The news from Africa could not have been better for hunters or for anyone who loves or defends hunting culture,” the group wrote."
        ],
        [
            "African elephants have been listed as threatened under the Endangered Species Act since 1978.",
            "A provision of the law, however, allows for sport-hunted trophies to be imported if the government determines that hunting will help safeguard the population."
        ],
        [
            "The FWS concluded that Zimbabwe has made strides to improve elephant management and anti-poaching efforts, according to a notice published Friday in the Federal Register."
        ],
        [
            "Rep. Ed Royce (R-Calif.), chairman of the House Foreign Affairs Committee, was among the many people who called on Trump to abandon his trophy hunting decision.",
            "In a Friday statement, Royce pointed to the unrest in Zimbabwe — where a military coup is thought to be unfolding — and said he has no confidence that the regime is properly managing conservation programs."
        ],
        [
            "“Elephants and other big game in Africa are blood currency for terrorist organizations, and they are being killed at an alarming rate,” Royce said.",
            "“Stopping poaching isn’t just about saving the world’s most majestic animals for the future ― it’s about our national security.”"
        ],
        [
            "Hours before Trump’s review announcement, the FWS defended its decision as “part of a robust United States conservation strategy that seeks to eliminate poaching and associated wildlife trafficking.”"
        ]
    ]
}
