{
    "source": "nyt",
    "main-entities": [
        "Democratic Lawmakers",
        "Republican Lawmakers"
    ],
    "main-event": "Rare comity at Capitol after shooting doesn't last",
    "title": "Shooting Brings Rare Comity to the Capital, but Will It Last?",
    "url": "https://mobile.nytimes.com/2017/06/15/us/politics/shooting-brings-rare-comity-to-the-capitol-but-will-it-last.html?em_pos=large&emc=edit_cn_20170616&nl=first-draft&nlid=57457455&ref=img&te=1&_r=0&referer=",
    "word-count": 1183,
    "date": "2017-06-15",
    "uuid": "f2c16873-7db9-4345-b0af-715564e73a7b",
    "triplet-uuid": "58f414e5-a122-49f5-819e-512d91069da5",
    "body-paragraphs": [
        [
            "WASHINGTON — The lawmakers trotted from their dugouts at Nationals Park, together in a near-summer air that never quite felt swampy, united in a certainty that the game must go on, just not exactly as it had before."
        ],
        [
            "A day earlier, on another ball field some seven miles southwest, a gunman had opened fire on members of the Republican congressional baseball team, striking four people — including Steve Scalise, the majority whip of the House of Representatives — who were there for a practice."
        ],
        [
            "And on Thursday, the capital’s various institutional forces — senators and lobbyists, staff members with a job to do and residents with an evening to spare — joined, for a moment, in a bipartisan rebuttal: Play ball."
        ],
        [
            "Beneath a mostly cloudless sky, at least by the mid-innings, fans in the stands intermingled red and blue."
        ],
        [
            "Near the dugout, the president’s daughter Ivanka Trump bantered with Chuck Schumer, the Senate’s top Democrat, who chatted with two of her young children.",
            "Nancy Pelosi, the House minority leader, wore a shirt from Louisiana State University, Mr. Scalise’s alma mater."
        ],
        [
            "When a video message from President Trump played on the big screen, some of the Democrats in the crowd booed, but less lustily than usual."
        ],
        [
            "“You are showing the world that we will not be intimidated,” Mr. Trump said.",
            "“The game will go on.”"
        ],
        [
            "Some members of Congress had not expected to stay behind for the annual showdown, with families and district business waiting for them."
        ],
        [
            "But by nightfall, the decision was clear."
        ],
        [
            "“We come here, and these members become our family,” Representative John Lewis, Democrat of Georgia, said at the Capitol before a game he had not intended to see."
        ],
        [
            "He spoke of 1968 and of the political violence he had seen up close as a civil rights leader, invoking Martin Luther King Jr. and Robert F. Kennedy."
        ],
        [
            "Mr. Lewis, now 77, stared straight ahead for a moment.",
            "“I have to stay,” he said softly."
        ],
        [
            "All day, before as more than 24,000 ticket holders filed in for the charity game, the shorthand for other tragedies ricocheted through the Capitol."
        ],
        [
            "At work on Thursday, those pangs visited lawmakers like a too-familiar houseguest — stalking them down the Capitol’s corridors, past the Senate chamber where a ferocious health care debate had already resumed, along the hall where some had stood one day earlier as survivors, still in dusted cleats and uniforms, unharmed but unsettled."
        ],
        [
            "The reaction would be different this time, some said.",
            "More sustainable.",
            "It had to be. Probably. Maybe. Right?"
        ],
        [
            "“What’s the half-life?” asked Senator Roger Wicker, Republican of Mississippi, appraising how long the comity might last.",
            "“I don’t know. I don’t know.”"
        ],
        [
            "The skepticism is near-universal.",
            "Even one day out from the initial anguish, much of the political ecosystem seemed unchanged."
        ],
        [
            "In a Thursday morning tweet, Mr. Trump railed against the “WITCH HUNT” of investigations of his associates.",
            "Elected officials accused one another of hypocrisy and selective memory on matters of policy, perhaps a bit more gently than they might have on a typical weekday."
        ],
        [
            "Senator Rand Paul, Republican of Kentucky, said he was warming up with Sean Hannity, the Fox News host, who is not known for bipartisan spirit."
        ],
        [
            "And Ms. Pelosi could not resist suggesting that Republicans were the initiators of the present rancor."
        ],
        [
            "“Somewhere in the ’90s, Republicans decided on a politics of personal destruction as they went after the Clintons,” she told reporters earlier on Thursday."
        ],
        [
            "Moments later, she added, a bit regretfully: “I really am almost sad for myself that I have gone down this path with you, because I don’t think it’s appropriate for us to have the fullest discussion of it.",
            "It’ll be for another day.”"
        ],
        [
            "But for an optimist in the city — and there still seem to be a few — there were flourishes to appreciate."
        ],
        [
            "House interns hauled signs: “Scalise Strong,” “Capitol Police MVP” and “Unvidvided” in red, white, and blue."
        ],
        [
            "Another attendee delivered this message, held aloft: “This Democrat is here to support Congressman Scalise.",
            "Get well soon, sir.”"
        ],
        [
            "Representative Steny H. Hoyer of Maryland, the Democratic whip, resolved to wear a “Team Scalise” shirt to the game.",
            "Ms. Pelosi sat for an interview alongside Speaker Paul D. Ryan, Republican of Wisconsin.",
            "The Senate leaders — Mitch McConnell, Republican of Kentucky, and Mr. Schumer of New York — did the same."
        ],
        [
            "“We don’t dislike each other,” Mr. McConnell said, deploying a rare complimentary double negative."
        ],
        [
            "Among those on the field before the game was Representative Roger Williams, Republican of Texas, whose aide Zachary Barth was shot at the practice.",
            "Mr. Williams, a coach on the team, trudged out on crutches after injuring his foot in the Wednesday morning fray as well."
        ],
        [
            "David Bailey, a Capitol Police officer who was wounded while helping to stop the attack, threw out the ceremonial first pitch.",
            "(The ball was delivered to the mound, in an apparent bit of sponsorship oddity, by a Budweiser Clydesdale.)"
        ],
        [
            "Mr. Scalise remained in the hospital on Thursday after a second surgery for internal injuries and a broken leg.",
            "Doctors said his condition was critical but improving.",
            "He received a standing ovation when he was introduced as a team member, with Democrats waving their caps at his image on the screen beyond the outfield fence."
        ],
        [
            "“Maybe with a little more time, the teams would be mixed,” suggested Representative Ted Deutch, Democrat of Florida.",
            "“But at least for now, the healthy competition will bring us together.”"
        ],
        [
            "Several elements of the evening did diverge sharply from the ballpark’s standard, professional fare — commonplace for a congressional game that has, since 1909, produced a steady torrent of middling baseball, worse trash talk and more than occasional injury."
        ],
        [
            "By the concessions, attendees discussed field director salaries and legislative wrangling.",
            "Khakis filled the grounds.",
            "A cutout of the head of Representative Tim Ryan, Democrat of Ohio, was held high."
        ],
        [
            "Chants of “We love you, Pelosi!” rang out briefly, until the minority leader acknowledged them."
        ],
        [
            "Supporters from both parties raised hot dogs and beers, catching up on acquaintances in common."
        ],
        [
            "“We’re just one day removed, so it still feels different, I think,” Senator Jeff Flake, Republican of Arizona, said before the game, recalling past tragedies that many swore would reshape the nation’s politics.",
            "“I hope it lasts.”"
        ],
        [
            "At the practice on Wednesday, Mr. Flake had raced to Mr. Scalise’s side to provide water and first aid after the shooting stopped."
        ],
        [
            "He set out a goal for himself and his colleagues, uttered before inside the Capitol.",
            "“Tone down our own rhetoric and not ascribe the worst motives to our colleagues,” he said hopefully.",
            "“That can be done.”"
        ],
        [
            "For an evening, at least, Washington delivered."
        ],
        [
            "A little before 10 p.m., the Democrats secured their final out for an 11-2 victory, taking a 40-to-39 edge in the lifetime series.",
            "As the players shook hands, the team managers — Representative Mike Doyle, Democrat of Pennsylvania, and Representative Joe L. Barton, Republican of Texas — gathered for closing ceremonies."
        ],
        [
            "Mr. Doyle did not hold the trophy for long."
        ],
        [
            "It was going to Mr. Scalise’s office, they decided, until he gets back."
        ]
    ]
}
