{
    "source": "hpo",
    "main-entities": [
        "Steve Scalise",
        "Democratic Lawmakers",
        "Republican Lawmakers"
    ],
    "main-event": "",
    "title": "GOP Whip Steve Scalise, Others Shot At Early Morning Baseball Practice",
    "url": "https://www.huffingtonpost.com/entry/police-shots-ymca-alexandria-virginia_us_5941217fe4b003d5948c43d0",
    "word-count": 1074,
    "date": "2017-06-14",
    "uuid": "1f817770-ae60-467d-8a53-0d3ee8caa05c",
    "triplet-uuid": "58f414e5-a122-49f5-819e-512d91069da5",
    "body-paragraphs": [
        [
            "WASHINGTON ―House Majority Whip Steve Scalise (R-La.) was still in critical condition on Thursday after a lone gunman opened fire Wednesday morning on a group of Republican lawmakers practicing for a congressional baseball game."
        ],
        [
            "Six people, including two congressmen, two police officers, a congressional aide and a lobbyist, were injured in the attack in an Alexandria, Virginia, park.",
            "The assailant, who authorities have identified as 66-year-old James T. Hodgkinson of Belleville, Illinois, was shot by police and later died of his injuries at a hospital."
        ],
        [
            "Scalise underwent surgery at the MedStar Washington Hospital Center after being shot in the hip.",
            "In a statement Wednesday night, the hospital said Scalise sustained “a single rifle shot to the left hip” that “travelled across his pelvis, fracturing bones, injuring internal organs and causing severe bleeding.”"
        ],
        [
            "“He underwent immediate surgery and an additional procedure to stop bleeding,” the hospital said, noting the congressman had received multiple blood transfusions and remained in critical condition late Wednesday.",
            "It said Scalise would need further operations."
        ],
        [
            "Before the surgery, Scalise was “in good spirits and spoke to his wife by phone,” his office said.",
            "President Donald Trump and first lady Melania Trump on Wednesday night visited Scalise in the hospital, bringing flowers and offering support to the lawmaker’s family."
        ],
        [
            "The Trumps also met with Crystal Griner, one of the two U.S. Capitol Police officers injured in the attack, and her wife.",
            "Griner and David Bailey, the other officer hurt, are in stable condition, according to Chief Matthew R. Verderosa."
        ],
        [
            "Vice President Mike Pence and second lady Karen Pence also checked in on Scalise and Griner on Thursday."
        ],
        [
            "Zachary Barth, a staffer for Rep. Roger Williams (R-Texas), was shot in the leg.",
            "He was transported to a local hospital and has since been released.",
            "Williams sustained a minor leg injury."
        ],
        [
            "Matt Mika, director of government relations for Tyson Foods’ Washington, D.C., office, was also among those shot.",
            "His condition was upgraded from “critical” to “serious” on Thursday, a spokeswoman for George Washington University Hospital confirmed to HuffPost."
        ],
        [
            "The attack took place shortly after 7 a.m. at Eugene Simpson Stadium Park, less than 8 miles south of the White House.",
            "U.S. Capitol Police officers assigned to Scalise engaged Hodgkinson in gunfire, and Alexandria Police responded soon after.",
            "“At that point, we were able to calm the situation, and victims were transported to the hospital,” Verderosa said."
        ],
        [
            "The FBI is investigating Hodgkinson and his possible motives.",
            "It’s too early to determine whether the attack was politically motivated, authorities said."
        ],
        [
            "The shooter’s weapons ― a 9 mm handgun and 7.62-caliber rifle ― were recovered at the scene by law enforcement officials.",
            "The Bureau of Alcohol, Tobacco, Firearms and Explosives ran traces on the weapons and found no evidence to suggest Hodgkinson purchased the firearms illegally, according to an FBI statement released Thursday."
        ],
        [
            "The FBI said it was processing a cell phone, a computer and a camera recovered from Hodgkinson’s van, which was in the parking lot of a YMCA adjacent to the park."
        ],
        [
            "Sen. Bernie Sanders (I-Vt.) confirmed on Wednesday that Hodgkinson had volunteered for his presidential campaign.",
            "“Let me be as clear as I can be,” Sanders said in a statement.",
            "“Violence of any kind is unacceptable in our society and I condemn this action in the strongest possible terms.”"
        ],
        [
            "Sen. Rand Paul (R-Ky.), who was also at the practice, told MSNBC that Scalise crawled through the dirt, bleeding, to get away from the shooter.",
            "Rep. Mo Brooks (R-Ala.) told reporters that he used his belt as a tourniquet to stop a staffer’s bleeding."
        ],
        [
            "Paul said that a number of aides were lying down during the attack as the shooter fired bullets their way."
        ],
        [
            "Paul told CNN that “nobody would’ve survived” had Capitol Police not been there."
        ],
        [
            "“It would’ve been a massacre without them,” he said."
        ],
        [
            "Noah Nathan, 47, lives in a nearby apartment building and was at the dog park when the shooting took place.",
            "He said he heard at least 30 shots and got down on the ground, but couldn’t see the shooter.",
            "“There’s no place I could go,” he said."
        ],
        [
            "The members were practicing for the Congressional Baseball Game, a D.C. tradition dating back to 1909.",
            "The event pits Republicans against Democrats and raises funds for area nonprofits, including the Washington Literacy Center, the Boys and Girls Club of Greater Washington and the Washington Nationals Dream Foundation.",
            "This year’s game is scheduled for Thursday night."
        ],
        [
            "Police shut down the streets for blocks around the field early Wednesday, and a helicopter was flying overhead."
        ],
        [
            "A lockdown has been lifted at the YMCA Alexandria, next to the field where the shooting took place, spokeswoman Dana Rucker told HuffPost.",
            "No members or staff were harmed in the shooting, but the building sustained bullet damage."
        ],
        [
            "“They are shaken,” Rucker said of YMCA staff.",
            "“They’re just grateful everyone was able to work together as a team and get out.”"
        ],
        [
            "Hodgkinson was member of the YMCA, Rucker said in a statement.",
            "She said that while he appears to have visited the facility “frequently and at all hours of the day,” staff received “no complaints” about his behavior."
        ],
        [
            "Lawmakers from both parties expressed sympathy for the victims.",
            "Trump said that he was “deeply saddened” by the news."
        ],
        [
            "“Our thoughts and prayers are with the members of Congress, their staffs, Capitol Police, first responders, and all others affected,” he said in a statement."
        ],
        [
            "During a bipartisan briefing on Capitol Hill later Wednesday, lawmakers discussed the possibility of allowing members of Congress to use campaign funds to bolster security at their private residences."
        ],
        [
            "“There’s going to be a review of exactly what funds can and should be used in the event there are security concerns by any member,” said House Minority Whip Steny Hoyer (D-Md.).",
            "He added that Ryan was investigating the matter alongside the Federal Election Commission."
        ],
        [
            "“We’re looking at that,” Hoyer said."
        ],
        [
            "Many previously scheduled events around Capitol Hill were canceled Wednesday, including an event Trump was scheduled to attend at the Department of Labor.",
            "The FBI is taking over the investigation into the shooting, Alexandria Police Chief Michael Brown said."
        ],
        [
            "Jay Roberts, 60, lives nearby and said the game was “probably one of the few moments with all this rancor and politics that they can have some normalcy.”"
        ],
        [
            "“I imagined it would be something fun to watch, you know, because evidently it’s partisan politics are put aside, let’s have a softball game, let’s have some fun,” he said."
        ]
    ]
}
