{
    "source": "fox",
    "main-entities": [
        "Steve Scalise",
        "Democratic Lawmakers",
        "Republican Lawmakers"
    ],
    "main-event": "",
    "title": "Shooting spurs calls for new lawmaker security measures",
    "url": "http://www.foxnews.com/politics/2017/06/15/shooting-spurs-calls-for-new-lawmaker-security-measures.html",
    "word-count": 913,
    "date": "2017-06-15",
    "uuid": "34ed48f7-3ad7-47ee-953d-906aad9b37fd",
    "triplet-uuid": "58f414e5-a122-49f5-819e-512d91069da5",
    "body-paragraphs": [
        [
            "Lawmakers at the scene of Wednesday’s baseball practice shooting described themselves as “sitting ducks” and said the violence would have been a “massacre” if not for Majority Whip Steve Scalise's detail -- spurring new questions over whether congressional security practices should be overhauled."
        ],
        [
            "Thursday night, the MedStar Washington Hospital Center issued a statement saying Scalise \"underwent a second surgery related to his internal injuries and a broken bone in his leg.",
            "He remains in critical condition, but has improved in the last 24 hours.",
            "The Congressman will require additional operations, and will be in the hospital for some time.\""
        ],
        [
            "Scalise, R-La., like other members of leadership, is assigned a full-time security detail from U.S. Capitol Police, who guard him in Washington and at home in his district.",
            "His detail was credited with putting down the attacker and saving lives."
        ],
        [
            "“If Scalise was not there, he’s the one with security detail, we wouldn’t have had any protection and God knows how bad that might have been,” Rep. Brad Wenstrup, R-Ohio, told \"Fox & Friends.\""
        ],
        [
            "Rep. Dave Brat, R-Va., acknowledged the incident has sparked new security questions for members without assigned police protection at events outside Capitol Hill."
        ],
        [
            "He, along with several other members of Congress, suggested the most critical change may be to boost security for large lawmaker gatherings, even informal ones like the baseball practice in Alexandria, Va."
        ],
        [
            "“We already had concerns and we have great law enforcement at home, first responders do a great job, but this makes you anticipate every event now in a new way,” Brat said on Fox News’ “America’s News HQ” on Wednesday.",
            "“Forty guys get together at the same time, that would be a major security event normally, but I think we got a little excited and didn’t think things through as well as we could have.”"
        ],
        [
            "Brat said lawmakers “may need to recalibrate public events,” while also suggesting “tighter security” at town halls -- which most congressional lawmakers have scheduled through the summer recess.",
            "This year's town halls to date have been particularly rowdy and tense, prompting lawmaker concerns long before Wednesday's attack."
        ],
        [
            "The Wednesday attack injured Scalise; Matt Mika, a lobbyist for Tyson Foods; Zack Barth, a staffer from Texas Rep. Roger Williams’ office; and two U.S. Capitol Police officers, Special Agents Crystal Griner and David Bailey."
        ],
        [
            "“Without Capitol Hill police, it would have been a massacre—we had no defense—we had no defense at all,” Sen. Rand Paul, R-Ky., said on \"Fox & Friends.\"",
            "“We were like sitting ducks.”"
        ],
        [
            "Lawmakers have appealed for more security before, including after the 2011 shooting of then-Rep. Gabrielle Giffords.",
            "A detail for every lawmaker is likely not possible -- and security already is provided for major events and lawmakers facing a specific threat."
        ],
        [
            "But there are broad questions at hand in boosting security beyond that: particularly, does it hurt democracy to put an added barrier between lawmakers and constituents?"
        ],
        [
            "“I bet most members of Congress would say they don’t want [a] security detail—I sure don’t,” Rep. Mike Doyle, D-Pa., manager of the Democratic congressional baseball team, told reporters."
        ],
        [
            "Former Speaker of the House Newt Gingrich lauded the current system where lawmakers interact with the people on a regular basis in settings like grocery stores.",
            "He said the threat of the \"occasional deranged person\" should not change that."
        ],
        [
            "“We start surrounding these folks with layers of guards—it will really cripple the ability to be a free society,” he said on “Outnumbered.”"
        ],
        [
            "Gingrich added: “We are a free country, and we’re gonna run the risk of freedom.”"
        ],
        [
            "Rep. Williams backed Gingrich's comments in a press conference on Capitol Hill Wednesday.",
            "Rogers was injured during the attack when he dove into the dugout “like a pool without water.”"
        ],
        [
            "But Williams suggested he would feel “safer” if he were allowed to carry a gun on Capitol Hill, reminding reporters that he’s “a big Second Amendment guy” -- and said “we probably ought to take a look at our security in big groups like that.”"
        ],
        [
            "Doyle, too, suggested that could be the solution: “I think when you’re in an area with 30 or 40 members, where anyone can walk through, we need to re-think that—but I think most members would tell you they feel fine and they’re not looking for any security.”"
        ],
        [
            "Rep. Thomas Massie, R-K.Y., took calls for additional security a step further on Thursday by re-introducing legislation that would allow those who have concealed carry permits in their home states to carry in Washington D.C."
        ],
        [
            "U.S. Capitol Police have not announced any increased security measures for congressional lawmakers, but said they will “continue to provide a robust and visible presence” around the Capitol."
        ],
        [
            "James Norton, who was deputy assistant secretary at Department of Homeland Security under the George W. Bush administration, told Fox News that staffing each member of Congress with a personal security detail would cost billions and acknowledged the unwillingness of some members to have additional layers of security.",
            "But he said they need to consider “the dangers” that come with public forums."
        ],
        [
            "“You have to consider that there is a lot of information for the public—obviously members want to give as much information as they can—a lot of calendars are broadcast, social media, information is readily available,” Norton said.",
            "“But there are a lot of bad actors out there looking to do harm, and vigilance needs to be taken by each member and their staff.”"
        ],
        [
            "Brooke Singman is a Reporter for Fox News.",
            "Follow her on Twitter at @brookefoxnews."
        ]
    ]
}
