{
    "uuid": "1bd4b16c-e71f-4421-b4e4-67679001fb2f",
    "main-event": "Donald Trump is inaugurated",
    "main-entities": [
        "Donald Trump"
    ],
    "title": "President Trump takes office vowing to restore prosperity, ‘fight’ for country",
    "triplet-uuid": "84b3c118-50d2-45a5-a91f-7ed95b5d0143",
    "body-paragraphs": [
        [
            "Donald Trump assumed the nation’s highest office Friday as the 45th president of the United States, vowing in a tough inaugural address to restore prosperity and “fight” for the country “with every breath.”"
        ],
        [
            "In a succinct speech heavy on populist themes, the new president told Americans across the country they will “never be ignored again” and promised concrete results."
        ],
        [
            "“The time for empty talk is over. Now arrives the hour of action,” he said."
        ],
        [
            "The president addressed a packed crowd of spectators stretching from the Capitol across the National Mall on a mild but overcast and at-times drizzly day, after taking the oath of office along with Vice President Mike Pence. ",
            "The speech did not delve into policy details, and rather reprised objectives from his 2016 campaign on trade, immigration and national security."
        ],
        [
            "But the address was stitched together, more broadly, by an appeal for a “new national pride” and a rediscovery of American patriotism, as he described this as a salve for the country’s divisions."
        ],
        [
            "“When you open your heart to patriotism, there is no room for prejudice,” he said."
        ],
        [
            "He also rebuked those who have held power in Washington, saying a small group reaped the rewards of government while “the people did not share” in Washington’s wealth."
        ],
        [
            "The address completes Trump’s remarkable journey from political outsider written off by countless Beltway pundits to the most powerful man in the country.",
            "His campaign manager Kellyanne Conway noted in an earlier interview with Fox News that Trump was “making history” as a businessman with no prior political or military experience – someone successful in the private sector coming to Washington “owing nobody anything.”"
        ],
        [
            "In blunt and unvarnished terms similar to the language used during his nomination acceptance address last summer, Trump on Friday lamented the jobs lost to foreign rivals – he described “rusted out factories scattered like tombstones” across the land – and the crime in America’s cities."
        ],
        [
            "“This American carnage stops right here and stops right now,” Trump said."
        ],
        [
            "Trump cast his presidency as a return to power for the people and vowed never to let them down."
        ],
        [
            "“From this day forward, it’s going to be only America first,” Trump said. ",
            "“I will fight for you with every breath in my body, and I will never, ever let you down. … ",
            "We will bring back our jobs, we will bring back our borders, we will bring back our wealth and we will bring back our dreams.”"
        ],
        [
            "He also vowed to eradicate Islamic terrorism."
        ],
        [
            "Telling the American people this is “your moment” and “your day,” Trump closed his speech with the promise that started it all: “We will make America great again.”"
        ],
        [
            "As Barack and Michelle Obama depart the White House after eight years in office, Trump will immediately be confronted with the challenge of governing, as he attempts to apply his CEO experience to running the nation. ",
            "His team has vowed a “robust” start to the Trump administration, which could include everything from rescinding controversial Obama actions to renegotiating trade deals to repealing and replacing the Affordable Care Act."
        ],
        [
            "An immediate task for the new administration will be to get Trump’s Cabinet nominees confirmed. ",
            "His advisers have complained that Democrats are slowing the process, and resisting the kind of swift confirmation the Senate gave many of Obama’s nominees in 2009."
        ],
        [
            "Before he spoke on Friday, throngs of protesters were causing disruptions on the edges of the security zone in Washington. ",
            "Some blocked checkpoints and forced their temporary closure earlier Friday morning, while elsewhere demonstrators resorted to violence and vandalism. ",
            "They clashed with police later in the afternoon, amid dozens of arrests."
        ],
        [
            "While dozens of House Democrats boycotted Friday’s ceremonies – a move that fueled disputes with Trump’s team over the weekend – other prominent Democrats and past presidents of both parties were in attendance for the transfer of power. ",
            "Democratic presidential nominee Hillary Clinton, whose loss to Trump marked one of the biggest upsets in modern political history, attended and tweeted shortly before Trump took the oath that she came to “honor our democracy & its enduring values.”"
        ],
        [
            "“I will never stop believing in our country & its future,” she wrote."
        ],
        [
            "Donald and Melania Trump met with the Obamas earlier Friday morning after attending a church service in Washington. ",
            "The new first family headed later to the parade along Pennsylvania Avenue, before an evening of inaugural balls and other festivities."
        ]
    ],
    "source": "fox",
    "url": "https://www.foxnews.com/politics/president-trump-takes-office-vowing-to-restore-prosperity-fight-for-country",
    "date": "2017-01-20"
}
