{
    "uuid": "b79beb25-e671-42ee-9170-9bbf3037d520",
    "main-event": "Donald Trump is inaugurated",
    "main-entities": [
        "Donald Trump"
    ],
    "title": "Donald Trump Is Sworn In as President, Capping His Swift Ascent",
    "triplet-uuid": "84b3c118-50d2-45a5-a91f-7ed95b5d0143",
    "body-paragraphs": [
        [
            "WASHINGTON — Donald John Trump was inaugurated as the 45th president of the United States on Friday, ushering in a new era that he vowed would shatter the established order and reverse a national decline that he called “this American carnage.”"
        ],
        [
            "In a ceremony that capped a remarkable rise to power, Mr. Trump presented himself as the leader of a populist uprising to restore lost greatness.",
            "He outlined a dark vision of an America afflicted by “the ravages” of economic dislocation and foreign exploitation, requiring his can-do approach to turn around."
        ],
        [
            "“I will fight for you with every breath in my body, and I will never, ever let you down,” Mr. Trump told hundreds of thousands of rain-soaked admirers and onlookers in a forceful 16-minute Inaugural Address from the West Front of the Capitol.",
            "“America will start winning again, winning like never before.",
            "We will bring back our jobs. We will bring back our borders. We will bring back our wealth. And we will bring back our dreams.”"
        ],
        [
            "Mr. Trump’s ascension amounted to a hostile takeover of a capital facing its most significant disruption in generations.",
            "While officially a Republican, he has taken on leaders of both parties and, with no prior political career of his own, made clear that he saw himself as the ultimate outsider not beholden to the current system."
        ],
        [
            "“We will no longer accept politicians who are all talk and no action, constantly complaining but never doing anything about it,” he said.",
            "“The time for empty talk is over. Now arrives the hour of action.",
            "Do not allow anyone to tell you that it cannot be done.”"
        ],
        [
            "Mr. Trump’s view of the United States was strikingly grim for an Inaugural Address — a country where mothers and children are “trapped in poverty in our inner cities,” where “rusted-out factories” are “scattered like tombstones across the landscape” and where drugs and crime “have stolen too many lives.”"
        ],
        [
            "“This American carnage,” he declared, “stops right here and stops right now.”"
        ],
        [
            "He got started right away with rolling back the policies of his predecessor, former President Barack Obama, by issuing orders freezing new regulations from recent weeks and ordering agencies to “ease the burden” of the Affordable Care Act during the transition from repealing to replacing the law.",
            "More orders are planned for next week."
        ],
        [
            "Wearing a dark suit and red tie and accompanied by his wife, Melania, in a powder-blue suit and matching gloves, Mr. Trump took the 35-word oath administered by Chief Justice John G. Roberts Jr. precisely at noon.",
            "Michael Richard Pence, a former governor and congressman from Indiana, was sworn in minutes before as vice president by Justice Clarence Thomas."
        ],
        [
            "Mr. Trump assumed the presidency of a country still unsettled after a polarizing election and entered office with less support in polls than any other president in recent history.",
            "It was clear from the day that there would be no grace period either for or by the new president.",
            "The Senate confirmed two cabinet nominations — James N. Mattis as defense secretary and John F. Kelly as secretary of homeland security — but Democrats temporarily held up Mike Pompeo’s confirmation as C.I.A. director."
        ],
        [
            "Throughout the day, there were mostly peaceful protests against the new president.",
            "Sporadic violence broke out as demonstrators smashed shop windows and burned a limousine, while police officers in riot helmets responded with tear gas.",
            "More than 200 people were arrested.",
            "Liberal groups prepared for a women’s march on Saturday that they said could draw hundreds of thousands."
        ],
        [
            "Mr. Trump made only passing efforts to reach out to Democrats beyond thanking Mr. Obama and his wife, Michelle, for their handling of the transition.",
            "“They have been magnificent,” he said in his speech."
        ],
        [
            "He later praised his defeated opponent, Hillary Clinton, at a lobster-and-beef luncheon with congressional leaders, asking her and former President Bill Clinton to stand for applause.",
            "“I have a lot of respect for these two people,” he said."
        ],
        [
            "Democrats were not impressed.",
            "“I was pretty shocked by how dark it was,” Senator Sherrod Brown, Democrat of Ohio, said of Mr. Trump’s Inaugural Address.",
            "“I love this country, and I don’t understand how a president of the United States that loves his country could paint a picture of its failures.”"
        ],
        [
            "He added, “It was interesting sitting up onstage with a bunch of billionaires hearing him say how bad the country was.”"
        ],
        [
            "The National Mall was filled with supporters, many wearing “Make America Great Again” hats and chanting “Trump! Trump! Trump!”",
            "But the lingering animosity from the presidential campaign was on display, too.",
            "When Mrs. Clinton arrived, some in the crowd chanted, “Lock her up,” mimicking Mr. Trump’s campaign rallies.",
            "As he took the oath, a cluster of people blew whistles and screamed, “Not my president,” before being escorted out."
        ],
        [
            "While large, the crowds on a soggy day did not rival the energetic throngs at Mr. Obama’s first inauguration eight years ago, according to aerial photographs.",
            "The Washington Metrorail system recorded fewer than half as many rides on Friday morning as in 2009, and knots of bystanders along the inaugural parade route were not as thick.",
            "In a city that gave just 4 percent of its vote to Mr. Trump, many residents left town and about 60 House Democrats boycotted the event."
        ],
        [
            "Mr. Obama made his exit after the ceremony, flying by helicopter to Joint Base Andrews in the Maryland suburbs, where he thanked former aides and members of his administration before boarding the presidential jet, no longer designated Air Force One, to fly to Palm Springs, Calif., for vacation.",
            "He will return to Washington to a rental house while his daughter Sasha finishes high school, the first president to stay in the capital since Woodrow Wilson."
        ],
        [
            "Hours before his departure, Mr. Obama posted on Twitter to thank followers and hint that he would not fade away.",
            "“I won’t stop,” he said.",
            "“I’ll be right there with you as a citizen, inspired by your voices of truth and justice, good humor, and love.”"
        ],
        [
            "Former Vice President Joseph R. Biden Jr. and his wife, Jill, rode an Amtrak train to Delaware and the home they have there.",
            "But they, too, planned to return, at least part time, to Washington, where Mrs. Biden teaches at a community college in the Virginia suburbs."
        ],
        [
            "The United States has never seen a president quite like Mr. Trump, the son and grandson of immigrants who grew up to become a real estate magnate, casino owner, beauty pageant operator and reality television star whose tumultuous love life played out in the tabloids."
        ],
        [
            "Never has the oath been administered to a president who had never served either in public office or as a general in the military.",
            "At age 70, Mr. Trump became the oldest president sworn in for the first time and the first born in New York since Franklin D. Roosevelt."
        ],
        [
            "He was also one of the wealthiest presidents ever to enter the White House, with far-reaching business connections that have already raised questions about where his interests end and the country’s begin.",
            "He arrived in the Oval Office dogged by reports about Russian interference in the election on his behalf."
        ],
        [
            "But Mr. Trump overcame skeptics when he embarked on what seemed like a quixotic bid for the presidency.",
            "An Ivy League-educated mogul who lives in a New York tower named after himself with an 80-foot-long living room, he transformed himself into the unlikely leader of a working-class movement anchored in rural areas far removed from the coasts."
        ],
        [
            "His bracing candor, disregard for convention and willingness to offend whole sections of the population to make a point came across as refreshing truth-telling to many Americans disenchanted with Washington elites."
        ],
        [
            "For the nation’s 58th inauguration, though, the untraditional president opted to follow tradition.",
            "He and Mrs. Trump, a former model from Slovenia who became the first foreign-born first lady since John Quincy Adams’s wife, Louisa, started the day with a service at St. John’s Episcopal Church adjacent to Lafayette Square, then joined the Obamas, Bidens and Pences for coffee at the White House."
        ],
        [
            "From there, the two presidents shared a limousine to the Capitol, where three other presidents waited: Mr. Clinton, Jimmy Carter and George W. Bush, all of whom opposed Mr. Trump’s election.",
            "Former President George Bush remained hospitalized in Houston, recovering from pneumonia, but a spokesman said he watched the ceremony on television."
        ],
        [
            "Mr. Pence, 57, was sworn in at 11:54 a.m., placing his hand on Ronald Reagan’s Bible, which was held by his wife, Karen, as their three adult children, Michael, Charlotte and Audrey, watched."
        ],
        [
            "For his oath, Mr. Trump placed his hand on two Bibles held by his wife, one given him by his mother in 1955 just before his ninth birthday and another used by Abraham Lincoln in 1861 and again by Mr. Obama in 2009 and 2013."
        ],
        [
            "Standing nearby were his adult children from two previous marriages, Donald Jr., Eric, Ivanka and Tiffany.",
            "Also there was Barron, his 10-year-old son with the first lady.",
            "Joining them was Ivanka’s husband, Jared Kushner, who will serve as an unpaid senior adviser."
        ],
        [
            "As Mr. Trump approached the podium, rain began to fall.",
            "It was not a conventionally Republican speech, with nothing about tax cuts or restraining government.",
            "Instead, he laid out a protectionist agenda, saying his rule will be “buy American and hire American.”",
            "He did pledge to “eradicate from the face of the Earth” Islamic terrorism.",
            "Responding to charges that he demonized Mexicans and Muslims, Mr. Trump said, “There is no room for prejudice.”"
        ],
        [
            "Mr. Trump said the inauguration was not merely the transfer of power from one president to another.",
            "“We are transferring power from Washington, D.C., and giving it back to you, the people,” he said."
        ],
        [
            "“For too long,” he continued, “a small group in our nation’s capital has reaped the rewards of government while the people have borne the cost.",
            "Washington flourished but the people did not share in the wealth.”",
            " He added, “That all changes starting right here and right now.”"
        ]
    ],
    "source": "nyt",
    "url": "https://www.nytimes.com/2017/01/20/us/politics/trump-inauguration-day.html",
    "date": "2017-01-20"
}
