{
    "source": "fox",
    "main-entities": ["Donald Trump", "Roy Moore"],
    "main-event": "White House responds to sexual misconduct allegations against Roy Moore",
    "title": "Trump: Roy Moore will 'step aside' if sexual misconduct allegations are true",
    "url": "http://www.foxnews.com/politics/2017/11/09/trump-roy-moore-will-step-aside-if-sexual-misconduct-allegations-are-true.html",
    "word-count": 756,
    "date": "2017-11-09",
    "uuid": "1b3805dc-511e-4d30-9b45-1c5d93c5daa1",
    "triplet-uuid": "be026bd1-52b1-4789-bfd3-3632af17b054",
    "body-paragraphs": [
        [
            "President Trump thinks Alabama Republican Senate candidate Roy Moore “will do the right thing and step aside” if the sexual misconduct allegations against him are true, the White House said in a statement Thursday."
        ],
        [
            "Speaking to reporters following the president’s Asia trip on Air Force One, White House Press Secretary Sarah Sanders also cautioned against a rush to judgment."
        ],
        [
            "“Like most Americans, the president believes we cannot allow a mere allegation, in this case one from many years ago, to destroy a person’s life,\" Sanders said.",
            "\"However, the president also believes that if these allegations are true, Judge Moore will do the right thing and step aside.\""
        ],
        [
            "Moore lashed out earlier at what he called \"the Obama-Clinton machine's liberal media lapdogs\" after The Washington Post reported on a woman's claims that the former judge and staunch social conservative initiated a sexual encounter with her when she was 14."
        ],
        [
            "In a series of tweets Thursday evening, Moore claimed \"The forces of evil will lie, cheat, steal –– even inflict physical harm –– if they believe it will silence and shut up Christian conservatives.\""
        ],
        [
            "Amid calls for him to drop out of the race, Moore added, \"Our nation is at a crossroads right now — both spiritually and politically.",
            "Our children and grandchildren’s futures are on the line.",
            "So rest assured — I will NEVER GIVE UP the fight!\""
        ],
        [
            "The Post story centered on allegations made by Leigh Corfman, now 53.",
            "She told the newspaper that Moore, then an assistant district attorney, first approached her in 1979 outside a courtroom in Alabama where she was sitting with her mother.",
            "On another occasion, she said Moore, then 32, took her to his home in the woods and kissed her."
        ],
        [
            "During a subsequent visit, Corfman reportedly claimed he took off her shirt and pants; touched her over her bra and underwear; and guided her hand to his underwear.",
            "She said the two did not have sexual intercourse, and that she ended up getting dressed and asking Moore to take her home, according to the Post."
        ],
        [
            "“I wanted it over with – I wanted out,” she told the Post, apparently recalling her train of thought at the time.",
            "Moore did take her home, she said."
        ],
        [
            "The report caused immediate problems for Moore with his own party as he heads into the Dec. 12 election against Democrat Doug Jones.",
            "Several GOP senators called on him to step aside if the allegations are true – and at least one senator, Arizona’s John McCain, said he should drop out regardless."
        ],
        [
            "Senate Majority Leader Mitch McConnell, R-Ky., who backed Moore’s rival Luther Strange in the GOP primary, said in a statement: \"If these allegations are true, he must step aside.\""
        ],
        [
            "Sen. Cory Gardner, R-Colo., head of the Senate GOP campaign arm, called the allegations “deeply troubling” and said: “If these allegations are found to be true, Roy Moore must drop out of the Alabama special Senate election.”"
        ],
        [
            "Jones’ campaign told multiple news outlets: “Roy Moore needs to answer these serious charges.”"
        ],
        [
            "But Moore’s campaign issued a statement saying the report is “baseless” and false."
        ],
        [
            "“National liberal organizations know their chosen candidate Doug Jones is in a death spiral, and this is their last ditch Hail Mary,” Moore campaign chairman Bill Armistead said.",
            "“Judge Roy Moore is winning with a double-digit lead.",
            "So it is no surprise, with just over four weeks remaining, in a race for the U.S. Senate with national implications, that the Democratic Party and the country’s most liberal newspaper would come up with a fabrication of this kind."
        ],
        [
            "“This garbage is the very definition of fake news and intentional defamation,” he said."
        ],
        [
            "The Post noted that the legal age of consent in the state is 16, and sexual contact by anyone 19 or older with anyone between 12 and 16 years old is considered second-degree sexual abuse."
        ],
        [
            "The statute of limitations, though, has long since passed."
        ],
        [
            "The Post interviewed three other women who were teenagers at the time who claimed Moore pursued them when he was in his 30s, though he did not force them into any type of sexual relationship."
        ],
        [
            "“I have prayed over this,” Corfman told the Post as to why she came forward, “All I know is that I can’t sit back and let this continue, let him continue without the mask being removed.”"
        ],
        [
            "Alabama's Republican governor, Kay Ivey, responded: “These allegations are deeply disturbing.",
            "I will hold judgment until we know the facts.",
            "The people of Alabama deserve to know the truth and will make their own decisions.”"
        ]
    ]
}
