{
    "source": "nyt",
    "main-entities": ["Alabama Republicans", "Roy Moore"],
    "main-event": "Alabama Republicans responds to sexual misconduct allegations against Roy Moore",
    "title": "Alabama Republicans Defend Roy Moore: ‘It Was 40 Years Ago’",
    "url": "https://mobile.nytimes.com/2017/11/10/us/politics/roy-moore-alabama-republicans.html?referer=",
    "word-count": 596,
    "date": "2017-11-10",
    "uuid": "908124f8-61db-416e-a034-737aa9a74a8b",
    "triplet-uuid": "be026bd1-52b1-4789-bfd3-3632af17b054",
    "body-paragraphs": [
        [
            "Republican officials in Alabama staunchly defended their party’s Senate nominee, Roy S. Moore, after a report that he had made sexual advances toward four teenage girls when he was in his 30s."
        ],
        [
            "The Washington Post reported that, in early 1979, Mr. Moore, then a district attorney and later the chief justice of the state Supreme Court, had approached a 14-year-old, eventually kissing her, undressing her, touching her over her bra and underpants, and guiding her hand to touch him over his underwear."
        ],
        [
            "The paper found three other women who said they had been pursued by Mr. Moore around the same time, when they were between 16 and 18 years old.",
            "The Post interviewed more than 30 people in reporting its account."
        ],
        [
            "Mr. Moore told The Post that the allegations were “completely false and are a desperate political attack by the National Democrat Party and the Washington Post on this campaign.”",
            "He is set to face Doug Jones, a Democrat, in a special election next month."
        ],
        [
            "The story was met with immediate backlash from Republicans in Alabama, several of whom dismissed the women’s stories out of hand.",
            "Some called the article a partisan plot, even as the reporters behind it described in detail how they had uncovered the story and corroborated the allegations.",
            "Here are some of the officials’ responses."
        ],
        [
            "‘Total contrived media garbage’"
        ],
        [
            "That’s how John Skipper, 66, a former chairman of the Mobile County Republican Party, characterized the claims, speaking to The New York Times."
        ],
        [
            "He said that he and other Alabama Republicans would continue to support their candidate and echoed Mr. Moore’s assertion that the Democratic Party had been behind the story."
        ],
        [
            "“Most of them will not be shocked,” he said, “and will rather be expecting these shenanigans being pulled by the Democrats as standard operating procedure.”"
        ],
        [
            "Alabama’s state auditor, Jim Ziegler, told The Washington Examiner that the women’s claims were “much ado about nothing” and said that Mr. Moore had done nothing “immoral or illegal.”",
            "(Alabama law, both in 1979 and now, finds that someone who is 19 or older and has sexual contact with someone between the ages of 12 and 16 is guilty of second-degree sex abuse.)"
        ],
        [
            "Mr. Ziegler sought to justify Mr. Moore’s actions by comparing him to the biblical Joseph, saying, “Mary was a teenager and Joseph was an adult carpenter.",
            "They became parents of Jesus.”"
        ],
        [
            "“If they believe this man is predatory, they are guilty of allowing him to exist for 40 years,” he said.",
            "“I think someone should prosecute and go after them.",
            "You can’t be a victim 40 years later, in my opinion.”"
        ],
        [
            "Daniel Dale, a reporter for The Toronto Star, contacted multiple Republican officials in the state and kept a running report of their responses to the story."
        ],
        [
            "Jerry Pow, the party chairman for Bibb County, told Mr. Dale that he’d back Mr. Moore even if the candidate had committed a sex crime."
        ],
        [
            "“I would vote for Judge Moore because I wouldn’t want to vote for Doug,” he said.",
            "“I’m not saying I support what he did.”"
        ],
        [
            "Others, including the party chairmen for Covington County, William Blocker, and Mobile County, John Skipper, dismissed the story as a Democratic trick.",
            "Mr. Blocker said that he would not change his mind even if there was proof that Mr. Moore was guilty."
        ],
        [
            "Riley Seibenhener, the party chairman in Geneva County, told Mr. Dale that if the allegations were true, he would not support the candidate.",
            "But he also said that Mr. Moore was not guilty of “forcible rape.”"
        ],
        [
            "“I know that 14-year-olds dont’t make good decisions,” he said."
        ]
    ]
}
