{
    "source": "hpo",
    "main-entities": ["Kathy Griffin", "Donald Trump"],
    "main-event": "Kathy Griffin apologizes for photo shoot with a fake bloody Donald Trump head",
    "title": "Kathy Griffin Apologizes For Controversial Images Of Bloodied Trump Head",
    "url": "https://www.huffingtonpost.com/entry/so-heres-a-photo-of-kathy-griffin-beheading-donald-trump_us_592dbd5ce4b0c0608e8bdb08",
    "word-count": 647,
    "date": "2017-05-30",
    "uuid": "d4ab861e-2ce8-4d03-a4ff-9aa49b7025ac",
    "triplet-uuid": "d16050b3-979f-4834-90db-b8823691b87e",
    "body-paragraphs": [
        [
            "Kathy Griffin Apologizes For Controversial Images Of Bloodied Trump Head"
        ],
        [
            "This feels like an “America’s Next Top Model” challenge gone so horribly wrong."
        ],
        [
            "Kathy Griffin has made a career out of shocking her public by telling stories of Lindsay Lohan’s fire crotch and simulating oral sex with Anderson Cooper on CNN, but she took things to a whole new level with a controversial photo shoot."
        ],
        [
            "Shot by celebrity photographer and director Tyler Shields, the comedian stares the camera down in one photo, as she holds what resembles the bloody head of President Donald Trump."
        ],
        [
            "“Kathy is all about pushing the limits and she went above and beyond on this one.",
            "Now lets just hope she stays out of jail,” a representative for Shields told HuffPost."
        ],
        [
            "In other (and considerably less gory) photos shot by Shields, Griffin poses by the pool in a revealing leather getup as a man holding a camera stands above her."
        ],
        [
            "According to New York Magazine writer Yashar Ali, Griffin claims that the image is an “expression of art” inspired by Trump’s comments about former Fox News correspondent Megyn Kelly having “blood coming out of her eyes” and “out of her — wherever.”"
        ],
        [
            "After news of the photo shoot broke, Griffin took to Twitter to explain her motivations behind the image and reiterate that she does not condone violence in any way.",
            "She does, however, condone “mocking the Mocker in Chief.”"
        ],
        [
            "UPDATE - May 30, 10 p.m.: Kathy Griffin issued a formal apology for the controversial images on Twitter."
        ],
        [
            "“I went way too far,” she said in a video on the social media site."
        ],
        [
            "UPDATE - May 30, 5:20 p.m.: Hours after Kathy Griffin’s photo shoot with a fake bloody Donald Trump head made the internet rounds, the official Twitter account for the U.S. Secret Service has issued a statement."
        ],
        [
            "A Secret Service representative confirmed to HuffPost that the following tweets were in direct response to the controversial image."
        ],
        [
            "“On it! @SecretService has a robust protective intelligence division that monitors open source reporting & social media to evaluate threats,” the tweets read.",
            "“Threats made against @SecretService protectees receive the highest priority of all of our investigations,” with the hashtag #ProtectionNeverRests."
        ]
    ]
}
