{
    "triplet-uuid": "d16050b3-979f-4834-90db-b8823691b87e",
    "url": "http://www.foxnews.com/entertainment/2017/05/30/kathy-griffin-apologizes-for-photo-shoot-with-bloodied-trump-mask-says-went-too-far.html",
    "keywords": "",
    "word-count": 428,
    "body-paragraphs": [
    	[
            "Kathy Griffin admitted Tuesday she \"went too far\" on her latest photo shoot with controversial photographer Tyler Shields in which she is holding a bloodied mask of President Trump."
        ],
        [
            "The gory photo first published in TMZ from Griffin's photo session with the famed Shields, known for his shocking pictures."
        ],
        [
            "In a Twitter post late Tuesday, Griffin said the image \"is too disturbing,\" and that \"it wasn't funny.\""
        ],
        [
            "\"I understand how it offends people,\" she said, adding \"I've made a lot of mistakes in my career.\""
        ],
        [
            "According to the gossip site, Griffin joked with Shields on set they would need to move to Mexico after the photos were released or fear imprisonment.",
            "In her Twitter post on Tuesday, Griffin said she was going to \"take down the image.\""
        ],
        [
            "\"I went too far and I was wrong,\" she said."
        ],
        [
            "People took to Twitter to express their disdain for the photo shoot."
        ],
        [
            "Reps for Griffin did not immediately return Fox News' request for comment."
        ],
        [
            "Chelsea Clinton called it \"vile and wrong\" in a Twitter post."
        ],
        [
            "Shields told Fox News that Griffin was hoping to create a bold message."
        ],
        [
            "\"Kathy and I are friends and we worked together before, so when we started doing this shoot, she said, 'I'd love to do something political.",
            "I'd love to make a statement,'\" he explained.",
            "\"We kind of figured out what would be the best image to make out of that.\""
        ],
        [
            "Shields added the image was meant to serve as art and he's aware that it could make some viewers uncomfortable."
        ],
        [
            "\"That's what art is meant to do,\" he said.",
            "\"Some people look at it and they love it.",
            "Some people look at it and they hate it...",
            "I understand there are going to be people that hate this.",
            "It's a very touchy subject... but this is not real.",
            "We didn't kill anybody nor do I feel anybody should be killed.",
            "It's no different from a movie.",
            "It just happens to be a still image.\""
        ],
        [
            "Shields tweeted a link to a YouTube video called \"Behind the scenes with Kathy Griffin\" but the video has since been removed.",
            "However, he later told Fox News that the video had glitches, which prompted him to take it down and then re-upload it."
        ],
        [
            "This is hardly the first time Shields' photos have caused uproar.",
            "He previously received death threats over a photo he took of \"Glee\" actress Heather Morris with bruises on her face.",
            "The photo was criticized for making light of domestic abuse."
        ],
        [
            "As for his recent collaboration with Griffin, he doesn't regret it."
        ],
        [
            "\"I can't speak for her, [but] I know she loves to stir the pot,\" he said.",
            "\"For me, I love the idea we have freedom of speech.",
            "The fact that I'm allowed to make an image like this says a lot.",
            "To me, that's a powerful thing... nobody's killed me for this image so it's not that bad.",
            "I love Kathy and I hope they let me visit her in Guantanamo.\""
        ]
    ],
    "uuid": "5fb52d5e-fe3c-4f16-8ddb-419f198df929",
    "source": "fox",
    "title": "Kathy Griffin apologizes for photo shoot with bloodied Trump mask, says she 'went too far'",
    "date": "2017-05-30",
    "main-event": "Kathy Griffin apologizes for photo shoot with a fake bloody Donald Trump head",
    "main-entities": ["Kathy Griffin"]
}
