{
    "keywords": "",
    "word-count": 651,
    "date": "2017-05-31",
    "uuid": "40501fc8-6f72-4a91-bcb2-e54186b8fd4a",
    "body-paragraphs": [
        [
            "Trump Lashes Out at Kathy Griffin and Democrats"
        ],
        [
            "WASHINGTON — President Trump assailed Democrats and a television comedian on Wednesday in his latest Twitter blasts since returning from an overseas trip in which he had largely abstained from the sort of combative social media postings that helped propel him to the Oval Office and have gotten him in trouble ever since."
        ],
        [
            "The president castigated Kathy Griffin, the celebrity comic and author, for posing for a video showing her holding what looks like the severed and bloodied head of Mr. Trump.",
            "The video touched off a storm of protests from people on all sides of the political spectrum, which forced Ms. Griffin to apologize, and CNN announced that it would fire her from the annual New Year’s Eve program she has co-hosted."
        ],
        [
            "In a statement later in the day, the first lady, Melania Trump, questioned Ms. Griffin’s sanity.",
            "“As a mother, a wife, and a human being, that photo is very disturbing,” she said.",
            "“When you consider some of the atrocities happening in the world today, a photo opportunity like this is simply wrong and makes you wonder about the mental health of the person who did it.”"
        ],
        [
            "The Trumps had the support of the daughter of the woman the president beat in last year’s election, among others."
        ],
        [
            "Ms. Griffin went online on Tuesday night to express regret.",
            "“I sincerely apologize,” she said in a video.",
            "“I’m just now seeing the reaction of these images.",
            "I’m a comic.",
            "I crossed the line. I move the line, I cross it. I went way too far.",
            "The image is too disturbing.",
            "I understand how it offends people.",
            "It wasn’t funny. I get it.”"
        ],
        [
            "She said she had asked the photographer to pull the images.",
            "“I beg for your forgiveness,” she continued.",
            "“I went too far.",
            "I made a mistake and I was wrong.” She did not address Mr. Trump specifically in her video."
        ],
        [
            "CNN, which has enlisted Ms. Griffin to host New Year’s Eve programming alongside Anderson Cooper for the last decade, announced on Wednesday that she would no longer appear."
        ],
        [
            "Mr. Cooper distanced himself, as well."
        ],
        [
            "Mr. Trump also lashed out at Democrats in Congress whom he accused of trying to squelch testimony involving the investigation into Russian meddling in last year’s election.",
            "Shortly after a “Fox and Friends” segment reporting that Democrats no longer want to hear testimony from Carter Page, a onetime Trump campaign adviser, Mr. Trump wrote that it was all part of a “witch hunt” against him."
        ],
        [
            "“So now it is reported that the Democrats, who have excoriated Carter Page about Russia, don’t want him to testify,” he wrote.",
            "“He blows away their case against him & now wants to clear his name by showing ‘the false or misleading testimony by James Comey, John Brennan …’ Witch Hunt!”"
        ],
        [
            "In a letter to the House Intelligence Committee reported by Fox and other news organizations, Mr. Page wrote: “I have learned from your Committee staff on this Memorial Day holiday that I might not be immediately afforded the opportunity to address the false or misleading testimony by James Comey, John Brennan, et al. as per our previously scheduled appointment for next week.",
            "In the interest of finally providing the American people with some accurate information at long last, I hope that we can proceed with this straight dialogue soon.”"
        ],
        [
            "Mr. Page did not list what testimony he considered false by Mr. Comey, who was fired by Mr. Trump as director of the F.B.I., or Mr. Brennan, the former director of the C.I.A., who stepped down when President Barack Obama left office in January.",
            "But Mr. Page urged the committee “to investigate the growing evidence of collusion between Clinton campaign associates, Comey and other former Obama administration officials.”"
        ]
    ],
    "triplet-uuid": "d16050b3-979f-4834-90db-b8823691b87e",
    "title": "Trump Lashes Out at Kathy Griffin and Democrats",
    "source": "nyt",
    "url": "https://mobile.nytimes.com/2017/05/31/us/politics/trump-kathy-griffin-comedian-democrats.html",
    "main-event": "Kathy Griffin apologizes for photo shoot with a fake bloody Donald Trump head",
    "main-entities": ["Kathy Griffin", "Donald Trump"]
}
