{
    "triplet-uuid": "dd1e6e3b-f36c-4064-8ef9-940984e9afa2",
    "url": "http://www.foxnews.com/politics/2017/11/13/donald-trump-jr-releases-messages-with-wikileaks-from-before-election.html?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+foxnews%2Fmost-popular+%28Internal+-+Most+Popular+Content%29",
    "keywords": "",
    "word-count": 794,
    "body-paragraphs": [
        [
            "President Trump’s eldest son, Donald Trump Jr., corresponded with WikiLeaks before the 2016 presidential election, a dialogue of which the president’s son confirmed Monday night on Twitter."
        ],
        [
            "In a series of tweets, Trump Jr. produced “the entire chain of messages with @wikileaks (with my whopping 3 responses) which one of the congressional committees has chosen to selectively leak.",
            "How ironic!”"
        ],
        [
            "The Atlantic first reported on Monday that Trump Jr. received a private message from the WikiLeaks Twitter account on September 20, 2016 — a message shown in the tweets produced by the president’s son."
        ],
        [
            "“A PAC run anti-Trump site putintrump.org is about to launch,” WikiLeaks wrote.",
            "“The PAC is a recycled pro-Iraq war PAC.",
            "We have guessed the password.",
            "It is ‘putintrump.’ See ‘About’ for who is behind it.",
            "Any comments?”"
        ],
        [
            "Trump Jr. replied, “Off the record I don’t know who that is, but I’ll ask around.",
            "Thanks.”"
        ],
        [
            "In a separate October 2016 exchange, WikiLeaks urged Trump Jr. to “comment on/push this story” about then-Democratic presidential nominee Hillary Clinton wanting to “just drone” Julian Assange, the Wikileaks founder."
        ],
        [
            "“Already did that earlier today,” Trump Jr. later replied.",
            "“It’s amazing what she can get away with.”"
        ],
        [
            "The messages obtained by The Atlantic were turned over to investigators by Trump Jr.’s attorneys.",
            "The House Permanent Select Committee on Intelligence had access to the documents, a source told Fox News."
        ],
        [
            "“Over the last several months, we have worked cooperatively with each of the committees and have voluntarily turned over thousands of documents in response to their requests,” Alan Futerfas, an attorney for Trump Jr., said in a statement."
        ],
        [
            "“Putting aside the question as to why or by whom such documents, provided to Congress under promises of confidentiality, have been selectively leaked, we can say with confidence that we have no concerns about these documents and any questions raised about them have been easily answered in the appropriate forum.”"
        ],
        [
            "According to the report, the messages are part of a long correspondence between WikiLeaks and Trump Jr., though Trump Jr. seemed to ignore many of the messages, including some which urged him to release “one or more of your father’s tax returns.”"
        ],
        [
            "President Trump’s attorney Ty Cobb told Fox News on Monday that he was not aware that Donald Trump Jr.’s attorneys provided these documents to congressional investigators, but said there is likely no legal issue, from what he knows of the documents."
        ],
        [
            "Wikileaks publisher Julian Assange tweeted about the report on Monday, saying that the organization couldn’t “confirm” the messages with Trump Jr."
        ],
        [
            "Wikileaks “does not keep such records and the Atlantic’s presentation is edited and clearly does not have the full context,” Assange wrote."
        ],
        [
            "“WikiLeaks loves its pending publications and ignores those who ask for details,” Assange continued.",
            "“Trump Jr. was rebuffed just like Cambridge Analytica.",
            "In both cases WikiLeaks had publicly teased the publications.",
            "Thousands of people asked about them.",
            "WikiLeaks can be very effective at convincing even high profile people that it is their interest to promote links to its publications."
        ],
        [
            "“WikiLeaks has such chutzpah that it allegedly tried to convince Trump Jr to leak his father’s tax returns & his own “Russian lawyer meeting” emails (he did),” Assange wrote.",
            "“WikiLeaks appears to beguile some people into transparency by convincing them that it is in their interest.”"
        ],
        [
            "Assange also claimed that the “full text of alleged DMs with context provides a different reading, unsurprisingly.”"
        ],
        [
            "This is not the first time that Trump Jr. has been in the spotlight, and has had his actions brought into question amid the larger probe into Russian meddling and potential collusion with Trump campaign associates in the 2016 presidential election."
        ],
        [
            "In June 2016, Trump Jr. accepted a now-highly scrutinized meeting with Russian attorney Natalia Veselnitskaya, after he allegedly was promised “dirt” on Hillary Clinton.",
            "The meeting was brokered by music publicist Rob Goldstone who promised the campaign information.",
            "Jared Kushner and Paul Manafort, who was charged last month in Special Counsel Robert Mueller’s probe into Russian collusion, also attended the meeting."
        ],
        [
            "Fox News’ Matt Richardson and John Roberts contributed to this report."
        ]
    ],
    "uuid": "a2d858d3-d70a-4d6f-a7a5-f2f68c5f03f6",
    "source": "fox",
    "title": "Donald Trump Jr. releases messages with WikiLeaks from before election",
    "date": "2017-11-13",
    "main-event": "Donald Trump Jr. Messaged With WikiLeaks During Presidential Campaign",
    "main-entities": ["Donald Trump Jr.", "WikiLeaks"]
}
