{
    "keywords": "",
    "word-count": 608,
    "date": "2017-11-13",
    "uuid": "8d684d7c-3df0-4756-b11b-1cc153689164",
    "body-paragraphs": [
        [
            "Donald Trump Jr. Communicated With WikiLeaks During Campaign"
        ],
        [
            "WASHINGTON — Donald Trump Jr. had multiple online conversations during the 2016 presidential campaign with WikiLeaks, the anti-secrecy group that last year released a hacked trove of Democrats’ emails, according to four congressional officials."
        ],
        [
            "Mr. Trump, the president’s son, in recent weeks handed over Twitter messages he exchanged with WikiLeaks to several congressional committees investigating Russia’s attempts to disrupt the election, according to the officials.",
            "In September, Mr. Trump acknowledged in a closed-door interview with the Senate Judiciary Committee that he had corresponded with the group during the campaign, the officials said."
        ],
        [
            "The correspondence, which began weeks before the Nov. 8, 2016, election and continued through much of this year, is the second time it has been publicly revealed that Mr. Trump communicated with people and organizations with ties to the Russian government who were trying to undermine the presidential campaign of Hillary Clinton."
        ],
        [
            "In July, The New York Times reported that Mr. Trump met with Russians in June 2016 who said they had damaging information on Mrs. Clinton, and that the information was part of the Russian government’s support for Mr. Trump."
        ],
        [
            "Mr. Trump on Monday night releasedseveralscreen shots of his messages with WikiLeaks.",
            "His lawyer, Alan S. Futerfas, said the documents were “selectively leaked” among the thousands that have been turned over to congressional investigators."
        ],
        [
            "“We can say with confidence that we have no concerns about these documents and any questions raised about them have been easily answered in the appropriate forum,” Mr. Futerfas said in a statement."
        ],
        [
            "By publishing thousands of hacked emails, American intelligence agencies believe WikiLeaks was acting as a conduit for Russian operatives."
        ],
        [
            "The Twitter messages were first reported by The Atlantic, which published copies of the correspondence."
        ],
        [
            "“Hiya, it’d be great if you guys could comment on/push this story,” WikiLeaks said in a message to Mr. Trump on Oct. 3, 2016, that included a quote from Mrs. Clinton in which she said she wanted to “just drone” Julian Assange, the WikiLeaks founder."
        ],
        [
            "“Already did that earlier today,” Mr. Trump said in response.",
            "“It’s amazing what she can get away with.”"
        ],
        [
            "In a message a week later, WikiLeaks asked Mr. Trump to have his father tweet a link to a site where users could search through hacked emails from Democrats."
        ],
        [
            "“There’s many great stories the press are missing and we’re sure some of your follows will find it,” WikiLeaks said, adding that the group had just released more emails stolen from Mrs. Clinton’s campaign chairman, John D. Podesta."
        ],
        [
            "Mr. Trump did not respond.",
            "Fifteen minutes later, however, his father tweeted: “Very little pick-up by the dishonest media of incredible information provided by WikiLeaks.",
            "So dishonest! Rigged system!”"
        ],
        [
            "Mr. Assange said on Twitter that he could not confirm whether the group had corresponded with Mr. Trump."
        ],
        [
            "“WikiLeaks loves its pending publications and ignores those who ask for details,” Mr. Assange said, adding that thousands of people had asked the group about the emails it had published."
        ],
        [
            "Mark Warner, the top Democrat on the Senate Intelligence Committee, said the messages, if real, are “one more example of Russians, Russian agents — in this case WikiLeaks — reaching out to senior officials in the Trump Organization or Trump campaign.”"
        ],
        [
            "The last message Mr. Trump received from WikiLeaks was in July, shortly after The Times reported that he had corresponded with the Russians promising “dirt” on Mrs. Clinton."
        ],
        [
            "“Hi Don.",
            "Sorry to hear about your problems,” WikiLeaks said.",
            "“We have an idea that may help a little.",
            "We are VERY interested in confidentially obtaining and publishing a copy of the email(s) cited in the New York Times today.”"
        ],
        [
            "Shortly thereafter, Mr. Trump released the emails himself."
        ]
    ],
    "triplet-uuid": "dd1e6e3b-f36c-4064-8ef9-940984e9afa2",
    "title": "Donald Trump Jr. Communicated With WikiLeaks During Campaign",
    "source": "nyt",
    "url": "https://mobile.nytimes.com/2017/11/13/us/politics/donald-trump-jr-wikileaks-emails-democrats.html",
    "main-event": "Donald Trump Jr. Messaged With WikiLeaks During Presidential Campaign",
    "main-entities": ["Donald Trump Jr.","WikiLeaks"]
}
