{
    "title": "Michael Steele’s Afghanistan Comments Stir Up Furious Reaction From Conservatives",
    "keywords": "ron paul afghanistan troops,steele afghanistan,paul steele congratulations,paul libertarians,ron paul,steele democrats,steele critism,paul michael steele",
    "date": "2010-07-04",
    "uuid": "f03b6656-7eb7-4446-968a-d6aa805fd4a3",
    "url": "https://www.huffpost.com/entry/michael-steeles-afghanist_n_633943",
    "main-entities": ["Michael Steele"],
    "word-count": 425,
    "source": "hpo",
    "main-event": "Michael Steele Criticized for Afghanistan Comments",
    "triplet-uuid": "2b95d2cf-e979-4f9c-ae27-9a5370934f23",
    "body-paragraphs": [
        [
            "Several prominent conservatives offered swift, negative reactions to Michael Steele on Friday, after the RNC chairman was caught on camera saying that Afghanistan is a largely unwinnable war of President Obama’s choosing. "
        ],
        [
            "The pushback crested with Bill Kristol — still an influential voice among Republican lawmakers — writing a letter to Steele on his Weekly Standard site calling for the RNC leader’s resignation."
        ],
        [
            "“Needless to say, the war in Afghanistan was not “a war of Obama’s choosing.”",
            "It has been prosecuted by the United States under Presidents Bush and Obama.",
            "Republicans have consistently supported the effort.",
            "Indeed, as the DNC Communications Director (of all people) has said, your statement “puts [you] at odds with about 100 percent of the Republican Party."
        ],
        [
            "And not on a trivial matter.",
            "At a time when Gen. Petraeus has just taken over command, when Republicans in Congress are pushing for a clean war funding resolution, when Republicans around the country are doing their best to rally their fellow citizens behind the mission, your comment is more than an embarrassment.",
            "It’s an affront, both to the honor of the Republican party and to the commitment of the soldiers fighting to accomplish the mission they’ve been asked to take on by our elected leaders."
        ],
        [
            "There are, of course, those who think we should pull out of Afghanistan, and they’re certainly entitled to make their case.",
            "But one of them shouldn’t be the chairman of the Republican party.”"
        ],
        [
            "Kristol’s was the harshest of all the reactions to the Steele, whose spokesman, it should be noted, tried to clarify the comment by insisting that he merely meant that President Obama has not been forthcoming with a winning strategy. "
        ],
        [
            "But the Weekly Standard editor was not alone."
        ],
        [
            "Another major neoconservative figure, Dan Senor, told the Huffington Post that Steele’s comments are “utterly irresponsible.”",
            "Senor, who served under the Bush administration as chief spokesman in Iraq and has been a major booster of efforts to escalate U.S. military presence in Afghanistan, noted that Steele’s RNC actually sponsored a conference call for his group to praise Obama’s Afghan surge last year. "
        ],
        [
            "Indeed, even Steele himself declared back in December that Afghanistan is “’a war we have to win” — a far cry from the comments he made Thursday night, in which he said: “...you don’t do is engage in a land war in Afghanistan, alright, because everyone who’s tried over a thousand years of history has failed.” "
        ],
        [
            "“It’s completely inconsistent with this latest statement,” summarized Senor. "
        ],
        [
            "In a bit of irony, Steele’s most recent comments have actually resonated among anti-war Democrats who share the skepticism that Afghanistan is a winnable enterprise.",
            "They also, in some respects, echo the opinions of some members of the conservative community (Joe Scarborough and George Will among them) who have been critical of the deployment of U.S. forces in that country. "
        ],
        [
            "But Steele is not an anti-war Democrat. Nor is he a pundit.",
            "He is the figurehead of the Republican Party whose tenure, once again, seems shaky.",
            "Shortly after Kristol called for his resignation, a GOP operative began pitching the column to reporters, hoping that the meme of Steele’s troubles would spread far and wide."
        ]
    ]
}
