{
    "title": "GOP Senators Keep Pressure on Steele Over 'Inaccurate' Afghanistan Comments",
    "keywords": "",
    "date": "2010-07-04",
    "uuid": "238b97e4-c6f7-4fbb-87c2-3c92c5fb3b03",
    "url": "http://www.foxnews.com/politics/2010/07/04/gop-senators-pressure-steele-inaccurate-afghanistan-comments.html",
    "main-entities": ["Michael Steele"],
    "word-count": 322,
    "source": "fox",
    "main-event": "Michael Steele Criticized for Afghanistan Comments",
    "triplet-uuid": "2b95d2cf-e979-4f9c-ae27-9a5370934f23",
    "body-paragraphs": [
        [
            "Republican senators kept up pressure on party Chairman Michael Steele Sunday to better explain -- and publicly apologize for -- his on-camera claim that Afghanistan is a \"war of Obama's choosing\" and may not be winnable."
        ],
        [
            "The backlash built quickly over the weekend as some prominent conservatives called for Steele's resignation.",
            "Speaking on \"Fox News Sunday,\" Sen. Jim DeMint, R-S.C., would not go that far but said Steele must apologize to the troops."
        ],
        [
            "\"Chairman Steele needs to apologize to our military, all the men and women who've been fighting in Afghanistan,\" he said.",
            "\"This is America's war.",
            "It's not Obama's war.\""
        ],
        [
            "The GOP chairman is known for off-the-cuff and occasionally troublesome comments, but the Afghanistan remarks were too much to bear for some war-supporting Republicans."
        ],
        [
            "DeMint, who said Afghanistan is a war the United States must win, said Steele needs to \"refocus\" on the November election.",
            "He called Steele's comments \"unacceptable\" and \"inaccurate.\""
        ],
        [
            "\"We need a chairman who's focused,\" DeMint said."
        ],
        [
            "Speaking on ABC's \"This Week,\" Sen. John McCain, R-Ariz., said Steele's comments were \"wildly inaccurate.\""
        ],
        [
            "The Arizona Republican said Steele needs to assess whether he can still function in his job and must make \"an appropriate decision\" about his future."
        ],
        [
            "Trying to quell the furor, Steele issued a statement saying: \"There is no question that America must win the war on terror.",
            "... And, for the sake of the security of the free world, our country must give our troops the support necessary to win this war.\""
        ],
        [
            "He sent an e-mail to RNC members saying he hoped his statement would \"clear up any confusion\" caused by his earlier remarks."
        ],
        [
            "That didn't seem to quiet the controversy in the slightest.",
            "Weekly Standard Editor Bill Kristol, who led the charge of conservatives calling for Steele to step down over the remark, said on \"Fox News Sunday\" that Steele still needs to go -- though he said Steele tried to convince him otherwise."
        ],
        [
            "\"I think it would be better if he went,\" he said."
        ]
    ]
}
