{
    "title": "Michael Steele Criticized for Afghanistan Comments",
    "keywords": "Steele  Michael S,Republican National Committee,Afghanistan War (2001- ),United States Politics and Government,Kristol  William,Bush  George W,Obama  Barack",
    "date": "2010-07-02",
    "uuid": "d2e17368-b2da-4ee4-a7d9-8a5cccdebefd",
    "url": "http://www.nytimes.com/2010/07/03/us/politics/03steele.html?_r=2&ref=politics",
    "main-entities": ["Michael Steele", "Barack Obama"],
    "word-count": 708,
    "source": "nyt",
    "main-event": "Michael Steele Criticized for Afghanistan Comments",
    "triplet-uuid": "2b95d2cf-e979-4f9c-ae27-9a5370934f23",
    "body-paragraphs": [
        [
            "WASHINGTON — Michael Steele, chairman of the Republican National Committee, drew fierce criticism and a call for his resignation on Friday after declaring at a party fund-raiser that the United States was on the wrong side of history with its conflict in Afghanistan, a military fight he called “a war of Obama’s choosing.”"
        ],
        [
            "“This is not something the United States had actively prosecuted or wanted to engage in,” Mr. Steele said in a speech Thursday night in Connecticut in which he offered a strong critique of President Obama’s military strategy."
        ],
        [
            "“It was the president who was trying to be cute by half by flipping a script demonizing Iraq, while saying the battle really should be Afghanistan,” Mr. Steele said, according to a video of his remarks that was circulated by Democrats on Friday.",
            "“Well, if he’s such a student of history, has he not understood that you know that’s the one thing you don’t do, is engage in a land war in Afghanistan?”"
        ],
        [
            "Mr. Steele, seeking to clarify his remarks, issued a statement on Friday afternoon, saying, “There is no question that America must win the war on terror.”"
        ],
        [
            "His remarks were the latest in a string of controversial statements that he has made as party chairman."
        ],
        [
            "The war in Afghanistan, which has entered its ninth year, was started by former President George W. Bush in response to the terrorist attacks on Sept. 11, 2001.",
            "Mr. Obama shifted the focus on the war on terrorism from Iraq to Afghanistan and last year announced his plan to send 30,000 more troops there."
        ],
        [
            "Mr. Steele’s comments prompted William Kristol, editor of the Weekly Standard and a leading voice of conservative support for the war in Afghanistan, to call for Mr. Steele’s resignation as party leader."
        ],
        [
            "“Your tenure has, of course, been marked by gaffes and embarrassments, but I for one have never paid much attention to them, and have never thought they would matter much to the success of the causes and principles we share,” Mr. Kristol wrote Friday.",
            "He added, “Needless to say, the war in Afghanistan was not ‘a war of Obama’s choosing.’",
            "It has been prosecuted by the United States under Presidents Bush and Obama.”"
        ],
        [
            "He added, “There are, of course, those who think we should pull out of Afghanistan, and they’re certainly entitled to make their case.",
            "But one of them shouldn’t be the chairman of the Republican Party.”"
        ],
        [
            "A spokesman for the Democratic National Committee, Brad Woodhouse, said Mr. Steele was “betting against our troops and rooting for failure in Afghanistan.”",
            "Republican officials dismissed that criticism."
        ],
        [
            "When Mr. Steele made the remarks, he was speaking to Republican contributors at a fund-raiser in Connecticut.",
            "Linda McMahon, the party’s candidate for the United States Senate in Connecticut, was in the audience, along with other leading state Republicans.",
            "The video appears to have been taken by a hidden camera at an event that was closed to the press.",
            "Republican officials did not dispute the authenticity of the video, but disputed its characterization."
        ],
        [
            "In his statement on Friday afternoon, Mr. Steele did not respond to the call for his resignation.",
            "But he sought to make the case that Afghanistan is now Mr. Obama’s war."
        ],
        [
            "“For the sake of the security of the free world, our country must give our troops the support necessary to win this war,” Mr. Steele said.",
            "“As we have learned throughout history, winning a war in Afghanistan is a difficult task.",
            "We must also remember that after the tragedy of Sept. 11, 2001, it is also a necessary one.”"
        ],
        [
            "He added, with a reference to Gen. David H. Petraeus: “That is why I supported the decision to increase our troop force and, like the entire United States Senate, I support General Petraeus’s confirmation.",
            "The stakes are too high for us to accept anything but success in Afghanistan.”"
        ]
    ]
}
