{
    "title": "White House Used Bill Clinton to Ask Sestak to Drop Out of Race",
    "keywords": "Sestak  Joe,Specter  Arlen,Obama  Barack,Primaries and Caucuses,Pennsylvania",
    "date": "2010-05-27",
    "uuid": "73b9c883-1fce-456d-8f13-29006e58ff13",
    "url": "https://thecaucus.blogs.nytimes.com/2010/05/28/white-house-used-bill-clinton-to-ask-sestak-to-drop-out-of-race/",
    "main-entities": ["Joe Sestak", "Obama administration", "Bill Clinton"],
    "word-count": 246,
    "source": "nyt",
    "main-event": "White House Asked Bill Clinton to Urge Joe Sestak to Drop Out of Senate Race",
    "triplet-uuid": "38f7cbb7-5d6a-4c89-bcbd-8e164144172a",
    "body-paragraphs": [
        [
            "President Obama’s chief of staff used former President Bill Clinton as an intermediary to see if Representative Joe Sestak would drop out of Pennsylvania’s Democratic Senate primary if given a prominent, but unpaid, advisory position, the White House said on Friday."
        ],
        [
            "Rahm Emanuel, the chief of staff, asked Mr. Clinton last summer to explore “options of service” on a presidential or senior government advisory board with Mr. Sestak, the White House said in a statement.",
            "Mr. Sestak said no and went on to win last week’s primary against Senator Arlen Specter."
        ],
        [
            "The White House disputed Republican claims that the conversations might be illegal or improper.",
            "“There was no such impropriety,” Robert F. Bauer, the White House counsel, said in a memo released to reporters.",
            "“The Democratic Party leadership had a legitimate interest in averting a divisive primary fight and a similarly legitimate concern about the congressman vacating his seat in the House.”"
        ],
        [
            "Mr. Bauer went on to say that such horse-trading has been commonplace through history.",
            "“There have been numerous, reported instances in the past when prior administrations – both Democratic and Republican, and motivated by the same goals – discussed alternative paths to service for qualified individuals also considering campaigns for public office,” he wrote.",
            "“Such discussions are fully consistent with the relevant law and ethical requirements.”"
        ],
        [
            "Representative Darrell Issa of California, the senior Republican on the House Oversight and Government Reform Committee, said the interactions described by the White House “represent an illegal quid pro quo,” even if the position was unpaid.",
            "“It is abundantly clear that this kind of conduct is contrary to President Obama’s pledge to change ’business as usual’ and that his administration has engaged in the kind of political shenanigans he once campaigned to end.”"
        ],
        [
            "Federal law makes it a crime for anyone “who directly or indirectly, promises any employment, position, compensation, contract, appointment, or any other benefit” to someone else “as consideration, favor, or reward for any political activity or for the support of or opposition to any candidate or any political party in connection with any general or special election to any political office.”",
            "It is also illegal for a government official to use “his official authority for the purpose of interfering with, or affecting, the nomination or the election of any candidate” for Senate."
        ],
        [
            "While many have speculated that the White House offered to appoint Mr. Sestak as secretary of the Navy, Mr. Bauer said that was never the case.",
            "The White House did not offer Mr. Sestak a full-time paid position because Mr. Emanuel wanted him to stay in the House rather than risk losing his seat, so he considered “uncompensated advisory board options.”"
        ],
        [
            "The White House did not disclose what those options were, but people briefed on the matter said one option was an appointment to the president’s Intelligence Advisory Board, a panel of prominent Americans outside government who provide independent oversight of the nation’s spy apparatus and advise the president.",
            "But White House officials discovered that it would not work because Mr. Sestak could not serve on the board while still serving in Congress."
        ],
        [
            "In a statement Friday, Mr. Sestak said Mr. Clinton had conveyed Mr. Emanuel’s suggestion that he join a “presidential board” while remaining in the House, but he declined.",
            "“I told President Clinton that my only consideration in getting into the Senate race or not was whether it was the right thing to do for Pennsylvania working families and not any offer,” Mr. Sestak said.",
            "“The former president said he knew I’d say that, and the conversation moved on to other subjects.”"
        ],
        [
            "Mr. Sestak first mentioned publicly in February that he had been offered a job but provided no details, and the White House for three months had refused to discuss it, generating intense criticism from Republicans who accused it of trying to bribe a congressman and deep consternation among Democrats who called on the administration to answer questions."
        ],
        [
            "Mr. Emanuel was eager last summer to clear the way to this year’s Democratic Senate nomination for Mr. Specter, who had just left the Republican party, and to bolster Democrats’ majority in the Senate.",
            "Mr. Sestak, a retired admiral and two-term House member, was already planning a run."
        ],
        [
            "In tapping Mr. Clinton as the go-between, Mr. Emanuel picked the party’s most prominent figure other than Mr. Obama and someone Mr. Sestak had worked for on the National Security Council in the 1990s.",
            "Mr. Sestak endorsed Hillary Rodham Clinton against Mr. Obama in the 2008 presidential primaries, and Mr. Clinton was one of the first to call to congratulate him on his Senate victory last week."
        ],
        [
            "Mr. Clinton was at the White House on Thursday to have lunch with Mr. Obama and join him in greeting the American men’s World Cup soccer team heading to South Africa."
        ],
        [
            "As chief of staff and previously as chairman of the Democratic Congressional Campaign Committee, Mr. Emanuel has not been shy about trying to steer party nominations to those he considers the stronger candidates.",
            "The White House under Mr. Emanuel has also leaned on Gov. David Paterson of New York to drop out of this year’s gubernatorial race, which he eventually did under a cloud of scandal.",
            "Mr. Emanuel’s deputy, Jim Messina, suggested a possible administration job to Andrew Romanoff to get him to not challenge Sen. Michael Bennet in a Colorado primary, The Denver Post has reported, citing unnamed sources."
        ],
        [
            "Whether that constitutes ordinary political horse-trading or crosses a legal line has been debated in Washington for months.",
            "Democrats and some Republicans have said it is hardly unusual for presidents to offer political appointments to clear the way for allies.",
            "But Republicans have suggested such actions may constitute a crime."
        ],
        [
            "Mr. Issa and all seven Republicans on the Senate Judiciary Committee have asked the Justice Department to appoint a special prosecutor.",
            "The Justice Department wrote Mr. Issa last week that it did not need a special prosecutor to investigate if it chose to do so.",
            "Government officials, who asked not to be identified discussing legal decisions, said that neither the Justice Department nor the Office of Special Counsel, an agency that looks at violations of the Hatch Act governing the political conduct of federal employees, is investigating."
        ],
        [
            "While declining to discuss what happened, Mr. Obama on Thursday said, “I can assure the public that nothing improper took place.”"
        ]
    ]
}
