{
    "title": "White House Asked Bill Clinton To Talk To Joe Sestak About Senate Run",
    "keywords": "sestak senate run,sestak obama job offer,sestak white house job offer,sestak clinton,joe sestak senate run,Sestak White House job,Bill Clinton,joe sestak,video",
    "date": "2010-05-28",
    "uuid": "333aa94a-629a-4025-9af2-40bdc51c5bf1",
    "url": "https://www.huffingtonpost.com/2010/05/28/joe-sestak-bill-clinton-s_n_593299.html",
    "main-entities": ["Joe Sestak", "Obama administration", "Bill Clinton"],
    "word-count": 616,
    "source": "hpo",
    "main-event": "White House Asked Bill Clinton to Urge Sestak to Drop Out of Senate Race",
    "triplet-uuid": "38f7cbb7-5d6a-4c89-bcbd-8e164144172a",
    "body-paragraphs": [
        [
            "Rep. Joe Sestak (D-Penn.) was offered a prominent but uncompensated, advisory position -- in the national security/foreign policy area -- if he declined to enter the Pennsylvania Senate primary race, a source with knowledge of the exchange said during a briefing on Friday morning."
        ],
        [
            "The offer was made by White House Chief of Staff Rahm Emanuel through a prominent intermediary -- former President Bill Clinton -- during the months of June and July of 2009.",
            "The White House initiated the conversation, which occurred over phone.",
            "It would have allowed Sestak to remain in the House of Representatives while advising the president.",
            "The source said it would not be surprising if more than one conversation took place, though there were no other intermediaries involved.",
            "Sestak ultimately rejected the overture and went on to defeat incumbent Sen. Arlen Specter (D-Penn) in the Democratic primary election earlier this month."
        ],
        [
            "\"By virtue of his career in public service, including distinguished military service, Congressman Sestak was viewed to be highly qualified to hold a range of advisory positions in which he could, while holding his House seat, have additional responsibilities of considerable potential interest to him and value to the Executive Branch,\" a memo detailing the administration's findings reads."
        ],
        [
            "The account offered by the source was the most detailed to date from primary sources as to the conversations they had with Sestak regarding his entrance into the Pennsylvania race.",
            "News of the Clinton conversation was first reported by Greg Sargent at The Plum Line.",
            "The source challenged one major aspect of the story line, insisting that the White House never offered Sestak the job of Secretary of the Navy.",
            "The offer for that position was made more than a month before -- on March 26, 2009 -- to Ray Mabus."
        ],
        [
            "Administration officials had spent time and capital recruiting Senator Arlen Specter to switch parties and run for re-election as a Democrat.",
            "Part of that arrangement entailed clearing the field for his nomination.",
            "When Sestak began making overtures that he would run, the White House looked for ways to follow through on its promise.",
            "What resulted were the informal conversation(s)."
        ],
        [
            "Since then, much intrigue has surrounded what conversations actually took place.",
            "Sestak brought the issue to the surface when he alluded to a job offer early in his primary run.",
            "But he refused to provide details, such as who approached him and what position was dangled in front of him.",
            "The White House, when pressed on the matter, had been vague.",
            "Press Secretary Robert Gibbs declined repeated attempts for comment before relaying to reporters that he and White House lawyers had looked into the matter and found it legally permissible."
        ],
        [
            "Behind the scenes, White House Counsel Bob Bauer's office began investigating the matter when stories first surfaced.",
            "The investigation was internal at first with the White House reaching conclusions at least two-and-a-half months ago.",
            "As part of the process, however, Bauer also interviewed representatives for Sestak and Clinton -- in this case Sestak's brother and Doug Brand and Bruce Lindsey respectively.",
            "The congressman and the former president were not contacted for Bauer's investigation."
        ],
        [
            "The source insisted that no laws were broken in the process of offering the position, that the matter hardly rose to the level of political scandal -- suggesting that Republicans on the Hill were hoping to reap political benefits from the saga.",
            "It certainly wasn't historically unique.",
            "As the Huffington Post reported on Thursday, various political historians and ethics lawyers have approached the Sestak news with yawns, noting that quid pro quos and backroom job offers are fairly common in administrations."
        ]
    ]
}
