{
    "title": "White House Asked Bill Clinton to Urge Sestak to Drop Out of Senate Race",
    "keywords": "",
    "date": "2010-05-28",
    "uuid": "9fb5214f-563a-4fc5-b204-fac51cb2ca31",
    "url": "http://www.foxnews.com/politics/2010/05/28/white-house-asked-clinton-urge-sestak-drop-senate-race.html",
    "main-entities": ["Joe Sestak", "Obama administration", "Bill Clinton"],
    "word-count": 684,
    "source": "fox",
    "main-event": "White House Asked Bill Clinton to Urge Sestak to Drop Out of Senate Race",
    "triplet-uuid": "38f7cbb7-5d6a-4c89-bcbd-8e164144172a",
    "body-paragraphs": [
        [
            "The White House asked former President Bill Clinton to talk to Rep. Joe Sestak about the possibility of obtaining a senior position in the Obama administration if he would drop out of the Democratic primary race against establishment-backed Sen. Arlen Specter, the Obama administration said in a report released Friday morning."
        ],
        [
            "But the report, by White House Counsel Robert Bauer, concluded that \"allegations of improper conduct rest on factual errors and lack a basis in the law.\""
        ],
        [
            "Batting down allegations that the White House dangled the secretary of Navy position in front of Sestak, the report said that Sestak was offered executive branch positions on advisory boards that were uncompensated."
        ],
        [
            "One of the jobs Clinton specifically discussed with Sestak was the president's intelligence advisory board.",
            "But a White House official said the plan always was for Sestak to remain in the House, and he couldn't have served in the House and on the president's intelligence advisory board."
        ],
        [
            "The report also described the Clinton conversations as informal and not tied to any precise job offer since, as a former president, Clinton could not guarantee Sestak anything."
        ],
        [
            "Clinton initiated conversations with Sestak at the behest of White House Chief of Staff Rahm Emanuel, who was Clinton's political director when he was president.",
            "As president, Clinton promoted Sestak to vice admiral and made him his director of defense policy.",
            "Sestak was also a loyal and tireless supporter of Hillary Clinton's run for the presidency in 2008."
        ],
        [
            "At hastily arranged news conference Friday afternoon, Sestak said Clinton called him last summer to express concerns over his jumping into the Senate primary, and how his military background could help him leave a mark on the House."
        ],
        [
            "Sestak said he almost interrupted Clinton to tell him Clinton that \"I am going to decide to get into this or not only depending upon what's good for Pennsylvania's working families and not an offer.",
            "And he said 'I knew you'd say that,'\" before the conversation moved on to other subjects."
        ],
        [
            "The White House report disputed any suggestion that there was \"impropriety\" in Clinton's discussion with Sestak over possible alternatives to his Senate candidacy."
        ],
        [
            "\"There have been numerous, reported instances in the past when prior administrations -- both Democratic and Republican, and motivated by the same goals -- discussed alternative paths to service for qualified individuals also considering campaigns for public office,\" the report read.",
            "\"Such discussions are fully consistent with the relevant law and ethical requirements.\""
        ],
        [
            "The report comes one day after President Obama insisted \"nothing improper\" happened with Sestak.",
            "On that same day, Obama had lunch with Clinton."
        ],
        [
            "\"This is punishable by prison.",
            "This is a felony,\" said Rep. Darrell Issa, R-Calif., who has been leading the charge for more details on the allegation."
        ],
        [
            "\"This is about the White House.",
            "This is not about Congressman Sestak,\" Issa said, adding that he wants to know what Clinton was empowered to say.",
            "\"They've answered a question and it begs many more answers,\" he said.",
            "\"We want elections not to be appointments.\""
        ],
        [
            "Sestak's opponent in the general election for the Senate seat, Republican Pat Toomey, questioned why it took so long for this explanation."
        ],
        [
            "\"If this explanation is as innocent as it looks, I sure don't know why it took three months to say so,\" Toomey said in a statement.",
            "\"As I've said many times, this job offer issue is not my focus, and it's not where Pennsylvanians want the focus of the campaign to be.\""
        ],
        [
            "Critics say the Sestak job offer may have violated the part of the U.S. code that says: \"Whoever, directly or indirectly, promises any employment, position, compensation...appointment...provided for or made possible in whole or in part by any Act of Congress...to any person as consideration, favor, or reward for any political activity...or in connection with any primary election ...shall be fined under this title or imprisoned not more than one year, or both.\""
        ]
    ]
}
