{
    "title": "Reid Breaks With Obama Over Proposed Ground Zero Mosque",
    "keywords": "Fox News,Senate Majority Leader,on the record,freedom of religion,Senator Reid,Charles Schumer,Fox News poll,Burton,Ground Zero,Sen Charles Schumer,Reid,World Trade Center,White House,President Obama,First Amendment",
    "date": "2010-08-16",
    "uuid": "bfb98e01-ba5d-4bef-adb7-01415979a4b8",
    "url": "http://www.foxnews.com/politics/2010/08/16/white-house-says-politics-factor-decision-enter-mosque-debate/",
    "main-entities": ["Harry Reid", "Barack Obama"],
    "word-count": 976,
    "source": "fox",
    "main-event": "Republican congressional candidates dispute plans to build mosque near ground zero",
    "triplet-uuid": "45bd61bc-c356-4450-9e3a-cbfc862b09fd",
    "body-paragraphs": [
        [
            "Senate Majority Leader Harry Reid broke with President Obama Monday over the proposed mosque near Ground Zero, saying the controversial Islamic center should be built elsewhere."
        ],
        [
            "Spokesman Jim Manley said in a written statement that Republicans should show their sincerity about sensitivity to Sept. 11 survivors by backing a high-profile bill to grant health benefits to rescue workers, something that stalled in Congress earlier this month."
        ],
        [
            "But at the same time, Manley put Reid on the record for the first time in the hyper-sensitive and volatile mosque debate."
        ],
        [
            "\"The First Amendment protects freedom of religion,\" Manley said.",
            "\"Sen. Reid respects that but thinks that the mosque should be built someplace else.\""
        ],
        [
            "Reid's comments added another high-profile voice to the mosque controversy.",
            "The president first stepped into the fray Friday when he appeared to endorse the Park 51 project during a Ramadan dinner at the White House.",
            "The next day, he clarified that he was merely commenting on fundamental religious freedoms -- not specifically on the \"wisdom\" of the mosque project.",
            "Then White House spokesman Bill Burton said Obama was not \"backing off\" his original remarks."
        ],
        [
            "The prolonged presidential explanation elevated the issue beyond a local dispute and hurled it into the political arena.",
            "Republicans have since both criticized his position and pressured other Democrats to take a stand on the politically sticky issue, one where charges of insensitivity have flown on both sides."
        ],
        [
            "The White House claimed Monday that politics were not at play in Obama's decision to dive into the controversy over a planned mosque near Ground Zero."
        ],
        [
            "Burton said that he \"can't speak to the politics of what the Republicans are doing,\" but the president was not looking to make political hay with his remarks, which he reportedly considered carefully before delivering them at a White House dinner on Friday night."
        ],
        [
            "\"The president didn't do this because of the politics.",
            "He spoke about it because he feels he has an obligation as the president to address this,\" Burton said."
        ],
        [
            "But the issue was quickly feeding fuel to Republicans looking to corner Democrats into taking a position on the issue -- something they were able to avoid before the president spoke up."
        ],
        [
            "Though Reid is on the record, the National Republican Senatorial Committee on Monday targeted Sen. Charles Schumer, D-N.Y., for not speaking out on the issue.",
            "Citing an article that said the normally chatty Schumer would not comment on the mosque remarks, the NRSC said Schumer should weigh in."
        ],
        [
            "\"It's a remarkable commentary on the most camera-friendly senator that he's more than happy to weigh-in on caffeinated malt beverages, but he won't take a public position on the construction of a mosque near Ground Zero,\" NRSC spokesman Brian Walsh said in a written statement."
        ],
        [
            "\"It's time for Chuck Schumer to stand up and be counted -- does he stand with President Obama in support of this mosque or does he stand with the countless 9/11 families who believe its location is inappropriate?\" Walsh asked."
        ],
        [
            "Walsh also suggested Reid would suffer politically from his allegiance to Obama on other issues, despite his stance on the mosque."
        ],
        [
            "\"While it's commendable that Senator Reid now agrees with Republican Sharron Angle that we should respect the wishes of 9/11 families, it's regrettable that he hasn't demonstrated this same independence from President Obama on the critical issues facing America during the last 19 months,\" he said."
        ],
        [
            "Rep. Peter King, R-N.Y., who opposes the mosque project, said Monday that the White House softened Obama's original comments because it probably heard \"pushback\" from other Democrats.",
            "He said Obama was \"clearly\" taking a side on the issue no matter what he claims."
        ],
        [
            "\"Everyone says as far as I know that the Muslim community has the right to build a mosque.",
            "The whole question is whether they should or not,\" he told Fox News.",
            "\"So for the president to raise it in the way he did on Friday was clearly giving the impression that he was endorsing it or supporting it -- or tacitly supporting it.\""
        ],
        [
            "Most Americans think the group planning the mosque and Islamic cultural center has the right to build it, according to a Fox News poll released Friday.",
            "However, the poll showed that 64 percent think it would be wrong to build it, regardless of whether the developers are within their right to do so."
        ],
        [
            "Supporters of the mosque and cultural center in lower Manhattan, including New York City Mayor Michael Bloomberg, say its development should stand as a testament to religious tolerance in America.",
            "They say it would be a mistake to equate Islam as a whole, and its practice in the United States, with Al Qaeda -- and remind critics that Muslims were also killed in the attacks on the World Trade Center."
        ],
        [
            "Burton said Monday that the president weighed in as part of a constitutional discussion."
        ],
        [
            "\"The president thinks that it's his obligation to speak out when ... issues of the Constitution arise.",
            "And so, in this case, he decided to state clearly how he feels about making sure that people are treated equally, that there is a fairness and that our bedrock principles are upheld,\" Burton said."
        ],
        [
            "He added the administration can't control the conversation on cable TV or in newspapers, but the White House has had a \"pretty fulsome conversation\" about it and has addressed it to a \"pretty full extent.\""
        ],
        [
            "\"I think that it's a debate that was had and we've weighed in,\" Burton said."
        ]
    ]
}
