{
    "title": "Reid: Mosque Should Be Built Someplace Else",
    "keywords": "Harry Reid,reid moque,obama mosque,reid opposed mosque,mosque obama",
    "date": "2010-08-16",
    "uuid": "fb62ca48-9a76-4321-b2be-f13ea6c0100b",
    "url": "https://www.huffingtonpost.com/2010/08/16/reid-mosque-should-be-bui_n_683762.html",
    "main-entities": ["Harry Reid", "Barack Obama"],
    "word-count": 259,
    "source": "hpo",
    "main-event": "Republican congressional candidates dispute plans to build mosque near ground zero",
    "triplet-uuid": "45bd61bc-c356-4450-9e3a-cbfc862b09fd",
    "body-paragraphs": [
        [
            "President Barack Obama's endorsement of the \"Ground Zero mosque\" during a speech on Friday night spurred some hope among supporters that a forceful case could be made for both the project's constitutionality and its larger geopolitical impact."
        ],
        [
            "That hope was short-lived.",
            "By Saturday, the president clarified that he was not speaking about the \"wisdom\" of the Islamic cultural center per se, just the right of the group to build the Cordoba House in downtown Manhattan."
        ],
        [
            "And on Monday the highest-ranking Democrat in the Senate officially came out against construction of the mosque in its current location"
        ],
        [
            "\"The First Amendment protects freedom of religion,\" reads a statement from Senate Majority Leader Harry Reid's office (D-Nev.).",
            "\"Senator Reid respects that but thinks that the mosque should be built someplace else.",
            "If the Republicans are being sincere, they would help us pass this long overdue bill to help the first responders whose health and livelihoods have been devastated because of their bravery on 911, rather than continuing to block this much-needed legislation.\""
        ],
        [
            "Combined, Obama's clarification and Reid's opposition represent a double dose of bad news for progressives and even Republicans who believed that a strong case could be made in favor of Cordoba House.",
            "If anything, it's clearer now than it was last week (when Democrats were mostly silent on the matter) how deeply the party just wants this entire issue to go away.",
            "Reid, after all, only issued the above statement after his Republican opponents began hitting him for going silent on the matter."
        ]
    ]
}
