{
    "title": "G.O.P. Seizes on Mosque Issue Ahead of Elections",
    "keywords": "Obama  Barack,Mosques,Boehner  John A,Endorsements,World Trade Center (NYC)",
    "date": "2010-08-14",
    "uuid": "ae5c9925-6003-40b6-bff6-61e8cf269ed4",
    "url": "https://www.nytimes.com/2010/08/17/us/politics/17mosque.html",
    "main-entities": ["Harry Reid", "Barack Obama", "Republicans", "Democrats"],
    "word-count": 300,
    "source": "nyt",
    "main-event": "Republican congressional candidates dispute plans to build mosque near ground zero",
    "triplet-uuid": "45bd61bc-c356-4450-9e3a-cbfc862b09fd",
    "body-paragraphs": [
        [
            "WASHINGTON — Republican Congressional candidates on Monday intensified efforts to inject the divide over construction of an Islamic center near ground zero into the midterm campaigns while the Senate’s top Democrat said he objected to the mosque being built there."
        ],
        [
            "Senator Harry Reid of Nevada, the Senate majority leader and a Democrat facing a difficult re-election fight, said through a spokesman that those who plan to erect the Islamic center should look elsewhere.",
            "That separates Mr. Reid from President Obama’s support of the developers’ right to build the center."
        ],
        [
            "“The First Amendment protects freedom of religion,” said Jim Manley, a top adviser to Mr. Reid.",
            "“Senator Reid respects that but thinks that the mosque should be built someplace else.”"
        ],
        [
            "In a number of releases and statements, Republican House and Senate candidates challenged Democrats like Mr. Reid to make their positions clear on the construction of a mosque and community center about two blocks from the site of the attacks of Sept. 11, 2001, in New York City."
        ],
        [
            "“Ground zero is hallowed ground to Americans,” Elliott Maynard, a Republican trying to unseat Representative Nick J. Rahall II, a Democrat, in West Virginia’s Third District, said in a typical statement.",
            "“Do you think the Muslims would allow a Jewish temple or Christian church to be built in Mecca?”"
        ],
        [
            "Republicans said Mr. Obama’s defense of the right of the developers to pursue the project showed that he was out of touch with average Americans."
        ],
        [
            "“It is very troubling to see President Obama again turning a deaf ear to the thoughts and concerns of a majority of Americans,” said James Renacci, a Republican candidate in Ohio’s 16th District, who said people at a recent public meeting were furious about the mosque proposal."
        ],
        [
            "The remarks were a rare instance in this campaign season when Republicans have strayed from a focus on economic issues in their push for substantial gains in the House and Senate in November.",
            "The intensity of their attacks showed that they do not appear worried about the risk of being seen as intolerant or not supportive of the right to freedom of religion."
        ],
        [
            "Some leading Democrats said it was the president’s role to stand up for constitutional rights in the mosque dispute."
        ],
        [
            "Representative James E. Clyburn, the No. 3 House Democrat, said Monday that “articulating the constitutional principles” on which the country was founded and “calling for tolerance on the part of all of its people” were part of “a presidential act worth exercising.”"
        ],
        [
            "Privately, many Democrats were not pleased that the issue had been thrown into their laps during the summer recess as they believed they had been making inroads by talking about how some Republicans support privatizing Social Security.",
            "But strategists said Democrats could counter the Republican offensive by labeling the mosque dispute as a local issue and saying Democrats remain focused on the economy."
        ],
        [
            "Some also said the White House should not have put lawmakers on the spot in the first place and could have been better prepared for the president’s statement, lining up religious and community leaders to offer support for the right to build the mosque and undermine Republican attacks."
        ],
        [
            "Other Democrats said they did not see the fight resonating strongly outside New York and did not expect it to become a defining campaign issue."
        ],
        [
            "Representative Jerrold Nadler, a Democrat who represents the district that includes ground zero, said he doubted that the fight over the mosque would inflict much damage on fellow Democrats in the November elections."
        ],
        [
            "Mr. Nadler, whose view is that the developers were entitled to build the mosque at the selected location if they choose, said, “Ultimately I suspect that once this simmers down in a few weeks, people will realize that everybody’s liberty is at stake here.”"
        ],
        [
            "The planned community center, perhaps 15 stories tall, would be built in three adjacent buildings two blocks north of ground zero, though one building, owned by Consolidated Edison, has yet to be sold.",
            "The other two are all but vacant now; worship services are already taking place in one of them."
        ],
        [
            "The developer, Sharif el-Gamal, a real estate investor born in New York, has said the center would include meeting rooms, a prayer space, a 500-seat auditorium and a pool.",
            "Two mosques, founded in 1970 and 1985, are already within several blocks of the proposed center.",
            "They are so busy and crowded that a search was begun for more space."
        ],
        [
            "Before Mr. Obama spoke out, leading Republican figures like Newt Gingrich, a former speaker of the House, and Sarah Palin, the party’s 2008 vice-presidential nominee, had been voicing opposition to the Islamic center.",
            "That caused other Republicans to warn that the party risked a backlash and was alienating the nation’s Muslims."
        ],
        [
            "But Mr. Gingrich showed no sign of backing down on Monday.",
            "“Nazis don’t have the right to put up a sign next to the Holocaust Museum in Washington,” Mr. Gingrich said on the Fox News program “Fox and Friends.”",
            "“We would never accept the Japanese putting up a site next to Pearl Harbor.",
            "There’s no reason for us to accept a mosque next to the World Trade Center.”"
        ],
        [
            "Democratic campaign officials accused Republicans of exploiting the Sept. 11 attacks, noting that their outrage over the Islamic center came just weeks after many House Republicans opposed a new medical program to monitor and treat emergency workers and others suffering ill effects from exposure to hazardous materials at ground zero."
        ]
    ]
}
