{
    "source": "hpo",
    "main-entities": [
        "Bob Etheridge"
    ],
    "main-event": "Rep Etheridge attacks student",
    "title": "Bob Etheridge Attacks Student: North Carolina Congressman Gets Rough With Interviewer",
    "url": "https://www.huffingtonpost.com/2010/06/14/bob-etheridge-attacks-stu_n_610978.html",
    "word-count": 680,
    "date": "2010-06-14",
    "uuid": "a5cb6419-2bb9-4af3-8046-96637f050cd9",
    "triplet-uuid": "6b541575-99b1-40d2-8730-9bb868ee38ed",
    "body-paragraphs": [
        [
            "Rep. Bob Etheridge (D-N.C.) appeared unreceptive to the question of an anonymous reporter this weekend, when he grabbed the self-identified “student” after he asked the congressman if he “fully supported the Obama agenda.”"
        ],
        [
            "In the video, the North Carolina lawmaker is seen approaching the camera, while the reporter asks, “Hi, Congressman. How are you?",
            "Do you fully support the Obama agenda?”"
        ],
        [
            "Etheridge appears visibly irritated and immediately asks, “who are you?” before knocking the interviewer’s camera to the ground."
        ],
        [
            "In the next shot, Etheridge grabs the reporter’s wrist and continually asks him to identify himself.",
            "The cameraman replies, “we’re just here for a project...we’re just students.”"
        ],
        [
            "Over at Big Government, a post accompanying the video provides the following commentary on the encounter:"
        ],
        [
            "“Expect more of this.",
            "A hard, progressive left captured the Democrat majority in Congress and forced them to enact a fantasy grab-bag of legislation that is increasingly unpopular with the American public.",
            "We’re on the cusp of a deeper recession, millions of unemployed Americans have no prospect for work, taxes are about to spike higher and we’ve maxed out the national credit card.",
            "The Democrats were given a chance to run government and they’ve only succeeded in running it into the ground.",
            "[...]"
        ],
        [
            "Let’s recap what we saw on this video.",
            "A sitting Congressman-a presumed living extension of James Madison and other founding fathers-was asked on a public street whether he supported the President’s agenda.",
            "His response was to hit away a video camera and assault a student.",
            "The age of Pericles this ain’t."
        ],
        [
            "It is going to be a long, hot summer.",
            "But, you’ve been given a target.",
            "Act accordingly.”"
        ],
        [
            "Mediaite, in a response to the Big Government post, writes about the problems with anonymous inflammatory assault interviews, and argues that it might be this new brand of “journalism” that has Etheridge on edge:"
        ],
        [
            "“Now, Etheridge’s actions are only partially defensible.",
            "He need not have gotten physical with the students who asked him the provocative question regarding his support of the “Obama Agenda” (honestly, that sort of opening question is straight from the Jason Mattera school of inflammatory interview techniques.)"
        ],
        [
            "But little is known about these “students.”",
            "The YouTube video is published under an account titled TonyManization, and even more damning is that the faces of the individuals asking the Congressman questions are blurred out.",
            "Hmmm...nothing like the courage of the anonymous protester."
        ],
        [
            "Which brings us back to Etheridge’s response.",
            "Yeah - he comes off as a jerk, but...when in Rome.",
            "It will be interesting to follow how this story plays out in the news media.",
            "Will it be a big story? Probably not, but apparently being prepared for ambush interviews from eager college kids is the next phase of media training for many on Capitol Hill.”"
        ],
        [
            "UPDATE:"
        ],
        [
            "DNC spokesman Brad Woodhouse addressed the video in a statement Monday:"
        ],
        [
            "“Motives matter, and I think you can see who was behind this,” Woodhouse said.",
            "“This was a Republican party tracking operation.",
            "If it wasn’t a party tracker or intern, why is the face blurred and why is the source hidden?",
            "You know if it had been a right wing blog, they’d identify themselves and they’d be booking this person on TV all day.",
            "Republicans know if they admit their involvement in this game of gotcha it will undermine their credibility.",
            "One minute this guy is interviewing a member of Congress on camera and the next a video is released with his face blurred out?",
            "If that doesn’t tell you this is a Republican Party hatchet job nothing will.”"
        ],
        [
            "UPDATE:"
        ],
        [
            "Rep. Bob Etheridge (D-N.C.) has apologized for his combative behavior over the weekend in a statement released by his office:"
        ],
        [
            "“I deeply and profoundly regret my reaction and I apologize to all involved,” Etheridge said.",
            "“Throughout my many years of service to the people of North Carolina, I have always tried to treat people from all viewpoints with respect.",
            "No matter how intrusive and partisan our politics can become, this does not justify a poor response.",
            "I have and I will always work to promote a civil public discourse.”"
        ]
    ]
}
