{
    "uuid": "44c70e9c-3ff8-49b2-88a3-ce22bba21449",
    "main-event": "Rep Etheridge apologizes for grabbing a young man",
    "main-entities": [
        "Bob Etheridge"
    ],
    "source": "nyt",
    "url": "https://archive.nytimes.com/query.nytimes.com/gst/fullpage-9E03E1D61E3DF936A25755C0A9669D8B63.html",
    "date": "2010-06-15",
    "title": "Etheridge, Caught on Video, Apologizes ",
    "triplet-uuid": "6b541575-99b1-40d2-8730-9bb868ee38ed",
    "body-paragraphs": [
        [
            "Representative Bob Etheridge, Democrat of North Carolina, issued an apology on Monday for grabbing a young man by the hand, arm and neck – as a video camera rolled – as the man tried to ask him whether he supports President Obama’s agenda."
        ],
        [
            "“I deeply and profoundly regret my reaction and I apologize to all involved,” Mr. Etheridge said in a statement. ",
            "“Throughout my many years of service to the people of North Carolina, I have always tried to treat people from all viewpoints with respect. ",
            "No matter how intrusive and partisan our politics can become, this does not justify a poor response.”"
        ],
        [
            "He added, “I have and I will always work to promote a civil public discourse.”"
        ],
        [
            "A young man, dressed in a jacket and tie, approached the congressman on a sidewalk, saying: “Hi, Congressman. How are you? Do you fully support the Obama agenda?”"
        ],
        [
            "Mr. Etheridge, a seven-term House member, can be seen on the video repeatedly asking the young man to identify himself. ",
            "After a few seconds, the congressman grabs the camera and the young man."
        ],
        [
            "“Tell me who you are,” Mr. Etheridge said. “Tell me who you are.”"
        ],
        [
            "The young man is not identified in the video, which was made last week. ",
            "A second person accompanying him pulled out another camera to record the congressman’s actions. ",
            "The video received widespread attention on Monday after it was posted on the Web site of Andrew Breitbart, a conservative Web publisher and former editor of The Drudge Report. ",
            "It was circulated by the National Republican Congressional Committee."
        ],
        [
            "“Bob Etheridge has lost it,” said Jon Thompson, a Republican spokesman. ",
            "“His conduct is unbecoming of a member of Congress.”"
        ],
        [
            "Mr. Etheridge, who represents a conservative district south of Raleigh, faces a re-election challenge, but his race is not among the top Republican targets in the country. ",
            "He won two years ago by 36 percentage points, and Mr. Obama carried his district by 6 percent."
        ],
        [
            "Vice President Joseph R. Biden Jr. resumed the White House campaign for gun control on Tuesday by reporting on executive action taken unilaterally by the administration and pressing Congress to take up legislation again."
        ]
    ]
}
