{
    "uuid": "f462327d-7021-486b-a262-a1d2ffc4bc25",
    "main-event": "Rep Etheridge apologizes for grabbing a young man",
    "main-entities": [
        "Bob Etheridge"
    ],
    "title": "N.C. Congressman Apologizes for Physical Confrontation With Man in Washington",
    "triplet-uuid": "6b541575-99b1-40d2-8730-9bb868ee38ed",
    "source": "fox",
    "url": "https://www.foxnews.com/politics/n-c-congressman-apologizes-for-physical-confrontation-with-man-in-washington",
    "date": "2010-06-14",
    "body-paragraphs": [
        [
            "Three days after an Internet video surfaced showing North Carolina Rep. Bob Etheridge in a physical confrontation with a young man, the lawmaker said he is \"profoundly\" sorry for the tussle on a Washington street."
        ],
        [
            "Etheridge, a Democrat, is seen in an amateur video grabbing the wrist and neck of an unidentified young man after the man approached the congressman and asked if he supported the \"Obama agenda.\""
        ],
        [
            "\"No matter how partisan and no matter how difficult things get sometimes, that's no excuse for my response,\" he added, shortly after releasing a written statement in which he said he \"profoundly\" regrets the incident."
        ],
        [
            "The video, posted to YouTube last Friday, shows the man, who appears to be in his early 20s and who identifies himself as a student, approaching Etheridge on the sidewalk."
        ],
        [
            "Etheridge is then seen trying to snatch a cell phone camera out of the student's hands. He then grabs the man's wrist and refuses to let go."
        ],
        [
            "\"Who are you!\" the seven-term congressman demands.",
            "\"Tell me who you are ... I have a right to know who you are.\""
        ],
        [
            "Another man, not seen on camera, then tells Etheridge, \"We're just here for a project.\""
        ],
        [
            "When the man asks Etheridge to \"please let go of me,\" the congressman then grabs him by the neck."
        ],
        [
            "Etheridge told reporters that he hasn't apologized to the young men involved because \"I dont know who they are.\""
        ],
        [
            "\"I would if I knew who they were,\" he said."
        ],
        [
            "\"I've been spat at, pushed and threatened before but that's no excuse,\" he added, saying that the incident occurred after a \"long day.\""
        ],
        [
            "\"His conduct is unbecoming of a member of Congress.",
            "It's bad enough that he's joined Obama's assault on North Carolina jobs, but his physical assault on a college student goes beyond the pale.\""
        ],
        [
            "Mike Flynn, a conservative blogger for biggovernment.com, wrote that the confrontation occurred last week outside a fundraiser headlined by House Speaker Nancy Pelosi."
        ],
        [
            "The video, which was posted on YouTube by \"DCCameraGuy,\" does not reveal the identity of the men making the tape."
        ],
        [
            "Etheridge, who has represented North Carolina's 2nd Congressional District since 1997, is running for re-election against Republican Renee Ellmers, a registered nurse, in November.",
            "Political observers have predicted that the 68-year-old congressman will likely hold on to his seat."
        ],
        [
            "Etheridge, a member of the House Ways and Means and Budget committees, voted in favor of President Obama's health care overhaul legislation as well as the Democratic climate change bill known by opponents as cap-and-trade.",
            ""
        ]
    ]
}
