{
    "url": "http://www.foxnews.com/politics/2010/02/20/beck-encourages-conservatives",
    "word-count": 288,
    "keywords": "Fox News,Washington,University of Dayton,outspoken critic,presidential nomination,political affiliation,Dayton,News,populist,University,America,keynote speech,Beck,Republican presidential nomination,Ohio",
    "source": "fox",
    "triplet-uuid": "6f95dcb9-e960-45ac-8c0e-91b85724c909",
    "uuid": "40b85964-da38-43b1-82e3-74327c79cb24",
    "date": "2010-02-20",
    "title": "Glenn Beck Rips Progressivism at CPAC",
    "body-paragraphs": [
        [
            "Glenn Beck Rips Progressivism at CPAC"
        ],
        [
            "Fox News host Glenn Beck, armed with his trademark chalkboard, blamed \"progressivism\" for America's problems Saturday in his keynote speech that brought the annual Conservative Political Action Conference to a close."
        ],
        [
            "The chalkboard, a prop that he uses frequently on his top-rated show, brought the audience to its feet.",
            "Beck wrote \"Progressivism\" on it to underscore his belief in what America is suffering from."
        ],
        [
            "When Beck asked what America is suffering from, someone shouted \"President Obama,\" though Beck, an outspoken critic of the president, said it's \"not that simple.\""
        ],
        [
            "Beck rejected the notion that the Republican Party should expand its tent to include progressives."
        ],
        [
            "\"What is this? A circus?\" he said, drawing laughter.",
            "\"America is not a clown show.",
            "America is an idea that sets people free.\""
        ],
        [
            "Opening up about his troubled past, Beck told the crowd, \"People need to understand that life is not fair.",
            "The bad guy sometimes wins.\""
        ],
        [
            "The speech capped three days of panel discussions and high-profile speakers, including numerous politicians mentioned as contenders for the 2012 Republican presidential nomination.",
            "But for a lot of the CPAC attendees, Beck was the reason they came, as he is seen as a leader in the new conservative movement."
        ],
        [
            "The speech comes after a year in which Beck's growing popularity as a Fox News host coincided with the rise of the Tea Party Movement and populist rage directed at Washington.",
            "Beck also launched the 9/12 Project, which sets forth nine values and 12 principles that he believes the country was founded upon.",
            "The project inspired a major march in Washington in September."
        ],
        [
            "\"This is how is America should be,\" said Cynthia Burgiss, 22, a student at the University of Dayton in Ohio who attended the 9/12 march in D.C. this year.",
            "\"People of every race, political affiliation, religion came together for different reasons.\""
        ],
        [
            "She was at CPAC to see Beck and called him a \"relatable ... everyday guy.\""
        ],
        [
            "\"None of this would have happened without Glenn,\" she said."
        ]
    ],
    "main-event": "Glenn Beck speaks at CPAC",
    "main-entities": ["Glenn Beck"]
}
