{
    "source": "hpo",
    "main-entities": ["Glenn Beck"],
    "main-event": "Glenn Beck speaks at CPAC",
    "title": "Glenn Beck CPAC 2010 Speech VIDEO: Republicans Don't Need A Big Tent",
    "url": "https://www.huffingtonpost.com/2010/02/20/glenn-beck-cpac-2010-spee_n_470356.html",
    "word-count": 563,
    "date": "2010-02-20",
    "uuid": "f3d0ebba-4805-4def-b3ac-4359d5937556",
    "triplet-uuid": "6f95dcb9-e960-45ac-8c0e-91b85724c909",
    "body-paragraphs": [
        [
            "Glenn Beck CPAC 2010 Speech VIDEO: Republicans Don't Need A Big Tent"
        ],
        [
            "Bombastic conservative talk show host Glenn Beck closed a three-day conservative conference on Saturday by demanding that Republicans get their own house in order before re-trying their hand at governance."
        ],
        [
            "In a winding speech that touched as much on his personal turmoil as his policies and politics, Beck had the packed auditorium at CPAC captivated from the start.",
            "Using hand gestures, multiple impersonations and his infamous chalkboard, he took the usual swipes at Democrats.",
            "\"Progressivism,\" he declared, \"is eating the Constitution.\"",
            "Moreover, it \"was designed to eat the Constitution.\""
        ],
        [
            "But the nearly hour-long address was spent not bemoaning his ideological foes, but rather demanding purity among his likely allies.",
            "If last year's CPAC keynote speech - delivered by radio host Rush Limbaugh - was defined by urging President Barack Obama to fail, Beck's stood out for his demand that conservatism succeed."
        ],
        [
            "\"Dick Cheney a couple days ago... says it is going to be a good year for conservative ideas,\" he declared at one point, wiping the sweat from his brow.",
            "\"It is going to be a very good year.",
            "But it is not enough just to not suck as much as the other side.\""
        ],
        [
            "And who, exactly, sucked as much as the other side?",
            "Beck didn't really name names - save for a swipe at one Republican (presumably Sen. John McCain) for admiring another Republican, Teddy Roosevelt -- the latter of whom Beck accused of launching the modern progressive movement.",
            "But the message was clear: supporting anything that closely resembled the Democratic agenda would no longer fly with the modern GOP."
        ],
        [
            "\"I have not heard people in the Republican Party admit yet that they have a problem,\" he said.",
            "\"I haven't seen the Come-To-Jesus moment from Republicans yet.\""
        ],
        [
            "\"One party will tax and spend,\" he added at another point.",
            "'One party won't tax and will spend.",
            "It is both of them together.\""
        ],
        [
            "The plea was made all the more effective by the intertwining of Beck's own story of struggle and redemption.",
            "Pointing to his time as a recovering alcoholic, the Fox News host urged the GOP to embark on a 12-step program of recovery.",
            "\"Hello, my name is the Republican Party, and I got a problem.",
            "I'm addicted to spending and big government,\" he declared, reading out the apology he wanted lawmakers to deliver.",
            "Reflecting on his own lack of formal education, he railed against government handouts - extending the logic to argue against a right to health care."
        ],
        [
            "The crowd was enthralled, even as Beck took them down winding tales of Calvin Coolidge, the Statute of Liberty and the supposed great middle class explosion of the 1920s."
        ],
        [
            "But was the message what the conservative movement needed to hear?",
            "Tradition dictates that political parties out of power do what they can to expand their coalition.",
            "Elections, after all, are won when candidates broaden their appeal to the voters responsible for electing them.",
            "For Beck and the surrounding CPAC crowd, however, ideological purity was the path to redemption and recovery."
        ],
        [
            "All we've heard, the Fox News host complained, is \"we need a big tent. We need a big tent. Can we get a bigger tent? How can we get a big tent?",
            "What is this the circus? America is not a clown show. America is not a circus.",
            "America is an idea. America is an idea that sets people free.\""
        ]
    ]
}
