{
    "date": "2010-02-20",
    "body-paragraphs": [
        [
            "Beck Wows the CPAC Crowd"
        ],
        [
            "Glenn Beck, the hero of the political right and the closing speaker of a three-day conservative conference, ripped the roof off a Washington hotel Saturday with a sweeping denunciation of progressivism."
        ],
        [
            "Progressivism, he told the Conservative Political Action Conference, is a cancer that must be cut out of the system."
        ],
        [
            "But he aimed his fire at Republicans as well as Democrats, and gave them little quarter, saying he did not know what the Republicans stood for."
        ],
        [
            "“It’s not enough just to not suck as much as the other side,” he said."
        ],
        [
            "Noting that he was a recovering alcoholic himself, he said that the party had to admit that it had a problem, which he had not heard it do."
        ],
        [
            "“Hello, my name is the Republican Party and I have a problem!” he declared.",
            "“I’m addicted to spending and big government,” he said, drawing cheers and applause from the thousands of people packed into the hotel ballroom."
        ],
        [
            "But both parties are to blame, he said.",
            "The Democrats tax and spend, while the Republicans just spend."
        ],
        [
            "People are losing a fundamental belief that things will get better, he said."
        ],
        [
            "“It is still morning in America,” he posited, “it just happens to be kind of a head-pounding, hung-over, vomiting-for-four-hours kind of morning in America.",
            "And it’s shaping up to be kind of a nasty day, but it’s still morning in America.”"
        ],
        [
            "When the audience finished laughing, he asked: “What made us sit there at the john making us vomit for four hours?",
            "What are we suffering from?”"
        ],
        [
            "Saying President Obama, he said, was “too simple an answer.”"
        ],
        [
            "The real problem, he said, is progressivism, scrawling the word with chalk on his signature blackboard. “This is the disease in America,” he said."
        ],
        [
            "He held the audience spellbound with riffs on his personal life laced through his political philosophy, strong on personal responsibility."
        ],
        [
            "“Who can guarantee you happiness?“ he asked. “Tiger Woods wasn’t happy.”"
        ],
        [
            "If you find financial success on the road to happiness, he said, conservatives believe “you shouldn’t be demonized or penalized by it.”"
        ],
        [
            "“I’m not going to pay for your mistakes and I don’t expect you to pay for my mistakes,” he said, to wild applause."
        ]
    ],
    "triplet-uuid": "6f95dcb9-e960-45ac-8c0e-91b85724c909",
    "source": "nyt",
    "uuid": "17a9d9cb-727d-4173-b829-ceded51002e5",
    "title": "Beck Wows the CPAC Crowd",
    "keywords": "The Caucus,_featured",
    "url": "https://thecaucus.blogs.nytimes.com/2010/02/20/beck-wows-the-cpac-crowd/",
    "word-count": 314,
    "main-event": "Glenn Beck speaks at CPAC",
    "main-entities": ["Glenn Beck"]
}
