{
    "triplet-uuid": "74708dbf-5dfc-4c66-8419-d7dbc00e4a06",
    "date": "2010-12-12",
    "body-paragraphs": [
        [
            "Republican National Committee Chairman Michael Steele will speak with RNC members Monday evening in which he is expected to announce a decision about whether to make another run for the party chairmanship.",
            "A handful of well-placed and influential RNC insiders tell Fox News they expect Steele to announce he is not running for re-election."
        ],
        [
            "But Steele has been unpredictable, especially over recent weeks, and some close to the GOP chairman say he wants to run for another term and is struggling to find enough support for a second term."
        ],
        [
            "Fox News confirmed Steele sent an e-mail to committee members Saturday night with the subject line, \"conference call.\""
        ],
        [
            "In the note, he asked members to join him \"for a private conference call\" Monday evening."
        ],
        [
            "Republicans picked up 63 seats in the House, narrowed the gap in the Senate and picked up 19 state legislative bodies in the November midtem election, but pressure has been mounting all year for Steele to step down from the position."
        ],
        [
            "Critics have described the chairman as gaffe-prone and said he hasn't raised enough money.",
            "The criticism has resulted in an array of challenges or potential challenges for Steele's job from Wisconsin Republican Party Chairman Reince Priebus, former RNC Co-Chairwoman Ann Wagner, longtime Republican official Maria Cino, former Michigan Republican Party Chairman Saul Anuzis and former RNC Political Director Gentry Collins."
        ],
        [
            "The fierce competition will end next month with the selection of a chairman for the 2012 election cycle."
        ]
    ],
    "title": "RNC Chairman Steele to Announce Intentions on a Second Term",
    "keywords": "",
    "word-count": 252,
    "main-event": "Michael Steele about to announce whether he'll run again for RNC chairman",
    "source": "fox",
    "url": "http://www.foxnews.com/politics/2010/12/12/rnc-chairman-michael-steele-expected-resign.html",
    "uuid": "9913f8f7-a5eb-4c8b-b0e2-278ad440e4ca",
    "main-entities": ["Michael Steele"]
}
