{
    "triplet-uuid": "74708dbf-5dfc-4c66-8419-d7dbc00e4a06",
    "date": "2010-12-12",
    "body-paragraphs": [
        [
            "The battle for control of the Republican National Committee will take a new turn on Monday when Michael Steele announces whether he plans to step down as party chairman or will disregard the onslaught of criticism about his oversight of the committee and seek a second term."
        ],
        [
            "Mr. Steele is expected to disclose his intentions during a conference call with committee members on Monday evening.",
            "Mr. Steele has lost the backing of many top supporters, but he has not yet said whether he will try to rebuild his frayed coalition and fight for the chance to lead the party into the 2012 election cycle."
        ],
        [
            "Mr. Steele’s tenure has been one of the few blemishes this year for the Republican Party, which scored historic victories in the midterm elections.",
            "At least six top Republicans have already taken steps to run for party chairman and several members have withdrawn their support for Mr. Steele, leading many party leaders to conclude that Mr. Steele will not seek reelection."
        ],
        [
            "But Mr. Steele has kept close counsel about his future, Republican officials said Sunday, and his plans were unknown even to several of his own advisers.",
            "A spokesman for the R.N.C. did not respond to inquiries about the conference call, which Mr. Steele announced personally in a weekend e-mail message to fellow Republicans."
        ],
        [
            "“Dear Members, Please join me for a private conference call,” Mr. Steele wrote in a message to Republicans, which was provided to the New York Times by a committee member.",
            "“Thank you and I look forward to talking to you Monday evening.”"
        ],
        [
            "A coordinated effort to replace Mr. Steele has been underway for weeks, with several leading Republicans arguing that the committee needed to urgently improve its fund-raising practices and tighten its organizational structure to prepare for the presidential election.",
            "The political director of the committee resigned in protest last month and is among those vying for the job."
        ],
        [
            "Mr. Steele, a former lieutenant governor of Maryland, was elected in January 2009 to lead Republicans at a bleak moment.",
            "He has argued that he deserves credit for building the party in all corners of the country and winning control of the House of Representatives last month."
        ],
        [
            "The contenders for the position include: Reince Preibus, chairman of the Wisconsin Republican Party; Ann Wagner of Missouri, an ambassador to Luxembourg in the Bush administration; Maria Cino, a veteran Republican operative who has the support of former Vice President Dick Cheney; Saul Anuzis, former Republican chairman in Michigan; and Gentry Collins, who resigned last month as political director.",
            "A former party chairman, Mike Duncan, also is considering a run."
        ],
        [
            "The 168-member committee will elect a chairman during its meeting in January."
        ]
    ],
    "title": "Steele to Announce Decision on R.N.C. Run",
    "keywords": "",
    "word-count": 555,
    "main-event": "Michael Steele about to announce whether he'll run again for RNC chairman",
    "source": "nyt",
    "url": "http://thecaucus.blogs.nytimes.com/2010/12/12/steele-to-announce-decision-on-r-n-c-run/",
    "uuid": "9495dca7-8ae6-48c3-adf9-eb2df4901f0e",
    "main-entities": ["Michael Steele"]
}
