{
    "triplet-uuid": "74708dbf-5dfc-4c66-8419-d7dbc00e4a06",
    "date": "2010-12-13",
    "body-paragraphs": [
        [
            "RNC Chairman Michael Steele is expected by some to announce that he will not seek a second term as the head of the Republican National Committee, according to multiple reports."
        ],
        [
            "Politico reported over the weekend that many of his supporters as well as other GOP operatives believe that a Steele run was looking increasingly doubtful, due in part to the fact that he \"has built no known reelection team or structure, making the prospect of a campaign unlikely in the face of competition that grows fiercer by the day.\""
        ],
        [
            "Meanwhile, multiple sources tell Fox News that they believe Steele will drop out of the race."
        ],
        [
            "And while many predict that Steele will call it quits after his current term, his increasing seclusion and detachment from other Republican advisers has made his forthcoming decision difficult to ascertain.",
            "At least one GOP insider who had direct contact with Steele told the Washington Post that the chairman would indeed be seeking another term atop the RNC."
        ],
        [
            "Hotline On Call says the nature of the decision is a \"closely guarded secret\" and reports that \"even his top advisors, both inside and outside the committee, say they don't know which direction he will take.\""
        ],
        [
            "Steele's gaffe-prone tenure at the helm of the RNC has aided the creation of a significant bloc of GOPers who are intent on seeing his departure next month.",
            "While some, such as black conservative group BOND Action, have directly announced their intentions to work toward insuring Steele's termination at the committee, other Republicans have simply lined up behind his growing list of challengers."
        ],
        [
            "Maria Cino, a former Bush official who recently received key backing from former RNC Chairman Ed Gillespie and former Vice President Dick Cheney, became the latest official contender this weekend."
        ],
        [
            "Wisconsin GOP Chairman Reince Preibus, recently resigned RNC political director Gentry Collins, former U.S. ambassador Ann Wagner and former Michigan GOP chairman Saul Anuzis also round out the list.",
            "Politico also reports that former Senator Norm Coleman could enter the race if Steele decides not to run."
        ]
    ],
    "title": "Michael Steele's End Could Be Near",
    "keywords": "rnc chairman,michael steele rnc chairman,michael steele rnc,rnc,steele,michael steele,rnc race,rnc chair",
    "word-count": 351,
    "main-event": "Michael Steele about to announce whether he'll run again for RNC chairman",
    "source": "hpo",
    "url": "http://www.huffingtonpost.com/2010/12/13/michael-steele-rnc-reelection_n_795723.html",
    "uuid": "a782d93c-cb4a-4096-873d-716791eedf2a",
    "main-entities": ["Michael Steele"]
}
