{
    "title": "Richard Blumenthal's Words on Vietnam Service Differ From History",
    "keywords": "Elections,Vietnam War,Veterans,Draft and Recruitment (Military),Nineteen Hundred Sixties,United States Politics and Government,United States Defense and Military Forces,Attorneys General,Blumenthal  Richard,United States Marine Corps,Connecticut",
    "date": "2010-05-17",
    "uuid": "bf45994d-2159-4c28-9d63-ff12c5337bf5",
    "url": "http://www.nytimes.com/2010/05/18/nyregion/18blumenthal.html?hp&_r=0",
    "main-entities": ["Richard Blumenthal"],
    "word-count": 888,
    "source": "nyt",
    "main-event": "Richard Blumenthal lies about serving in Vietnam war",
    "triplet-uuid": "85475456-f38e-4c30-895d-ca2c819c6af1",
    "body-paragraphs": [
        [
            "At a ceremony honoring veterans and senior citizens who sent presents to soldiers overseas, Attorney General Richard Blumenthal of Connecticut rose and spoke of an earlier time in his life."
        ],
        [
            "“We have learned something important since the days that I served in Vietnam,” Mr. Blumenthal said to the group gathered in Norwalk in March 2008.",
            "“And you exemplify it.",
            "Whatever we think about the war, whatever we call it — Afghanistan or Iraq — we owe our military men and women unconditional support.”"
        ],
        [
            "There was one problem: Mr. Blumenthal, a Democrat now running for the United States Senate, never served in Vietnam.",
            "He obtained at least five military deferments from 1965 to 1970 and took repeated steps that enabled him to avoid going to war, according to records."
        ],
        [
            "The deferments allowed Mr. Blumenthal to complete his studies at Harvard; pursue a graduate fellowship in England; serve as a special assistant to The Washington Post’s publisher, Katharine Graham; and ultimately take a job in the Nixon White House."
        ],
        [
            "In 1970, with his last deferment in jeopardy, he landed a coveted spot in the Marine Reserve, which virtually guaranteed that he would not be sent to Vietnam.",
            "He joined a unit in Washington that conducted drills and other exercises and focused on local projects, like fixing a campground and organizing a Toys for Tots drive."
        ],
        [
            "Many politicians have faced questions over their decisions during the Vietnam War, and Mr. Blumenthal, who is seeking the seat being vacated by Senator Christopher J. Dodd, is not alone in staying out of the war."
        ],
        [
            "But what is striking about Mr. Blumenthal’s record is the contrast between the many steps he took that allowed him to avoid Vietnam, and the misleading way he often speaks about that period of his life now, especially when he is speaking at veterans’ ceremonies or other patriotic events."
        ],
        [
            "Sometimes his remarks have been plainly untrue, as in his speech to the group in Norwalk.",
            "At other times, he has used more ambiguous language, but the impression left on audiences can be similar."
        ],
        [
            "In an interview on Monday, the attorney general said that he had misspoken about his service during the Norwalk event and might have misspoken on other occasions.",
            "“My intention has always been to be completely clear and accurate and straightforward, out of respect to the veterans who served in Vietnam,” he said."
        ],
        [
            "But an examination of his remarks at the ceremonies shows that he does not volunteer that his service never took him overseas.",
            "And he describes the hostile reaction directed at veterans coming back from Vietnam, intimating that he was among them."
        ],
        [
            "In 2003, he addressed a rally in Bridgeport, where about 100 military families gathered to express support for American troops overseas.",
            "“When we returned, we saw nothing like this,” Mr. Blumenthal said.",
            "“Let us do better by this generation of men and women.”"
        ],
        [
            "At a 2008 ceremony in front of the Veterans War Memorial Building in Shelton, he praised the audience for paying tribute to troops fighting abroad, noting that America had not always done so."
        ],
        [
            "“I served during the Vietnam era,” he said.",
            "“I remember the taunts, the insults, sometimes even physical abuse.”"
        ],
        [
            "Mr. Blumenthal, 64, is known as a brilliant lawyer who likes to argue cases in court and uses language with power and precision.",
            "He is also savvy about the news media and attentive to how he is portrayed in the press."
        ],
        [
            "But the way he speaks about his military service has led to confusion and frequent mischaracterizations of his biography in his home state newspapers.",
            "In at least eight newspaper articles published in Connecticut from 2003 to 2009, he is described as having served in Vietnam."
        ],
        [
            "The New Haven Register on July 20, 2006, described him as “a veteran of the Vietnam War,” and on April 6, 2007, said that the attorney general had “served in the Marines in Vietnam.”",
            "On May 26, 2009, The Connecticut Post, a Bridgeport newspaper that is the state’s third-largest daily, described Mr. Blumenthal as “a Vietnam veteran.”",
            "The Shelton Weekly reported on May 23, 2008, that Mr. Blumenthal “was met with applause when he spoke about his experience as a Marine sergeant in Vietnam.”"
        ],
        [
            "And the idea that he served in Vietnam has become such an accepted part of his public biography that when a national outlet, Slate magazine, produced a profile of Mr. Blumenthal in 2000, it said he had “enlisted in the Marines rather than duck the Vietnam draft.”"
        ],
        [
            "It does not appear that Mr. Blumenthal ever sought to correct those mistakes."
        ],
        [
            "In the interview, he said he was not certain whether he had seen the stories or whether any steps had been taken to point out the inaccuracies."
        ],
        [
            "“I don’t know if we tried to do so or not,” he said.",
            "He added that he “can’t possibly know what is reported in all” the articles that are written about him, given the large number of appearances he makes at military-style events."
        ],
        [
            "He said he had tried to stick to a consistent way of describing his military experience: that he served as a member of the United State Marine Corps Reserve during the Vietnam era."
        ],
        [
            "Asked about the Bridgeport rally, when he told the crowd, “When we returned, we saw nothing like this,” Mr. Blumenthal said he did not recall the event."
        ]
    ]
}
