{
    "title": "While Blumenthal Retains Washington Support, Republicans Smell Opening in CT",
    "keywords": "",
    "date": "2010-05-18",
    "uuid": "8a841e62-6284-49a9-a2ed-931b603750f1",
    "url": "http://www.foxnews.com/politics/2010/05/18/while-blumenthal-retains-washington-support-republicans-smell-opening-in-ct.html",
    "main-entities": ["Richard Blumenthal"],
    "word-count": 366,
    "source": "fox",
    "main-event": "Richard Blumenthal lies about serving in Vietnam war",
    "triplet-uuid": "85475456-f38e-4c30-895d-ca2c819c6af1",
    "body-paragraphs": [
        [
            "Democratic Attorney General Richard Blumenthal, once thought to be a shoo-in for the seat being vacated by Sen. Chris Dodd, D-CT, finds himself on the political ropes after a newspaper exposed a past incorrect statement regarding his service in Vietnam, and Republicans smell an opening."
        ],
        [
            "Sen. John Cornyn, R-TX, who heads the GOP campaign committee, said Tuesday, \"I think it's a blockbuster revelation,\" and predicted, \"I think it's definitely going to make that race more competitive.\""
        ],
        [
            "Blumenthal's campaign disputed a report in the New York Times as an \"outrageous distortion\" of his service in the Marines - six months on Paris Island and six years in the reserves, according to his campaign.",
            "The A.G., according to the Times, said he had misspoken at a 2008 event in Norfolk in which he said he had served in Vietnam."
        ],
        [
            "At that March 2 event, which can be found here on You Tube, Blumenthal, advocating for troops returning from war, clearly says, \"We have learned something very important since the days that I served in Vietnam...",
            "whatever we think about the war, whatever we call it 'Afghanistan or Iraq, we owe our military men and women unconditional support.\""
        ],
        [
            "Cornyn's Democratic campaign counterpart, Sen. Bob Menendez, D-NJ, Tuesday offered a critical vote of confidence in the attorney general, saying his lifetime of support for veterans is what really matters."
        ],
        [
            "\"I think he's corrected the record in the past.",
            "I think his actions standing up for veterans for a long time speaks volumes,\" Menendez said, \"I'm sure he will continue to stay in the race...and we'll continue to support him.\""
        ],
        [
            "Dodd, who faced an onslaught of criticism for his involvement with now-defunct Countrywide mortgage broker, among other problems, quickly scuttled his re-election plans in order to make way for the exceedingly popular Blumenthal, when it was clear in polls that Dodd was not likely to win his race."
        ],
        [
            "Blumenthal will face the winner of the GOP primary on August 10 - either former Cong. Rob Simmons, himself a Vietnam vet, or former WWE wrestling executive Linda McMahon."
        ],
        [
            "The attorney general is scheduled to appear at a news conference later today with veterans at the Veterans of Foreign Wars post in West Hartford."
        ]
    ]
}
