{
    "title": "Richard Blumenthal Calls NYT Report 'Outrageous Distortion'",
    "keywords": "Politics News,Richard Blumenthal Senate,Connecticut senate 2010,Connecticut Senate Race,Richard Blumenthal,Richard Blumenthal Vietnam,Connecticut Attorney General Richard Blumenthal,2010 elections,blumenthal vietnam,richard blumenthal campaign,elections 2010,video",
    "date": "2010-05-18",
    "uuid": "b724c385-6954-43da-a0cc-95ae8a11628d",
    "url": "https://www.huffingtonpost.com/2010/05/17/richard-blumenthal-vietnam_n_579656.html",
    "main-entities": ["Richard Blumenthal"],
    "word-count": 648,
    "source": "hpo",
    "main-event": "Richard Blumenthal lies about serving in Vietnam war",
    "triplet-uuid": "85475456-f38e-4c30-895d-ca2c819c6af1",
    "body-paragraphs": [
        [
            "HARTFORD, Conn. — Connecticut Attorney General and U.S. Senate candidate Richard Blumenthal is defending himself against a report he misstated his military service in Vietnam."
        ],
        [
            "Blumenthal's campaign called a New York Times report which includes video of him at a 2008 event saying he had served \"in Vietnam\" an \"outrageous distortion\" on his record."
        ],
        [
            "Here's an excerpt from the Times report:"
        ],
        [
            "\"\"We have learned something important since the days that I served in Vietnam,\" Mr. Blumenthal said to the group gathered in Norwalk in March 2008.",
            "\"And you exemplify it.",
            "Whatever we think about the war, whatever we call it -- Afghanistan or Iraq -- we owe our military men and women unconditional support.\""
        ],
        [
            "There was one problem: Mr. Blumenthal, a Democrat now running for the United States Senate, never served in Vietnam.",
            "He obtained at least five military deferments from 1965 to 1970 and took repeated steps that enabled him to avoid going to war, according to records.\""
        ],
        [
            "Blumenthal says he's always tried to make it clear his Marine Reserve service never took him overseas.",
            "But, the Times reported, \"an examination of his remarks at the ceremonies shows that he does not volunteer that his service never took him overseas.",
            "And he describes the hostile reaction directed at veterans coming back from Vietnam, intimating that he was among them.\""
        ],
        [
            "Blumenthal told the Times he had misspoken at the 2008 event in Norfolk in which he said he served in Vietnam."
        ],
        [
            "In a televised March debate, Blumenthal stated clearly he had not served in Vietnam."
        ],
        [
            "Blumenthal's campaign said he planned an event Tuesday with veterans showing their support for him."
        ],
        [
            "Kevin Rennie, a former Republican state lawmaker, published a blog post stating that the Times piece was \"fed to the paper by the Linda McMahon [Senate] campaign.\"",
            "McMahon, the CEO of World Wrestling Entertainment, is one of the Republican Senate candidates running to face Blumenthal in November."
        ],
        [
            "Rennie wrote:",
            "\"The Blumenthal Bombshell comes at the end of more than 2 months of deep, persistent research by Republican Linda McMahon's Senate campaign.",
            "It gave the explosive Norwalk video recording to The Times.",
            "This is what comes of $16 million, a crack opposition research operation and an opponent who, in the words of the president Blumenthal worked for on a draft deferment, who gave them the sword.\""
        ],
        [
            "Rennie's article was initially re-posted on Linda McMahon's website, but the story has since been removed."
        ],
        [
            "On Tuesday morning, a set of response points were circulated by Democrats close to Blumenthal's campaign:"
        ],
        [
            "-Here are the facts: unlike many of his peers, Dick Blumenthal voluntarily joined the Marine Corps Reserves in 1970 and served for six months in Parris Island, SC and six years in the reserves.",
            "He received no special treatment from anyone.",
            "Today's story unfortunately distorts Dick Blumenthal's record of service by implying that he did not serve."
        ],
        [
            "-In the past twenty years, Dick has attended literally hundreds of vets events, debates, news conferences where he was clear, honest, and proud about his service in the Marine Corps Reserve.",
            "In fact, as recently as the US Senate debate on March 1, 2010, Blumenthal clearly stated \"serving in the United States military gave me a perspective as well, even in the reserves.",
            "Although I did not serve in Vietnam, I have seen first-hand the affects of military action, and no one wants it to be the first resort, nor do we want to mortgage the countries future....\""
        ],
        [
            "-Dick has been a constant champion of veterans and of the military.",
            "Today Connecticut veterans will come together to show they have his back, just like he has had theirs."
        ],
        [
            "-On a few occasions out of hundreds, Dick misspoke and he'll be the first to admit that those were mistakes.",
            "That doesn't take anything away from Dick's service or his long record of standing up for veterans - he is known throughout the state as a strong advocate for vets services and benefits."
        ],
        [
            "-His opponent's campaign admits they are the ones who cherry-picked the quotes and are behind the hit piece.",
            "It is no surprise Linda McMahon would want to smear the Attorney General, considering all of the debauchery at the WWF under her watch, including her attempt to interfere with an investigation into widespread drug abuse."
        ],
        [
            "UPDATE: Richard Blumenthal defended himself against charges that he repeatedly made misleading comments about his military service during a press conference on Tuesday afternoon. Details here."
        ]
    ]
}
