{
    "triplet-uuid": "97b1305c-13ca-4b74-a56a-f459bd79dfaf",
    "date": "2010-07-13",
    "body-paragraphs": [
        [
            "KANSAS CITY, Mo. — Leaders of the country's largest civil rights organization accused tea party activists on Tuesday of tolerating bigotry and approved a resolution condemning racism within the political movement."
        ],
        [
            "The resolution was adopted during the annual convention in Kansas City of the National Association for the Advancement of Colored People, spokesman Chris Fleming said.",
            "Tea party organizers disputed claims of racism and called on the NAACP to withdraw the resolution."
        ],
        [
            "Debate was mostly closed to the public, but the final version \"calls on the tea party and all people of good will to repudiate the racist element and activities within the tea party,\" said Hilary Shelton, director of the NAACP's Washington bureau."
        ],
        [
            "\"I hope it will empower the tea party to actually look at itself and see that there are those who are noticing things that I think most tea partiers don't want,\" he said."
        ],
        [
            "Sarah Palin, a vocal tea party supporter, said in a statement late Tuesday that she was \"saddened by the NAACP's claim that patriotic Americans ... are somehow 'racists.'\"",
            "The former Alaska governor said claims that tea party activists \"judge people by the color of their skin\" were false and appalling."
        ],
        [
            "The final wording won't be released until the NAACP's national board of directors approves the resolution during its meeting in October.",
            "But the original called for the NAACP to \"educate its membership and the community that this movement is not just about higher taxes and limited government.\"",
            "It said something could evolve \"and become more dangerous for that small percentage of people that really think our country has been taken away from them.\""
        ],
        [
            "\"We felt the time had come to stand up and say, 'It's time for the tea party to be responsible members of this democracy and make sure they don't tolerate bigots or bigotry among their members,'\" NAACP President Ben Jealous said ahead of the debate."
        ],
        [
            "\"We don't have a problem with the tea party's existence.",
            "We have an issue with their acceptance and welcoming of white supremacists into their organizations,\" he said."
        ],
        [
            "Tea party activist Alex Poulter, who co-founded a Kansas City-area group called Political Chips, also disputed the allegations.",
            "He said the movement is made up of a \"diverse group of folks who are upset with what is going on with this country.\""
        ],
        [
            "Poulter said he has seen no evidence of racism within the movement."
        ],
        [
            "\"It's unfounded, but people are running with these accusations like they are true,\" he said."
        ],
        [
            "A group called the St. Louis Tea Party issued its own resolution Tuesday calling on the NAACP to withdraw the proposal."
        ],
        [
            "Though not affiliated with either major political party, tea party activists espouse a political philosophy of less government, a free market, lower taxes, individual rights and political activism."
        ],
        [
            "The group has faced occasional claims of racism, most notably in March near the end of the bitter health care debate.",
            "U.S. Reps. John Lewis, Andre Carson and Emanuel Cleaver said some demonstrators, many of them tea party activists, yelled a racial epithet as the black congressmen walked from House office buildings to the Capitol.",
            "Cleaver, D-Mo., also said he was spit on."
        ],
        [
            "A white lawmaker said he also heard the epithets, but conservative activists said the lawmakers were lying."
        ],
        [
            "\"They are pulling people together and focusing on the negative, and then it's hard to make anything positive out of that,\" said Anita L. Russell, president of the Kansas City, Mo., branch of the NAACP, which introduced the resolution.",
            "\"And then these groups, these extremist groups, are looking for something, and they are latching on to this.\""
        ]
    ],
    "title": "NAACP Condemns Tea Party Racism In Resolution",
    "keywords": "naacp, condemns, tea, party, racism, in, resolution, politics",
    "word-count": 600,
    "main-event": "N.A.A.C.P. Challenges Tea Party on Racism",
    "source": "hpo",
    "url": "http://www.huffingtonpost.com/2010/07/13/naacp-tea-party-racism-re_n_644832.html",
    "uuid": "8824d4fb-3b21-4f43-910a-b4399866db9f",
    "main-entities": ["NAACP", "Tea Party"]
}
