{
    "triplet-uuid": "97b1305c-13ca-4b74-a56a-f459bd79dfaf",
    "date": "2010-07-13",
    "body-paragraphs": [
        [
            "One of the nation’s largest and oldest civil rights groups passed a resolution Tuesday calling for Tea Party groups to weed “racist elements” out of their ranks."
        ],
        [
            "Delegates at the annual convention of the National Association for the Advancement of Colored People approved the measure Tuesday in Kansas City."
        ],
        [
            "Benjamin Todd Jealous, the president of the N.A.A.C.P., said the resolution was not an attempt to label the entire Tea Party movement as racist.",
            "But he said the groups needed to do more to distance themselves from known hate groups that actively encourage their members to join the Tea Party."
        ],
        [
            "“To this point, we have avoided calling them out and demanding them to be responsible,” Mr. Jealous said.",
            "“Now we’re saying that with increased public attention, increased power, comes the responsibility to act responsibly.”"
        ],
        [
            "He added: “Knowing that the consequence of silence is violence in these times, we’re saying stand up and say enough is enough.",
            "They need to make clear that there is no place for the bigots in the Tea Party movement.”"
        ],
        [
            "The resolution did not go over well with Tea Party groups and their supporters."
        ],
        [
            "Sarah Palin, the 2008 Republican vice presidential nominee, weighed in to defend the Tea Party movement on Monday when the resolution was proposed.",
            "On Fox News’ “Hannity,” she called on the Obamas to rebuke the N.A.A.C.P. and “set the record the straight.”"
        ],
        [
            "The St. Louis Tea Party Coalition issued its own resolution against the N.A.A.C.P., accusing the civil rights body of acting as a “partisan political attack dog” and calling on the Internal Revenue Service to review the group’s tax-exempt status."
        ],
        [
            "The Tea Party movement has been beset with allegations of racism since black members of Congress preparing to vote on health care legislation accused protesters of hurling racial epithets, and in one instance, spitting on a congressman."
        ],
        [
            "Tea Party groups say there is no racism within the movement."
        ]
    ],
    "title": "N.A.A.C.P. Challenges Tea Party on Racism",
    "keywords": "",
    "word-count": 413,
    "main-event": "N.A.A.C.P. Challenges Tea Party on Racism",
    "source": "nyt",
    "url": "http://thecaucus.blogs.nytimes.com/2010/07/13/n-a-a-c-p-challenges-tea-party-on-racism/",
    "uuid": "5e64563a-b779-4c45-973e-949f78acef0a",
    "main-entities": ["NAACP", "Tea Party"]
}
