{
    "triplet-uuid": "97b1305c-13ca-4b74-a56a-f459bd79dfaf",
    "date": "2010-07-14",
    "body-paragraphs": [
        [
            "The NAACP adopted a resolution Tuesday condemning \"racist elements\" in the Tea Party movement and calling on the movement's leaders to repudiate bigotry, despite claims from Tea Partiers that the measure is just a political ploy."
        ],
        [
            "The nation's leading civil rights group took up the language at its annual convention in Kansas City, Mo.",
            "The resolution initially said the NAACP would \"repudiate the racism of the Tea Parties\" and stand against the movement's attempt to \"push our country back to the pre-civil rights era,\" though the wording was amended to downplay criticism of all Tea Partiers while asking them to repudiate bigots in their own ranks."
        ],
        [
            "\"We take no issue with the Tea Party movement.",
            "We believe in freedom of assembly and people raising their voices in a democracy,\" the NAACP President Benjamin Todd Jealous said in a written statement announcing the unanimous vote.",
            "\"What we take issue with is the Tea Party's continued tolerance for bigotry and bigoted statements."
        ],
        [
            "\"The time has come for them to accept the responsibility that comes with influence and make clear there is no place for racism and anti-Semitism, homophobia and other forms of bigotry in their movement.\""
        ],
        [
            "NAACP leaders have referenced an incident in March when Tea Party protesters allegedly hurled racial epithets at black lawmakers on Capitol Hill ahead of a health care vote."
        ],
        [
            "But Tea Party members have challenged claims that their activists accosted black lawmakers in March and no visual evidence has been produced depicting a racist attack.",
            "Dallas Tea Party founder Phillip Dennis said \"there was no proof\" of racist behavior at the event and that the movement welcomes minority members."
        ],
        [
            "\"We don't care about the pigment of one's skin,\" he said.",
            "Dennis accused the NAACP of playing the \"race card\" and called the organization \"irrelevant.\""
        ],
        [
            "The nearby St. Louis Tea Party had an all-hands-on-deck response to the NAACP's plan.",
            "The group has drafted a resolution of its own condemning the civil rights group for reducing itself to a \"bigoted\" and \"partisan attack dog organization.\""
        ],
        [
            "Debate was mostly closed to the public, but the final version \"calls on the tea party and all people of good will to repudiate the racist element and activities within the tea party,\" said Hilary Shelton, director of the NAACP's Washington bureau."
        ],
        [
            "The final wording won't be released until the NAACP's national board of directors approves the resolution during its meeting in October.",
            "But the original called for the NAACP to \"educate its membership and the community that this movement is not just about higher taxes and limited government.\"",
            "It said something could evolve \"and become more dangerous for that small percentage of people that really think our country has been taken away from them.\""
        ],
        [
            "In a matter of hours, the St. Louis group fired off to the NAACP the statement demanding the organization withdraw its \"bigoted, false and inflammatory\" resolution.",
            "The missive accused the NAACP of resorting to political tactics and urged the IRS to reconsider whether it can continue to qualify for tax-exempt status."
        ],
        [
            "Tea Party organizers routinely defend themselves against charges of racism, disavowing racially charged signs that appear in their protest crowds and provide fodder for Tea Party critics.",
            "The NAACP resolution, first reported by the Kansas City Star, was expected to make reference to the March incident on Capitol Hill."
        ],
        [
            "St. Louis Tea Party organizer Bill Hennessy wrote on the group's website Tuesday that the Tea Party stands for smaller government and fiscal responsibility, and accused the NAACP of abandoning black America."
        ],
        [
            "\"When you look at the crime and poverty and family breakdown of the African-American community ... you see a half-century of failure by the NAACP,\" he wrote.",
            "\"None of those persistent problems was caused by the Tea Party movement, yet the principles of the Tea Party are exactly what's needed to wind down the multigenerational destruction in the African-American community."
        ],
        [
            "\"The NAACP was once a vital weapon in the war against segregation and oppression.",
            "All that's left is a bigoted and malicious shell that does far more harm than good for people who need a break,\" he wrote."
        ],
        [
            "Fellow St. Louis Tea Party organizer Dana Loesch accused the NAACP of morphing into a political organization."
        ],
        [
            "“They no longer prioritize civil rights,” she told Fox News."
        ]
    ],
    "title": "NAACP Resolution Calls on Tea Party to Repudiate 'Racist Elements' in Movement",
    "keywords": "Kansas City,Tea Partiers,Fox News,freedom of assembly,racist,The time,Capitol Hill,St Louis,higher taxes,Tea Party movement,civil rights,poverty,bigotry,Tea Party,racism",
    "word-count": 733,
    "main-event": "N.A.A.C.P. Challenges Tea Party on Racism",
    "source": "fox",
    "url": "http://www.foxnews.com/politics/2010/07/13/tea-party-preempts-racist-resolution-condemns-bigoted-naacp/?intcmp=related",
    "uuid": "93ba0f89-9a38-4100-bdbe-6f4d9c06b1ff",
    "main-entities": ["NAACP", "Tea Party"]
}
