{
    "uuid": "d607f52a-1c7a-4b7d-bb46-5daedf3be369",
    "main-event": "Republicans sign letter to stop legislature until tax cut issue is resolved",
    "main-entities": [
        "Democrats",
        "Republicans"
    ],
    "source": "fox",
    "url": "https://www.foxnews.com/politics/senate-republicans-vow-to-block-dem-legislation-until-tax-cuts-budget-pass",
    "date": "2010-12-01",
    "title": "Senate Republicans Vow to Block Dem Legislation Until Tax Cuts, Budget Pass",
    "triplet-uuid": "ae243a95-b2c2-410c-9e2b-b083b4b8eb48",
    "body-paragraphs": [
        [
            "Every Senate Republican has signed onto a letter vowing to block all Democratic-backed legislation until the chamber extends the Bush tax cuts and approves a spending bill to keep the government running, Fox News has learned."
        ],
        [
            "Throwing down the gauntlet, all 42 members of the GOP caucus are sending the letter to Senate Majority Leader Harry Reid warning him that they will bring matters to a standstill unless he swiftly brings those tax-and-spending issues to the floor."
        ],
        [
            "That means putting on the backburner a push to repeal the military's policy banning gays from serving openly in the military, a bill giving illegal immigrant students and military members a pathway to legal status and an extension of long-term unemployment benefits."
        ],
        [
            "\"While there are other items that might ultimately be worthy of the Senate's attention, we cannot agree to prioritize any matters above the critical issues of funding the government and preventing a job-killing tax hike,\" they wrote. ",
            "\"Given our struggling economy, preventing the tax increase and providing economic certainty should be our top priority.\""
        ],
        [
            "\"This strategy is very cynical but very obvious and transparent,\" he said in a statement."
        ],
        [
            "A panel of administration officials and bipartisan lawmakers is getting to work Wednesday to try to hash out a compromise over what to do about the expiring Bush tax cuts. ",
            "Democrats want them extended for all but the wealthy, while Republicans want them extended for everybody."
        ],
        [
            "President Obama met with top GOP and Democratic congressional leaders Tuesday but left the nitty-gritty negotiations to the panel -- he assigned Treasury Secretary Tim Geithner and budget director Jacob Lew to represent the administration. ",
            "Sen. Max Baucus, D-Mont., the representative for Senate Democrats, indicated Wednesday he's not worried about the impact the GOP letter will have on the talks."
        ],
        [
            "\"We have full confidence we're going to be able to handle all of this very well,\" he said."
        ],
        [
            "But with Republicans vowing to deprive Democrats of the 60 votes they need to move toward a vote on virtually anything until these issues are addressed, negotiators will have to move quickly if they want to get to other matters before a new, more Republican Congress is sworn in next month."
        ],
        [
            "The administration is still looking to repeal the military's \"don't ask, don't tell\" policy after the Pentagon issued a report Tuesday claiming the policy shift would not harm the military in the long-run."
        ],
        [
            "Democrats also want to extend long-term jobless benefits, which expired Tuesday. ",
            "A memo circulated by a GOP analyst noted that Reid so far has not been able to peel off any Republicans to support the measure to give benefits beyond 99 weeks."
        ],
        [
            "The lame-duck Congress so far has approved a food safety bill, which still needs a final vote in the House, and a $4.5 billion settlement payment to black farmers and American Indians who claimed they were discriminated against by the U.S. Departments of Agriculture and Interior."
        ],
        [
            "Lawmakers also passed a one-month extension of the \"doc fix\" that prevents cuts to Medicare approved 15 years ago from going into effect, but without action the rates paid to doctors for treating those insured by the entitlement program will plummet on Jan. 1."
        ],
        [
            "It's not just Republicans who are concerned about the way the lame-duck session became a dumping ground for campaign promises and wish-list legislation.",
            "Sen. Michael Bennet, D-Colo., was caught on a hot mic in the Senate ripping the lame-duck agenda, which was set exclusively by his party, as \"rigged\" and done without a discussion among members."
        ],
        [
            "Aside from the tax rates, lawmakers must pass this week a continuing resolution to keep the government functioning. ",
            "Election-harried Democrats opted against producing a budget at all this year, preferring to punt questions on tax rates and spending until after Nov. 2. ",
            "So, the government relies on a series of patches to keep operating. Similarly, lawmakers must vote on a supplemental appropriation to fund military operations in Afghanistan and Iraq."
        ],
        [
            "The filibuster threat increases pressure on the White House to offer a more realistic agenda for the remaining weeks of the year. ",
            "For example, if Congress doesn't act on the tax cuts, it means Republicans will be in position to enact their own, retroactive plan starting Jan. 1 without having to make any concessions to Democratic demands for upper-income earners."
        ]
    ]
}
