{
    "triplet-uuid": "df5fe55a-dfcb-4817-8631-830f47c21a72",
    "date": "2010-12-08",
    "body-paragraphs": [
        [
            "Larry Summers, the outgoing chairman of the National Economic Council, just told a group of reporters that failure to pass a package like the tax deal announced by President Obama this week “would significantly increase the risk” of a double-dip recession."
        ],
        [
            "Mr. Summers made the remarks at a briefing with the White House press secretary Robert Gibbs and David Axelrod, the president’s top political adviser.",
            "The administration has been pushing back hard against criticism from fellow Democrats that the president has caved too much to Republicans."
        ],
        [
            "In brief remarks after meeting with President Bronislaw Komorowski of Poland, Mr. Obama on Wednesday emphatically disputed that Democrats generally feel betrayed by his deal with Congressional Republicans on the tax cuts, saying that “the more who look at it, the more will say this makes sense.”"
        ],
        [
            "“I just think it’s very important for Congress to examine the agreement, look at the facts, have a thorough debate, but get this done.",
            "The American people are watching, and they’re expecting action on our parts,” Mr. Obama said.",
            "“I don’t think we need to translate that.”"
        ],
        [
            "In a joint appearance at the White House with Mr. Komorowski, Mr. Obama said that “economists across the country have upwardly revised their forecasts for growth” after the tax deal was announced on Monday night."
        ],
        [
            "Vice President Joseph R. Biden Jr. planned to return to Capitol Hill this afternoon to meet with House Democrats as President Obama and the White House sought to quell the uproar among liberals about the tax deal."
        ],
        [
            "Officials said Mr. Biden will travel to the Hill around 4:30 p.m. in an attempt to sell the compromise Mr. Obama announced this week.",
            "It will be the second time in two days that Mr. Biden has served as the liaison-in-chief for the White House."
        ],
        [
            "Mr. Biden’s visit and the president’s comments come as the administration’s message machine started churning out statements of support."
        ],
        [
            "To counter condemnations from some Democrats in Congress, the White House circulated a series of e-mails quoting endorsements from private-sector economic forecasters, liberal as well as conservative analysts, and Democratic officeholders, including an obscure freshman House member, Representative Gary Peters of Michigan."
        ],
        [
            "By noon, the White House press office had released supportive comments from Antonio Villaraigosa, the mayor of Los Angeles, and Mr. Peters.",
            "The Democratic National Committee alerted reporters that Jennifer Granholm, the Democratic governor of Michigan, also supports the deal."
        ],
        [
            "John Podesta, a former chief of staff to President Bill Clinton and a close ally of Mr. Obama, issued a statement calling the tax deal “a steep price” but saying the president was “right to choose helping working Americans over a December conflagration.” ",
            "The Democratic National Committee also sent that statement around to reporters."
        ],
        [
            "David Axelrod, the president’s chief political adviser, said on CNN’s “American Morning” that middle-class Americans were “going to get screwed” if their tax cuts were not extended at the end of the year."
        ],
        [
            "The administration was quick to highlight comments from Mark Zandi, chief economist for Moody’sEconomy.com, projecting that the Obama tax deal would increase economic growth next year by 1.25 percentage points and create 1.6 million jobs.",
            "Macroeconomic Advisors, Deutsche Bank and Goldman Sachs projected smaller increases but no less than at least 0.5 percentage point.",
            "That is on top of projections that currently are in the range of 2 percent to 3 percent."
        ],
        [
            "But the public relations offensive is being met with public expressions of outrage from Mr. Obama’s base, including the most liberal members of Congress and spokesmen for interest groups on the left."
        ],
        [
            "Close to three dozen House Democrats have signed a letter from Representative Peter Welch, Democrat of Vermont, calling the tax deal “fiscally irresponsible” and “grossly unfair.”",
            "The letter says Mr. Obama “should not back down. Nor should we.”"
        ],
        [
            "Mr. Biden’s visit with the House Democrats is likely to be as contentious as the one that he led with their Senate colleagues on Tuesday — if not more so."
        ],
        [
            "Despite the closed-door lunchtime meeting, Senate aides told The Times afterward that about 30 Democratic senators remained “firmly opposed” to the president’s negotiated deal after hearing from the vice president."
        ],
        [
            "In the House, Democratic lawmakers said Wednesday morning that the sense of disappointment with the president remained strong."
        ],
        [
            "“I don’t think it was preordained that if we had a deadlock, they would have won it,” said Representative Barney Frank, Democrat of Massachusetts, in an interview on MSNBC.",
            "“I’m not going to vote for it.",
            "I don’t feel that I should be coerced.”"
        ]
    ],
    "title": "Biden Tries, Again, to Sell Tax Compromise to Hill Democrats",
    "keywords": "",
    "word-count": 906,
    "main-event": "White House pressures congress to pass tax bill",
    "source": "nyt",
    "url": "http://thecaucus.blogs.nytimes.com/2010/12/08/biden-tries-again-to-sell-tax-compromise-to-hill-democrats/",
    "uuid": "034fcbed-493e-472f-9df0-10b94ca95276",
    "main-entities": ["Barack Obama", "senate Democrats"]
}
