{
    "triplet-uuid": "df5fe55a-dfcb-4817-8631-830f47c21a72",
    "date": "2010-12-08",
    "body-paragraphs": [
        [
            "Senior White House officials significantly raised the stakes on congressional Democrats in their efforts to get a deal passed on the Bush tax cuts, warning on Wednesday that inaction would \"significantly increase the risk\" of a double dip recession."
        ],
        [
            "It wasn't quite the metaphorical flare of mushroom cloud imagery, but outgoing senior economic adviser Larry Summers offered a fairly dire assessment of the stakes in the tax cut debate."
        ],
        [
            "\"If they [Democrats] don't pass this bill in the next couple weeks it will materially increase the risk that the economy would stall out and we would have a double dip,\" he told a gathering of reporters at an off camera briefing."
        ],
        [
            "A double dip recession?"
        ],
        [
            "\"What I said it would significantly increase the risk,\" Summers replied."
        ],
        [
            "The message was hardly subtle. But it certainly was debatable.",
            "Summers himself, downplayed the significance of continuing the Bush tax cuts back in September -- though he was speaking, then, about the rates for the rich and the tax cut deal, at that point in time, did not include money for a 13-month extension of unemployment insurance or other tax incentives to help lower income workers."
        ],
        [
            "Asked whether the country would find itself dipping towards the economic doldrums if Congress waited a month or two to get a tax cut package passed, Rob Shapiro, a former commerce official in the Clinton White House and a proponent of the current tax cut deal, offered more sober-minded analysis."
        ],
        [
            "\"The wait would not cause a double dip,\" he said.",
            "\"A double dip would come out of the reality of a relatively contractionary fiscal policy...",
            "I do think the deal that they announced is stimulative.",
            "And it ought to boost growth by some increment...",
            "But the issue is, that the deal certainly is not enough to lift the economy to a different place.",
            "Will we see what happened with the large stimulus happen here, which is once the stimulus is over the economy returns to slow growth? That's the danger.",
            "And I keep on saying this, the single most important thing they can do to avert that is to stabilize housing prices.\""
        ],
        [
            "Stabilizing the housing market, however, is not on the current congressional docket.",
            "And on Wednesday, the White House began a robust process of selling the deal to Democrats -- skeptical, as they are, about an extension of Bush tax cuts for the wealthy and a generous revision of the estate tax."
        ],
        [
            "There were few carrots to go along with the sticks.",
            "Asked, for instance, if the White House would be willing to revise the informal compromise to bring more Democratic lawmakers on board, White House Press Secretary Robert Gibbs said any changes would be fine, so long as they didn't result in decreased support.",
            "Then he cautioned: \"The physics and the blood and the sweat that might be involved in that, I'm not entirely sure I would put it quite as simply as that.\""
        ],
        [
            "If anything, the pitch being offered from the administration to the rest of the party was: take the package now or risk being blamed for an economic downturn."
        ],
        [
            "\"I guess the question back for those who ask [why not fight for more] is where does this go, what is the end game and what are the consequences of playing it?\" said senior adviser David Axelrod.",
            "\"Do they have a sense of how this ends and how long will that take, because as Larry said there are real consequences to that.",
            "Just as the forecasts went up on the basis of this agreement they will go down if this agreement fails. That we know.",
            "We know that on January 1 people's taxes will go up, we know that at the end of this month 2 million people will lose their unemployment insurance.",
            "And so there are real consequences to that decision.",
            "We, I think we all stipulate, the president did, no one likes those provisions that they dislike but on the other side of the ledger are significant things that will help people and help the economy.",
            "And what we know for sure is that without any of it we are facing a really difficult situation.\""
        ],
        [
            "Added Gibbs: \"I think you would really have to ask somebody who says... lets have some eight week fight and on February the 15th come in and say, alright, now we are ready to make a compromise, who on earth, who on earth thinks that that is somehow going to be a fundamentally better agreement than the one we are looking at right now?",
            "No one I have ever talked to.\""
        ]
    ],
    "title": "Larry Summers: If Tax Deal Goes Down There's A 'Significant Risk' Of A Double Dip Recession",
    "keywords": "larry, summers:, if, tax, deal, goes, down, there's, a, 'significant, risk', of, a, double, dip, recession, politics",
    "word-count": 842,
    "main-event": "Larry Summers pressures congress to pass tax bill",
    "source": "hpo",
    "url": "http://www.huffingtonpost.com/2010/12/08/larry-summers-tax-cut-deal_n_793975.html",
    "uuid": "a2b088c9-b060-4ac5-a6aa-d262477bda5c",
    "main-entities": ["Larry Summers"]
}
