{
    "source": "hpo",
    "main-entities": ["Michael Bloomberg", "Donald Trump"],
    "main-event": "Bloomberg criticizes Trump at DNC",
    "title": "Clinton Is 'Sane' And 'Competent,' Unlike Trump, Bloomberg Tells U.S.",
    "url": "https://www.huffingtonpost.com/entry/trump-business-michael-bloomberg-dnc_us_579957a2e4b0d3568f85fbb7",
    "word-count": 487,
    "date": "2016-07-27",
    "uuid": "9889aa14-9681-46c9-92af-36fb1bf108b1",
    "triplet-uuid": "472158a1-4e39-4214-8397-904e66f2b4c5",
    "body-paragraphs": [
        [
            "PHILADELPHIA ― Americans should vote for Hillary Clinton because, unlike Republican nominee Donald Trump, she is a “sane, competent person,” Michael Bloomberg, the former New York mayor and founder of the Bloomberg financial news and information empire, said at the Democratic National Convention Wednesday."
        ],
        [
            "The line was an unscripted addition to a speech in which Bloomberg criticized Democrats, but argued that Trump was a “dangerous demagogue” and a bad businessman who would be a disastrous president.",
            "“I’m a New Yorker,” he said, “and New Yorkers know a con when we see one.”"
        ],
        [
            "The billionaire ex-Republican, who has endorsed Democratic presidential nominee Hillary Clinton, made the case that Trump’s career is characterized by a litany of collapses and missteps, and that the Republican presidential nominee’s boasts don’t match reality.",
            "Americans who want a great businessperson in the White House should look for someone who isn’t Trump, Bloomberg said."
        ],
        [
            "“Throughout his career, Trump has left behind a well-documented record of bankruptcies, thousands of lawsuits, angry stockholders and contractors who feel cheated and disillusioned customers who feel ripped off,” Bloomberg said.",
            "“Trump says he wants to run the nation like he’s running his business? God help us."
        ],
        [
            "Bloomberg’s scathing speech seemed designed to chafe Trump’s rawest nerves, mocking Trump’s business prowess, his inheritance from his late father, his ego and his intellect."
        ],
        [
            "“Truth be told, the richest thing about Donald Trump is his hypocrisy,” Bloomberg said.",
            "Trump claims great wealth, but won’t disclose his real net worth and refuses to release his tax returns.",
            "The real-estate developer also reacts defensively when his success is questioned."
        ],
        [
            "Bloomberg ― who rivals Trump in unwavering self-assurance ― favorably compared his own achievements in business and politics with Trump’s."
        ],
        [
            "“We’ve heard a lot of talk in this campaign about needing a leader who understands business.",
            "I couldn’t agree more.",
            "I’ve built a business ― and I didn’t start it with a million-dollar check from my father,” Bloomberg said.",
            "“Because of my success in the private sector, I had the chance to run America’s largest city for 12 years.”"
        ],
        [
            "Bloomberg weighed an independent bid for president this year because he objected to both Trump and Sen. Bernie Sanders (I-Vt.), Clinton’s primary challenger.",
            "Bloomberg was a vocal critic of the Republican candidate ― his former friend ― long before backing Clinton’s White House run."
        ],
        [
            "The financial industry tycoon ridiculed Trump’s statements on immigration, national security, foreign trade, and his use of overseas labor.",
            "And Bloomberg made dire predictions about the damage a Trump presidency would wreak on virtually every aspect of American life."
        ],
        [
            "“I understand the appeal of a businessman president,” Bloomberg said.",
            "“But Trump’s business plan is a disaster in the making.",
            "He would make it harder for small businesses to compete, do great damage to our economy, threaten the retirement savings of millions of Americans, lead to greater debt and more unemployment, erode our influence around the world and make our communities less safe.”"
        ]
    ]
}
