{
    "source": "fox",
    "main-entities": ["Donald Trump", "Ted Cruz", "National Enquirer"],
    "main-event": "Trump and Cruz argue over personal attacks",
    "title": "Cruz blames Trump for affair story, hints he wouldn't support him in general election",
    "url": "http://latino.foxnews.com/latino/politics/2016/03/25/cruz-blames-trump-for-affair-report-hints-wouldnt-support-him-in-general/",
    "word-count": 612,
    "date": "2016-03-25",
    "uuid": "72ccb51d-e0ed-45a4-a683-cef1a33c4689",
    "triplet-uuid": "59f2f47c-5da0-4fbc-be6e-4f15d45d82e2",
    "body-paragraphs": [
        [
            "Sen. Ted Cruz has laid down the gauntlet in the growing war of words with Donald Trump over the Republican presidential candidates’ wives."
        ],
        [
            "The Texas lawmaker blamed his rival for the National Enquirer story published Friday that alleged Cruz has had extramarital affairs, and after hits from Trump’s campaign about the mental health of his wife, the firebrand senator appears to be backing away from his pledge to support Trump if the billionaire real estate mogul wins the GOP nomination."
        ],
        [
            "“I don’t make a habit out of supporting people who attack my wife and attack my family,” Cruz said at a press conference after a Wisconsin rally, according to The Hill."
        ],
        [
            "He added, “Donald Trump is not going to be the Republican nominee.”"
        ],
        [
            "Earlier in the campaign, GOP candidates signed a promise not to run as an independent if they were not nominated.",
            "The move was meant to convince voters that Trump would remain faithful to the Republican Party even if he lost."
        ],
        [
            "“It is garbage, complete and utter lies,” Cruz said about the National Enquirer article alleging that he has had multiple affairs.",
            "“It is a tabloid smear, and it has come from Donald Trump and his henchmen.”"
        ],
        [
            "Trump spokeswoman Katrina Pierson responded to claims that she is one of the mystery women referred to in the article, stating on Twitter that the allegation is “stupidity on all levels.”"
        ],
        [
            "“Of course the National Enquirer story is 100 percent false!,” Pierson tweeted."
        ],
        [
            "Of course the National Enquirer story is 100% FALSE!!!",
            "I only speak to myself, however."
        ],
        [
            "Earlier this year, the tabloid endorsed Trump for president with an issue that included an article giving ten reasons why the reality TV star is the “only choice for the White House.”"
        ],
        [
            "The intensely personal feud between Cruz and Trump began earlier this week when a super PAC that opposes Trump posted a meme-style ad featuring a naked Melania Trump that Trump’s then-girlfriend, a professional model, posed for more that 15 years ago for British GQ."
        ],
        [
            "Make America Awesome PAC paid for the ads and posted them on Facebook and Instagram."
        ],
        [
            "The photo features Mrs. Trump sprawled out naked on a fur rug inside a Boeing 727.",
            "The social media posts read, “Meet Melania Trump. Your next First Lady. Or you could support Ted Cruz on Tuesday.”"
        ],
        [
            "An angry Trump lashed out at Cruz on Twitter, calling the senator a liar, as he has alleged before in the campaign, and threatening to “spill the beans” about Cruz's wife Heidi."
        ],
        [
            "“Lyin' Ted Cruz just used a picture of Melania from a GQ shoot in his ad,” Trump said on the social media site.",
            "“Be careful, Lyin' Ted, or I will spill the beans on your wife!”"
        ],
        [
            "Cruz quickly retorted by saying that the ads did not come not from his campaign, and called Trump a “coward” threatening to go after his wife."
        ],
        [
            "“Pic of your wife not from us,” Cruz said.",
            "“Donald, if you try to attack Heidi, you're more of a coward than I thought. #classless.”"
        ],
        [
            "The lurch into the sort of personal territory that's normally off limits in campaigns occurred as an anti-Trump super PAC began running an ad in primary states featuring women reciting comments made by the billionaire that are derogatory toward women.",
            "That ad was produced by Our Principles, a group founded by a former Mitt Romney campaign adviser who is trying to help the GOP appeal to women."
        ],
        [
            "Trump has a substantial lead in the delegate chase for the GOP nomination.",
            "Cruz has a stiff challenge trying to catch him in remaining races and may only have a shot at the nomination if the contest spills into the summer convention."
        ]
    ]
}
