{
    "source": "fox",
    "main-entities": ["Donald Trump", "Barack Obama", "Hillary Clinton"],
    "main-event": "Trump criticizes Obama and Clinton over Orlando shooting",
    "title": "Trump takes on Obama, Clinton over ‘radical Islam’ as candidates condemn terror",
    "url": "http://www.foxnews.com/politics/2016/06/13/trump-takes-on-obama-clinton-over-radical-islam-as-candidates-condemn-terror.html",
    "word-count": 640,
    "date": "2016-06-13",
    "uuid": "cf3767f6-71f7-4eb2-a5e8-956b1b16fc0d",
    "triplet-uuid": "76810849-0335-4ad3-9eaf-f0d9c5baceb6",
    "body-paragraphs": [
        [
            "The terror massacre at a packed Orlando nightclub reverberated across the presidential campaign trail Sunday, as the candidates condemned the deadliest shooting in U.S. history -- and Donald Trump ripped President Obama and Hillary Clinton for avoiding the term “radical Islam” in doing so."
        ],
        [
            "The presumptive Republican presidential nominee went so far as to say Obama should “step down” for not using the term and Clinton should “get out of this race” if she won’t either."
        ],
        [
            "“If we do not get tough and smart real fast, we are not going to have a country anymore,” Trump said in a statement.",
            "“Because our leaders are weak, I said this was going to happen -- and it is only going to get worse.",
            "I am trying to save lives and prevent the next terrorist attack.",
            "We can't afford to be politically correct anymore.”"
        ],
        [
            "Obama, speaking from the White House on Sunday, said the nightclub massacre in which 50 people were killed and at least 53 others were wounded is being investigated as an “act of terror,” though did not say whether it was tied to radical Islam."
        ],
        [
            "The gunman, Omar Mir Seddique Mateen, was heard shouting “Allahu Akbar” while engaging officers, law enforcement sources told Fox News."
        ],
        [
            "Mateen also called 911 during the shooting to pledge allegiance to ISIS leader Abu Bakr al-Baghdadi, Fox News has learned."
        ],
        [
            "ISIS reportedly claimed responsibility for the attack, though it’s unclear if the shooting was actually directed by the group or only inspired by it."
        ],
        [
            "All these details, surrounding the deadliest terror attack on the U.S. homeland since 9/11, have fueled tensions in the presidential race at an already-combustible time."
        ],
        [
            "Trump has faced intense criticism from members of both parties for his calls to temporarily ban Muslim immigration to the U.S."
        ],
        [
            "In the wake of the Orlando attack, Trump again defended his proposals, saying on Twitter: “What has happened in Orlando is just the beginning.",
            "Our leadership is weak and ineffective. I called it and asked for the ban. Must be tough.”"
        ],
        [
            "Trump originally was planning to deliver a speech Monday in Manchester, N.H., focused on the Clintons."
        ],
        [
            "In the wake of the Orlando attack, it will also focus on security and immigration issues, Fox News is told."
        ],
        [
            "Democratic candidate Bernie Sanders also condemned the attack, while speaking to reporters outside his home in Burlington, Vt."
        ],
        [
            "Earlier Sunday, Clinton released a statement unequivocally calling the massacre an “act of terror.”"
        ],
        [
            "“For now, we can say for certain that we need to redouble our efforts to defend our country from threats at home and abroad.",
            "That means defeating international terror groups, working with allies and partners to go after them wherever they are, countering their attempts to recruit people here and everywhere, and hardening our defenses at home.",
            "It also means refusing to be intimidated and staying true to our values,” she said."
        ],
        [
            "She also called it an “act of hate” -- a term Obama also used -- since the attacker targeted an LGBT nightclub during Pride Month.",
            "And she said the country needs to “keep guns like the ones used last night out of the hands of terrorists or other violent criminals.”"
        ],
        [
            "Clinton did not reference radical Islam."
        ],
        [
            "Meanwhile, a joint campaign rally with Clinton and Obama set for Wednesday in Green Bay, Wis., has been postponed in light of the attack, according to a White House official."
        ],
        [
            "Obama also ordered U.S. flags to be flown at half-staff “as a mark of respect for the victims of the act of hatred and terror perpetrated on Sunday, June 12, 2016, in Orlando, Florida.”"
        ],
        [
            "Florida GOP Gov. Rick Scott declared a state of emergency, which will make additional resources available for local authorities."
        ],
        [
            "He offered “thoughts and prayers” to all those affected by the attack, particularly the victims and their families, and praised the efforts of the first-responders."
        ]
    ]
}
