{
    "source": "fox",
    "main-entities": ["Nancy Pelosi", "Tim Ryan"],
    "main-event": "Nancy Pelosi wins House minority leadership again",
    "title": "Pelosi wins another term as House Democratic leader; Ryan’s dynamic challenge falls short",
    "url": "http://www.foxnews.com/politics/2016/11/30/house-democrats-set-to-vote-for-leader.html",
    "word-count": 738,
    "date": "2016-11-30",
    "uuid": "0e0c9fac-c253-45e6-99fd-b725c84a9b1c",
    "triplet-uuid": "79bf99c6-6fca-4ce4-8ae1-8771de026142",
    "body-paragraphs": [
        [
            "California Democratic Rep. Nancy Pelosi on Wednesday was appointed to an eighth term as House minority leader, surviving a challenge from a Midwestern Democrat backed by caucus members frustrated over repeated election loses and an aging leadership team."
        ],
        [
            "Pelosi was challenged by Ohio Rep. Tim Ryan in a secret-ballot vote among House Democrats.",
            "She won by a 134-to-63 vote."
        ],
        [
            "Pelosi said afterward that she was “exhilarated” by the strong support and reminded reporters that she had accurately predicted winning two-thirds of the vote."
        ],
        [
            "She has winning brought “a special spring in my step” because it gives her the opportunity to “differentiate between us and the administration coming in January.\""
        ],
        [
            "Ryan, after a disappointing 2016 election cycle for Democrats, argued that newer lawmakers in the party need a bigger, fresher voice to represent them, instead of the same slate of leaders and committee chairmen."
        ],
        [
            "He represents northeast Ohio, a region full of the type of disaffected union workers and former Democrats who helped Republican Donald Trump win that battleground state and the White House."
        ],
        [
            "“Clearly, this didn’t turn out the way we wanted,” Ryan said after the vote.",
            "“We knew it was going to be an uphill battle.",
            "… We needed to get out the economic message.",
            "I’m disappointed, but I think the party’s better off because of this.”"
        ],
        [
            "Ohio Rep. Marcia Fudge, among the handful of House Democrats who backed Ryan's bid, said the effort to unseat Pelosi was not a failure."
        ],
        [
            "“We didn’t lose today,” she said, interrupting reporters at the post-vote press conference.",
            "“We now have a leadership team that listens to us.",
            "… Today, we made our caucus more representative of our members.”"
        ],
        [
            "Another criticism among rank-and-file House Democrats was that the top posts are largely filled by East and West coast members, not those from the heartland."
        ],
        [
            "Pelosi has led House Democrats since 2002.",
            "Democrats lost the House majority in the 2010 Tea Party-inspired wave election.",
            "And Republican-led redistricting has made chances of a Democratic comeback increasingly difficult."
        ],
        [
            "The 76-year-old Pelosi, in the months prior to the Nov. 8 elections, repeatedly vowed that her party would retake control of the lower chamber, despite needing to gain roughly 35 seats."
        ],
        [
            "“We know how to win elections,” she said Wednesday.",
            "“We’ve done it in the past and we’ll do it again.",
            "This is so much bigger that politics.”"
        ],
        [
            "Pelosi also described her upcoming role of contrasting Democrats to Republican President-elect Donald Trump’s incoming administration as a “historic challenge” that goes “beyond politics.”"
        ],
        [
            "Leadership elections were originally scheduled to be held before Thanksgiving but were delayed to give Democrats more time to discuss and process the election results and consider a path forward.",
            "Many are discouraged after losing the White House and making smaller than expected gains in both chambers of Congress."
        ],
        [
            "\"I believe we must do more than simply paper over the cracks,\" said Rep. Ruben Gallego of Arizona, one of a handful of House Democrats to endorse Ryan.",
            "\"We can't just say the right things -- we must take concrete steps to move our party in the right direction.\""
        ],
        [
            "In the days before Wednesday’s vote, Pelosi, a prolific fundraiser, promised some changes to assuage concerns in her caucus, including adding a member of the freshmen class to her leadership team."
        ],
        [
            "She won despite her proposals doing little to ensure new blood at the very top or changing the seniority system that has key committees led by lawmakers in their 80s at a moment when the party needs to be defending ObamaCare and other initiatives by President Obama."
        ],
        [
            "Republicans are on track to hold at least 240 seats in the House next year.",
            "Democrats, who had high hopes of significant gains in the election, picked up just six seats on Election Day earlier this month and remain in the minority with 194 seats."
        ],
        [
            "Rep. Loretta Sanchez won the competition for vice Democratic Caucus chairman, defeating fellow California congresswoman Barbara Lee."
        ],
        [
            "Lee is a former Congressional Black Caucus chairman.",
            "Sanchez formerly led the Congressional Hispanic Caucus."
        ],
        [
            "Democrats until Wednesday had never had a female minority in their leadership ranks."
        ],
        [
            "“I’m really honored and emotional to be standing here among a group of such great leaders,” Sanchez said in second, late-afternoon press conference led by Pelosi."
        ],
        [
            "Other top leadership posts were uncontested."
        ],
        [
            "Reps. Steny Hoyer, Maryland, kept the No. 2 job of House minority whip, and Jim Clyburn, South Carolina, remained in No. 3 position of assistant leader."
        ]
    ]
}
