{
    "source": "hpo",
    "main-entities": ["Nancy Pelosi", "House Democrats"],
    "main-event": "Nancy Pelosi wins House minority leadership again",
    "title": "Nancy Pelosi Re-Elected House Minority Leader",
    "url": "https://www.huffingtonpost.com/entry/nancy-pelosi-house-democratic-leader_us_583ed770e4b0ae0e7cdae8f5",
    "word-count": 792,
    "date": "2016-11-30",
    "uuid": "4099d293-cda6-4ef6-99de-b95fe7e21a10",
    "triplet-uuid": "79bf99c6-6fca-4ce4-8ae1-8771de026142",
    "body-paragraphs": [
        [
            "WASHINGTON ― House Minority Leader Nancy Pelosi (D-Calif.) was re-elected to her leadership post Wednesday morning.",
            "But more than 60 Democrats voted against her ― a stunning level of dissent at a time when the party is trying to pick up the pieces after a disastrous presidential election."
        ],
        [
            "Pelosi defeated her lone challenger, Rep. Tim Ryan (Ohio), by a vote of 134 to 63.",
            "It’s a decisive win, and it (barely) clears the two-thirds majority support that Pelosi predicted she had.",
            "But it reveals that dozens in her caucus voted against her in secret ballots. That’s a lot."
        ],
        [
            "“There’s a whole lot of anger,” said one Democrat who opposed her, who requested anonymity in order to speak freely.",
            "“I’m astounded that this caucus refuses to acknowledge reality and change.”"
        ],
        [
            "Pelosi has led House Democrats since 2003, and that’s what Ryan had argued is the problem.",
            "The same people have been running the caucus for years ― Pelosi, House Minority Whip Steny Hoyer (Md.) and Assistant Democratic Leader James Clyburn (S.C.) ― and they’re all in their 70s now.",
            "Some say they’re not the right messengers to energize the base and convey an economic message that appeals to people beyond the two coasts."
        ],
        [
            "House Democrats have also lost nearly 60 seats over the past six years.",
            "They picked up just six seats in this election cycle ― far fewer than expected."
        ],
        [
            "Pelosi’s supporters said her experience is what the party needs now more than ever, going up against President-elect Donald Trump and a GOP-controlled Congress: She’s battle-tested, she’s a prolific fundraiser and she knows better than anyone how to count votes and keep her party together."
        ],
        [
            "They say it’s not her fault when Democrats lose at the polls, either."
        ],
        [
            "“You can’t really blame Nancy Pelosi for gerrymandering and for the national election,” Rep. Hank Johnson (D-Ga.) told reporters."
        ],
        [
            "She’s also the only woman in top House and Senate leadership.",
            "If Ryan had replaced her, it would have become all white men."
        ],
        [
            "The California Democrat spoke briefly to reporters after the vote, saying she feels “exhilarated” at being re-elected."
        ],
        [
            "“Today has a special excitement for me because I think we’re at a time where it is well beyond politics.",
            "It’s about the character of America,” Pelosi said.",
            "“How we go forward in our caucus to put forth our values, which are what unite us a caucus, to differentiate between us and the administration that will come into Washington in January, to take that message clearly to the public, is something that is a historic challenge.”"
        ],
        [
            "“We know how to win elections,” she added.",
            "“We’ve done it in the past. We will do it again by making that differentiation.”"
        ],
        [
            "Asked about the 63 Democrats who voted for Ryan, Pelosi said, “I got two-thirds of the vote.”"
        ],
        [
            "Separately, Ryan told reporters the race didn’t turn out as he wanted but he thinks he did “a pretty good job” of bringing economic issues to the forefront."
        ],
        [
            "“I think we got the message out,” he said.",
            "“I believe in my heart, if we’re going to win as Democrats, we have to have the kind of message that resonates in every corner of this country.”"
        ],
        [
            "During the closed-door caucus meeting, several Democrats went to bat for Pelosi. Reps. Adam Schiff (Calif.), Gwen Moore (Wis.), Bill Pascrell (N.J.), Katherine Clark (Mass.), Joaquin Castro (Texas) and Debbie Dingell (Mich.) each gave nominating speeches for her."
        ],
        [
            "“Everything we care about [is] at risk,” Schiff told the room.",
            "“We need the very best to lead us.",
            "No one is a better tactician than Nancy Pelosi. No one does it better. No one even comes close.”"
        ],
        [
            "Dingell said she has spoken “endlessly” to Pelosi about appealing to Midwestern voters, and said she gets it.",
            "“Leader Pelosi always listened and she always understood.”"
        ],
        [
            "Pelosi’s understanding of Midwesterners, or lack thereof, is what Ryan highlighted as the party’s biggest problem.",
            "He said the California progressive has lost the connection with working-class people in the Midwest ― the same people who make up his district, and the same people who turned out in droves to vote for Trump and help defeat Democratic presidential nominee Hillary Clinton weeks ago."
        ],
        [
            "“When you see working-class people, blue-collar people, going and voting for Trump, that’s a failure of the Democratic Party because they felt like we didn’t care about them,” Ryan said earlier this month.",
            "“That just makes my stomach sick.”"
        ],
        [
            "Pelosi did not agree with Ryan’s assessment in a Monday interview with The Huffington Post."
        ],
        [
            "“He didn’t even carry his district for Hillary Clinton, so I don’t know why he’s saying that,” she said.",
            "“I have strong support from our friends in the unions, including steelworkers, which I guess are his area ... I’m a woman of steel in there.”"
        ]
    ]
}
