{
    "source": "hpo",
    "main-entities": ["Paul LePage"],
    "main-event": "Paul LePage remains in office",
    "title": "Paul LePage Says He Won't Resign After All",
    "url": "https://www.huffingtonpost.com/entry/paul-lepage-media_us_57c6f070e4b0e60d31dc7253",
    "word-count": 595,
    "date": "2016-08-31",
    "uuid": "3b015abd-0e07-4329-85f6-7ae616cbda37",
    "triplet-uuid": "7a97de89-1433-46f7-bcc2-f80b041cb9a0",
    "body-paragraphs": [
        [
            "Maine Gov. Paul LePage (R) said Wednesday that he has no plans to resign, adding that from this day forward, he will no longer talk to the media."
        ],
        [
            "“I will no longer speak to the press ever again after today,” he told reporters Wednesday.",
            "“And I’m serious. Everything will be put into writing.",
            "I’m tired of being caught in the gotcha moments.”"
        ],
        [
            "LePage has been mired in controversy since calling state Rep. Drew Gattine (D) a “son-of-a-bitch, socialist cocksucker” in a voicemail last week.",
            "After widespread criticism ― including from members of his own party ― he apologized."
        ],
        [
            "LePage hinted on Tuesday that he may resign before his term ends in 2018, telling a local radio station, “I’m looking at all options.",
            "I think some things I’ve been asked to do are beyond my ability.",
            "I’m not going to say that I’m not going to finish it.",
            "I’m not saying that I am going to finish it.”"
        ],
        [
            "He walked back his remarks later that day, criticizing “rumors” that he was going to resign ― even though they came directly from LePage himself."
        ],
        [
            "On Wednesday morning, LePage said unequivocally that he will be staying put."
        ],
        [
            "“I will not resign,” he said after a reconciliation meeting with Gattine, according to the Boston Globe."
        ],
        [
            "Democrats have been pounding LePage, saying that he needs to step down and questioning his mental abilities.",
            "Gattine said after their meeting he believes the governor should resign even though he apologized for the voicemail."
        ],
        [
            "“Every day, Paul LePage gives Maine people more evidence that he is unfit for office,” State House Majority Leader Jeff McCabe (D) and Assistant House Majority Leader Sara Gideon (D) said in a statement Tuesday night.",
            "“The governor is not mentally able to serve and needs to resign.”"
        ],
        [
            "“I’m not an alcoholic and I’m not a drug addict and I don’t have mental issues,” LePage replied Wednesday.",
            "“What I have is a backbone, and I want to move Maine forward.”"
        ],
        [
            "He said he will be seeking “spiritual guidance” from his family."
        ],
        [
            "Members of LePage’s own party have been trying to deal with the headaches he’s caused as well, with one GOP state senator even talking about censuring him.",
            "State House Minority Leader Ken Fredette (R) said Tuesday night that he would not support bringing the legislature back into a special session to consider sanctions against LePage ― a position that his counterpart in the Senate wouldn’t back."
        ],
        [
            "“With all due respect, I completely disagree with Fredette’s position,” Senate President Mike Thibodeau (R) said Wednesday.",
            "“The Republican Senate caucus has clearly stated that we need an acceptable plan for corrective action before the determination of whether the Legislature should convene is made.”"
        ],
        [
            "The latest controversy really dates back to January, when LePage claimed that drug dealers with names like “Smoothie, D-Money and Shifty” come into Maine and “impregnate a young, white girl before they leave.”",
            "Last week, LePage tried to back up that statement ― which had been widely criticized at the time ― by saying he keeps a binder of drug dealers arrested in Maine and “90-plus percent of those pictures” in his book are of black and Hispanic individuals."
        ],
        [
            "LePage was upset because he mistakenly believed Gattine heard those remarks and called him a racist, and so he left him the voicemail.",
            "Gattine denied to the Portland Press Herald that he ever called the governor a racist."
        ],
        [
            "LePage has long been clear about his distaste for the media.",
            "He has said newspapers are his greatest fear and joked about blowing up the headquarters of the Portland Press Herald."
        ]
    ]
}
