{
    "source": "fox",
    "main-entities": ["Paul LePage"],
    "main-event": "Paul LePage remains in office",
    "title": "Maine Gov. LePage opens door to early exit",
    "url": "http://www.foxnews.com/politics/2016/08/30/maine-gov-lepage-opens-door-to-early-exit.html",
    "word-count": 563,
    "date": "2016-08-30",
    "uuid": "0b7469f0-2f17-4de1-b9b8-911bad62b6c6",
    "triplet-uuid": "7a97de89-1433-46f7-bcc2-f80b041cb9a0",
    "body-paragraphs": [
        [
            "Controversial Maine Gov. Paul LePage opened the door Tuesday to making an early exit from the governor’s office following pressure from state lawmakers to step down."
        ],
        [
            "“I’m looking at all options,” LePage said on talk radio station WVOM.",
            "“I think some things I’ve been asked to do are beyond my ability.",
            "I’m not going to say that I’m not going to finish it. I’m not saying that I am going to finish it.”"
        ],
        [
            "Later in the day, LePage took to Twitter, though, to push back on media reports about a possible resignation."
        ],
        [
            "During the radio interview, the governor apologized repeatedly for an expletive-ridden voicemail he recently left for Democratic state Rep. Drew Gattine -- the latest controversy to hang over his office."
        ],
        [
            "Earlier, the Republican governor had refused to apologize for the message, even saying at press conference he wished it was 1825 so he could shoot Gattine in a duel."
        ],
        [
            "In a recording of the message obtained by the Press Herald, the governor identified himself and went on to curse out Gattine."
        ],
        [
            "“I would like to talk to you about your comments about my being a racist, you c---sucker.",
            "I want to talk to you I want you to prove that I’m a racist.",
            "I’ve spent my life helping black people and you little son-of-a-b----, socialist c---sucker.",
            "You … I need you to, just friggin.",
            "I want you to record this and make it public because I am after you.",
            "Thank you,” he said in the message."
        ],
        [
            "LePage initially said his outburst was justified because Gattine called him a racist – something Gattine has denied."
        ],
        [
            "The alleged name-calling came after LePage said during a town hall that he’s collected a binder full of drug dealers arrested in the state showing that 90 percent of them “are black and Hispanic people from Waterbury, Conn.; the Bronx; and Brooklyn.”"
        ],
        [
            "The leaked voicemail prompted members of LePage’s own party to question his ability to lead the state."
        ],
        [
            "During his news conference Friday, LePage offered more racially charged comments that have drawn fire, saying, \"A bad guy is a bad guy.",
            "I don't care what color it is.",
            "When you go to war ... you try to identify the enemy.",
            "The enemy right now, the overwhelming majority of people coming in, are people of color or people of Hispanic origin.\""
        ],
        [
            "But this isn’t the first time LePage’s comments have gotten him in trouble."
        ],
        [
            "The Republican governor has a long history of making controversial statements dating back to 2010 when he said if he were elected governor, he’d tell President Obama to “go to hell.”"
        ],
        [
            "A year later, LePage said that NAACP officials, who had called him out for not attending a Martin Luther King Jr.’s event, could “kiss my butt.”"
        ],
        [
            "In 2015, LePage was forced to apologize to the son of a cartoonist for The Bangor Daily News because he told him he’d “like to shoot” his father.",
            "That same year, a charter school said LePage threatened to strip it of its funding if it did not rescind a job offer to Democratic state House Speaker Mark Eves."
        ],
        [
            "In January, he said drug dealers with names like “D-Money, Smoothie (and) Shifty” are getting Maine’s white women pregnant.",
            "He later said he had misspoke and meant to say all “Maine women” not only “Maine’s white women.”"
        ],
        [
            "LePage’s second and final term as governor officially ends in 2019."
        ]
    ]
}
