{
    "source": "nyt",
    "main-entities": ["Paul LePage"],
    "main-event": "Paul LePage remains in office",
    "title": "Paul LePage, the Governor of Maine, Now Says He’s Not Quitting",
    "url": "https://mobile.nytimes.com/2016/09/01/us/paul-lepage-maine-governor.html",
    "word-count": 869,
    "date": "2016-08-31",
    "uuid": "d0e3873f-ce2a-44cc-95db-7b1598f2a0b7",
    "triplet-uuid": "7a97de89-1433-46f7-bcc2-f80b041cb9a0",
    "body-paragraphs": [
        [
            "AUGUSTA, Me. — Paul R. LePage, the embattled Republican governor of Maine, declared on Wednesday that he would not step down despite widespread criticism over a profane threat and generalizations about drugs and race that had prompted him to hint on Tuesday that he might abort his second term."
        ],
        [
            "“I will not resign,” said Mr. LePage, who tried to put to rest swirling questions about his state of mind."
        ],
        [
            "“I’m not an alcoholic, and I’m not a drug addict, and I don’t have mental issues,” he said.",
            "“What I have is a backbone.”"
        ],
        [
            "Mr. LePage nevertheless said he was seeking “spiritual guidance,” had apologized for his threat, and vowed to make one change to his behavior: “I will no longer speak to the press ever again after today,” he said."
        ],
        [
            "Behind the scenes, state lawmakers — Democrats and Senate Republicans — exasperated after six years of political controversies and what they saw as erratic behavior, were scrambling to figure out what, if anything, they could do to formally address this latest crisis."
        ],
        [
            "The controversy, which has galvanized the state, started last Wednesday when Mr. LePage made sweeping statements linking minorities to the state’s drug crisis.",
            "As criticism against him swelled, Mr. LePage came to believe that a Democratic lawmaker had called him a racist.",
            "The governor then left him an expletive-laden voicemail message, which he followed up by threatening to shoot the lawmaker between the eyes.",
            "In the ensuing days, Mr. LePage also reiterated his insistence that blacks and Hispanics were the vast majority of those arrested for dealing heroin in Maine."
        ],
        [
            "Both Democrats and Republicans have denounced the remarks, as many legislators called for a special session to at least rebuke the governor over his latest tirade.",
            "The state’s four legislative caucuses have said that they believe all four would have to agree for a special session to be scheduled."
        ],
        [
            "But on Tuesday, Mr. LePage’s Republican allies in the House, including the minority leader, Kenneth Fredette, announced that they would oppose those efforts — essentially shielding him from any official political consequence."
        ],
        [
            "That decision did not sit well with some other state Republicans, and on Wednesday morning, the spotlight shifted to them as the president of the Senate, whose members govern larger and more competitive districts, made a public break with his colleagues in the House."
        ],
        [
            "“With all due respect, I completely disagree with Representative Fredette’s position,” the Republican leader, Michael Thibodeau, said in a statement.",
            "“The Republican senate caucus has clearly stated that we need an acceptable plan for corrective action before the determination of whether the Legislature should convene is made.”"
        ],
        [
            "Mr. Thibodeau said many Senate Republicans were still deciding whether or not Mr. LePage’s apology and promise to seek “spiritual guidance” had allayed their concerns about the governor — a process that could deepen their divide with Republicans in the House and pull the controversy into a second week."
        ],
        [
            "“There should be consequences for our actions,” Mr. Thibodeau said, “and I think that’s why we’re really struggling.”"
        ],
        [
            "There is no precedent for such a situation here — a fact that has sent lawmakers like Senator Roger Katz, a Republican who has been critical of Mr. LePage, back to reading their state Constitutions on Wednesday to figure out what, if anything, they could do now to convene a special session.",
            "Mr. Katz, a lawyer, suggested it may require only a simple majority of the House and senate, which could reduce the House Republicans’ ability to block such a move, although he added there could be other hurdles to an agreement."
        ],
        [
            "“It’s never been done before, so we’re in a little bit of uncharted waters,” said Mr. Katz, who said he wanted Mr. LePage to get “a competent evaluation and follow the recommendations of the evaluator.”"
        ],
        [
            "Democrats have continued to call for Mr. LePage’s ouster, and on Wednesday said they were scheduling meetings with Republican leadership to discuss how to proceed."
        ],
        [
            "“Coming back in for a special session will be discussed and all options around the governor’s political future are on the table,” said the Democratic leader of the Senate, Justin Alfond."
        ],
        [
            "Mr. LePage’s six years in office here, which began as part of the Tea Party sweep in 2010, have been marked by controversy.",
            "Even as he fueled outrage among Democrats and angst among many moderate Republicans, his well of support, fed by voters drawn to his unfiltered political style, never seemed to run dry."
        ],
        [
            "By all indications, Mr. LePage seemed determined to again ride out the political storm."
        ],
        [
            "“I want to put this behind us,” Mr. LePage said, during a meeting with a select group of reporters in his office on Wednesday morning, adding, “I will never talk about it again.”"
        ],
        [
            "Mr. LePage spoke shortly after he met with — and apologized to — Representative Drew Gattine, the state Democratic lawmaker who had been the recipient of the angry voice mail.",
            "And in meeting with reporters, Mr. LePage spoke emotionally about Maine’s heroin crisis."
        ],
        [
            "But he but did not apologize for statements he made last week that linked trafficking in the drug to blacks and Hispanics."
        ],
        [
            "“I didn’t use racially charged language,” Mr. LePage claimed, although he also said, “Let’s leave ethnicity out of it.”"
        ]
    ]
}
