{
    "source": "fox",
    "main-entities": ["Ruth Bader Ginsburg", "Donald Trump"],
    "main-event": "Ruth Bader Ginsburg criticizes Trump",
    "title": "Ginsburg under fire from both sides over ‘highly inappropriate’ Trump comments",
    "url": "http://www.foxnews.com/politics/2016/07/13/ginsburg-under-fire-from-both-sides-over-highly-inappropriate-trump-comments.html",
    "word-count": 615,
    "date": "2016-07-13",
    "uuid": "cd941022-4457-4dd5-9a9c-d7aea113b54f",
    "triplet-uuid": "8385a996-1afc-4778-a06d-7070a8f19e27",
    "body-paragraphs": [
        [
            "Supreme Court Justice Ruth Bader Ginsburg faced a growing and bipartisan backlash Wednesday -- including a call from Donald Trump to resign -- as she doubled down on her criticism of the presumptive GOP nominee, calling him a “faker” who is unqualified to be president."
        ],
        [
            "Even political figures and newspaper editorial writers who might agree with the comments swiftly said they were out of line for a high court justice."
        ],
        [
            "And Trump himself lashed out on Twitter, saying:"
        ],
        [
            "Justice Ginsburg of the U.S. Supreme Court has embarrassed all by making very dumb political statements about me.",
            "Her mind is shot - resign!"
        ],
        [
            "The liberal icon justice had kicked off the storm with comments to The New York Times published Saturday.",
            "“I can’t imagine what this place would be — I can’t imagine what the country would be -- with Donald Trump as our president.",
            "For the country, it could be four years.",
            "For the court, it could be -- I don’t even want to contemplate that,” she said."
        ],
        [
            "She doubled down late Monday, telling CNN: “He is a faker.”"
        ],
        [
            "\"He has no consistency about him.",
            "He says whatever comes into his head at the moment.",
            "He really has an ego.",
            "... How has he gotten away with not turning over his tax returns?",
            "The press seems to be very gentle with him on that,\" she said."
        ],
        [
            "Trump swiftly responded Tuesday, telling the Times it was “highly inappropriate that a United States Supreme Court judge gets involved in a political campaign.”"
        ],
        [
            "“I think it’s a disgrace to the court and I think she should apologize to the court.",
            "I couldn’t believe it when I saw it,” the presumptive Republican nominee said."
        ],
        [
            "Trump’s criticisms were echoed by Republican congressional leaders.",
            "Senate Majority Leader Mitch McConnell said Tuesday Ginsburg’s comments were “totally inappropriate.”"
        ],
        [
            "\"It raises a level of skepticism that the American people have from time to time about just how objective the Supreme Court is, whether they're over there to call the balls and strikes, or weigh in on one side or another,\" he said."
        ],
        [
            "House Speaker Paul Ryan used similar language at a CNN event Tuesday."
        ],
        [
            "\"For someone on the Supreme Court who is going to be calling balls and strikes in the future based upon whatever the next president and Congress does, that strikes me as inherently biased and out of the realm,\" Ryan said."
        ],
        [
            "Ginsburg’s comments also left Democratic lawmakers squirming."
        ],
        [
            "“We all know that the justices on the Supreme Court have political views.",
            "I’m not sure we’re well served by them airing them out in the open,” Sen. Chris Murphy, D-Conn., told Politico."
        ],
        [
            "“She may have got out over her skis a little bit and more forthright and political than she should have been.",
            "It’s very unusual,” Senate Minority Whip Dick Durbin, D-Ill., told the outlet."
        ],
        [
            "Mainstream media outlets also joined in the chorus of criticism."
        ],
        [
            "“However valid her comments may have been, though, and however in keeping with her known political bent, they were still much, much better left unsaid by a member of the Supreme Court,” The Washington Post’s editorial board said Tuesday.",
            "“Politicization, real or perceived, undermines public faith in the impartiality of the courts.”"
        ],
        [
            "The board noted the Code of Conduct for U.S. judges says that a “judge should not ... publicly endorse or oppose a candidate for public office.”"
        ],
        [
            "The New York Times also chimed in: “Washington is more than partisan enough without the spectacle of a Supreme Court justice flinging herself into the mosh pit.\""
        ],
        [
            "Wednesday morning brought some relief for the under-fire justice, with Vermont Sen. Bernie Sanders giving qualified support for her comments.",
            "While the Democratic presidential candidate declined to comment on whether her comments were appropriate, he said on ABC he agrees Trump is a \"total opportunist\" and said \"the record is quite clear that he lies just a whole lot of the time.\""
        ]
    ]
}
