{
    "source": "nyt",
    "main-entities": ["Ruth Bader Ginsburg", "Donald Trump"],
    "main-event": "Ruth Bader Ginsburg criticizes Trump",
    "title": "Donald Trump Rebukes Ruth Bader Ginsburg for Deriding His Candidacy",
    "url": "https://www.nytimes.com/2016/07/13/us/politics/ruth-bader-ginsburg-donald-trump.html?_r=0",
    "word-count": 528,
    "date": "2016-07-12",
    "uuid": "ea716473-95b1-4e2a-91b0-2645d4de07e9",
    "triplet-uuid": "8385a996-1afc-4778-a06d-7070a8f19e27",
    "body-paragraphs": [
        [
            "Donald J. Trump on Tuesday assailed Justice Ruth Bader Ginsburg of the Supreme Court for speaking out on the presidential race, calling her disdainful remarks about his candidacy “highly inappropriate” and suggesting that she owed other justices an apology."
        ],
        [
            "Mr. Trump’s remarks came in a telephone interview with The Times two days after Justice Ginsburg was quoted as saying she was frightened about what the nation would look like if he were elected."
        ],
        [
            "“I can’t imagine what this place would be — I can’t imagine what the country would be — with Donald Trump as our president,” Justice Ginsburg told The Times in an interview published Sunday.",
            "“For the country, it could be four years.",
            "For the court, it could be — I don’t even want to contemplate that.”",
            "She even joked ruefully about moving to New Zealand."
        ],
        [
            "Mr. Trump, the presumptive Republican nominee, said he found those remarks unbefitting a member of the high court."
        ],
        [
            "“I think it’s highly inappropriate that a United States Supreme Court judge gets involved in a political campaign, frankly,” Mr. Trump said.",
            "“I think it’s a disgrace to the court and I think she should apologize to the court.",
            "I couldn’t believe it when I saw it.”"
        ],
        [
            "He continued: “That she should be saying that?",
            "It’s so beneath the court for her to be making statements like that.",
            "It only energizes my base even more.",
            "And I would hope that she would get off the court as soon as possible.”"
        ],
        [
            "Mr. Trump also said he expected to announce his choice of a running mate by Friday, winding down a process that has been closely watched as in all likelihood the most significant decision he will make in his campaign."
        ],
        [
            "“I have five candidates, plus two, two that are unknown to anybody,” Mr. Trump said from Chicago, where he was raising money for his campaign."
        ],
        [
            "“I will be making a decision over the next three- to four-day period of time, and I think it will be a decision that will be a very good decision for a lot of people,” he added."
        ],
        [
            "Mr. Trump said that he was not basing his vice-presidential selection on fund-raising prowess or potential, and indicated that he had had enough experience with many of those he has been considering for the job that their tryouts on the campaign trail would not necessarily be determinative."
        ],
        [
            "“I’ve been with these people for a long time — I know them,” Mr. Trump said, specifically invoking Gov. Chris Christie of New Jersey and Newt Gingrich, the former House speaker.",
            "“Christie was excellent yesterday and Newt is excellent.” Mr. Trump will appear on Tuesday night in Indiana with Gov. Mike Pence, who has risen in the estimation of many of the nominee’s advisers."
        ],
        [
            "Mr. Trump said his decision was largely coming down to instinct.",
            "“A lot of is gut. A lot of it is,” he said.",
            "“My whole life has been about gut.”"
        ],
        [
            "He also suggested that he would consider polling in states like heavily Democratic Connecticut, which he again said he believed he could put in play in November."
        ],
        [
            "Asked for quick thoughts about each of the candidates he is known to be considering, Mr. Trump played along."
        ],
        [
            "Governor Christie? “Strong,” he said."
        ],
        [
            "Retired Lt. Gen. Mike Flynn? “A patriot.”"
        ],
        [
            "Senator Joni Ernst of Iowa? “A terrific, exciting person.”"
        ],
        [
            "Governor Pence? “Solid as a rock.”"
        ],
        [
            "And Mr. Gingrich? “Newt is Newt. He’s a good guy.”"
        ]
    ]
}
