{
    "source": "nyt",
    "main-entities": ["Donald Trump", "Vicente Fox"],
    "main-event": "Trump gets into Twitter feud with Vicente Fox",
    "title": "Vicente Fox, Ex-President of Mexico, Scoffs at Donald Trump’s Visit",
    "url": "https://mobile.nytimes.com/2016/09/01/us/politics/vicente-fox-mexico.html",
    "word-count": 371,
    "date": "2016-08-31",
    "uuid": "e986de6e-dfa2-4f2f-95de-214838376b3f",
    "triplet-uuid": "8abec8d9-50a2-480e-969a-157f94954f4d",
    "body-paragraphs": [
        [
            "Donald J. Trump is heading to Mexico on Wednesday to meet with President Enrique Peña Nieto, but one of the Mexican leader’s predecessors had a different message for the Republican presidential nominee: You are not welcome here."
        ],
        [
            "Vicente Fox, Mexico’s president from 2000 to 2006, said on Wednesday that the invitation from Mr. Peña Nieto was a mistake and that Mr. Trump should never be trusted in the country because of the way he has demonized its people."
        ],
        [
            "“He is not welcome to Mexico,” Mr. Fox told CNN.",
            "“We don’t want him. We reject his visit.”"
        ],
        [
            "Mr. Fox has been critical of Mr. Trump’s plan to build a wall on the border between the United States and Mexico and on Wednesday he shrugged off recent signs of Mr. Trump softening his plans to deport 11 million undocumented immigrants."
        ],
        [
            "“You cannot trust a guy like this,” Mr. Fox said.",
            "“How can we grant confidence and support to ideas that change everyday?",
            "He cynically continues to disregard his own people and disregard Mexicans.”"
        ],
        [
            "Despite Mr. Trump’s promises that Mexico will pay for his border wall, Mr. Fox vowed in February that it would never happen.",
            "He also called Mr. Trump a “false prophet” who was misleading his followers."
        ],
        [
            "On Wednesday, Mr. Fox expressed disbelief that Mr. Peña Nieto would invite Mr. Trump for the private meeting.",
            "He suggested that Mr. Trump was only coming as part of a “desperate” strategy to improve his sagging poll numbers and in explicit terms he urged Americans not to vote for him."
        ],
        [
            "“I cannot envision him sitting in that chair, that was the chair of President Washington, President Jefferson, President Kennedy, President Reagan,” Mr. Fox said.",
            "“He doesn’t know how to run a nation.",
            "He doesn’t even know how to run a business.”"
        ],
        [
            "As he prepared to travel to Mexico, Mr. Trump responded to Mr. Fox’s attacks, noting on Twitter that the former Mexican president once suggested that he pay the country a visit."
        ],
        [
            "Mr. Fox fired back with a Twitter post of his own, reminding Mr. Trump that he invited him to come to Mexico and personally apologize to all Mexicans."
        ],
        [
            "“Stop lying!” Mr. Fox wrote.",
            "“Mexico is not yours to play with, show some respect.”"
        ]
    ]
}
