{
    "source": "hpo",
    "main-entities": ["Donald Trump", "Vicente Fox", "Enrique Pena Nieto"],
    "main-event": "Trump gets into Twitter feud with Vicente Fox",
    "title": "Former Mexican President Vicente Fox Slams President Enrique Peña Nieto For Meeting Trump",
    "url": "https://www.huffingtonpost.com/entry/vicente-fox-enrique-pena-nieto-donald-trump_us_57c6cd8ee4b0e60d31dc3a33",
    "word-count": 454,
    "date": "2016-08-31",
    "uuid": "8f68dc8f-d6db-45b4-977b-3ba2bd56faf6",
    "triplet-uuid": "8abec8d9-50a2-480e-969a-157f94954f4d",
    "body-paragraphs": [
        [
            "Former Mexican President Vicente Fox on Wednesday harshly criticized current President Enrique Peña Nieto for inviting Republican presidential candidate Donald Trump to meet with him south of the border, just hours before he is due to give a widely anticipated speech on immigration in Arizona."
        ],
        [
            "“He is not welcome to Mexico,” Fox said in an interview on CNN.",
            "“By 130 million people, we don’t like him, we don’t want him. We reject his message.”"
        ],
        [
            "Trump tweeted Tuesday that he had accepted an invitation to meet Peña Nieto in private.",
            "An invitation had also been extended to his Democratic opponent, Hillary Clinton, but the former secretary of state’s campaign said she was looking forward to speaking with him at the “appropriate time.”"
        ],
        [
            "Trump has spent more than a year railing against Mexico and its leaders, promising the country would pay for the construction of a wall on the border it shares with the U.S., as well as fear-mongering about “rapists” and drug dealers that are coming across it."
        ],
        [
            "The surprise meeting abroad with a foreign leader will be Trump’s first as a presidential nominee, and is not without risks to his candidacy.",
            "Mitt Romney’s trip to Israel during the 2012 presidential campaign, for example, did not go over well.",
            "Peña Nieto’s approval rating fell to a record low earlier this year amid several corruption scandals.",
            "He, too, may seize on the meeting as an opportunity to bolster his image with Mexicans."
        ],
        [
            "In his interview on CNN, Fox warned Peña Nieto would be viewed like “a traitor” if he does not stand up to the GOP nominee."
        ],
        [
            "“Trump is using Mexico, using President Peña to boost his sinking poll numbers,” Fox said.",
            "“I think the President Peña is taking an enormous political risk by hosting Trump.",
            "If he’s gone soft on Trump, it will hurt him greatly.",
            "He will even be considered like a traitor because we don’t accept to be offended like we just heard, and it should not happen.",
            "He comes here with a smile on his face.",
            "I think this is a big mistake on part of President Peña.”"
        ],
        [
            "“It’s a very opportunistic move and I hope U.S. public opinion, U.S. citizens can see this and finally, and finally see what is behind Trump, this false prophet that is just cheating everybody,” he added.",
            "“It’s a desperate move and I don’t see how it can work at all.”"
        ],
        [
            "Earlier this year, Fox railed against Trump in an expletive-laden outburst, promising that Mexico would “never pay for that fucking wall.”",
            "He later apologized, and even invited Trump “to come to Mexico and to learn about the real Mexico.”"
        ],
        [
            "Trump noted so helpfully in a tweet Wednesday morning."
        ],
        [
            "“Former President Vicente Fox, who is railing against my visit to Mexico today, also invited me when he apologized for using the “f bomb.””"
        ],
        [
            "Fox tweeted his own recollection in response:"
        ],
        [
            "“, I invited you to come and apologize to all Mexicans.",
            "Stop lying! Mexico is not yours to play with, show some respect.”"
        ]
    ]
}
