{
    "source": "nyt",
    "main-entities": ["Vicente Fox", "Felipe Calder", "Donald Trump"],
    "main-event": "Fox and Calder say Mexico isn't paying for border wall",
    "title": "Vicente Fox and Felipe Calderón, 2 Ex-Presidents of Mexico, Say No Way Country Is Paying for Donald Trump's Wall",
    "url": "https://www.nytimes.com/politics/first-draft/2016/02/25/2-ex-presidents-of-mexico-say-no-way-theyre-paying-for-donald-trumps-wall/",
    "word-count": 327,
    "date": "2016-02-25",
    "uuid": "9eaef0d4-421f-4eaf-a256-e2494ed0efae",
    "triplet-uuid": "d4a4bc34-e48b-4485-86b2-f1daf4d464dd",
    "body-paragraphs": [
        [
            "At almost all of his campaign rallies, Donald J. Trump leads a familiar refrain as he details his plan to build a giant wall along the border with Mexico."
        ],
        [
            "“Who’s gonna pay?” he asks."
        ],
        [
            "Without fail, Mr. Trump’s adoring fans reply, “Mexico!”"
        ],
        [
            "While the Mexican government has said little about Mr. Trump’s plan to beef up border security, two of the country’s former presidents have a message for Mr. Trump: Mexico won’t pay."
        ],
        [
            "“I’m not going to pay,” Vicente Fox said, using a profanity to comment about the wall Thursday in an interview with Fusion.",
            "“He should pay for it. He’s got the money.”"
        ],
        [
            "Mr. Fox, who was president of Mexico from 2000 to 2006, was clear in his opposition to Mr. Trump, calling him “egocentric” and lacking in any political values.",
            "Mr. Fox also expressed disbelief that Mr. Trump did well with Hispanic voters in the Nevada caucuses on Tuesday and called on them to open their eyes."
        ],
        [
            "“I’d like to know who those Hispanics are,” Mr. Fox said.",
            "“They are followers of a false prophet.”"
        ],
        [
            "Mr. Fox’s successor, Felipe Calderón, expressed similar concerns about the wall this month."
        ],
        [
            "“Mexican people, we are not going to pay any single cent for such a stupid wall!” Mr. Calderón told CNBC.",
            "“And it’s going to be completely useless.”"
        ],
        [
            "Mr. Calderón, who was president from 2006 until 2012, went on to argue that Mr. Trump was misinformed about the flow of immigrants from Mexico to the United States and that closing the border would harm America’s economy."
        ],
        [
            "For his part, Mr. Trump has insisted that as president he would have the leverage to compel Mexico to pay for the wall, which he estimates would cost about $8 billion."
        ],
        [
            "On Thursday, however, he appeared to be more angered by Mr. Fox’s tone.",
            "Mr. Trump, who has been criticized for lacing his campaign speeches with profanity, called on Mr. Fox to apologize for using foul language when talking about the wall."
        ]
    ]
}
