{
    "uuid": "c356e514-a20d-45e3-b1ad-159636013822",
    "keywords": "The Caucus",
    "source": "NYT",
    "main-entities": ["Mary Cheney", "Liz Cheney"],
    "main-event": "Mary Cheney criticizes sister Liz on same-sex marriage",
    "url": "https://thecaucus.blogs.nytimes.com/2013/08/31/mary-cheney-criticizes-her-sister-on-same-sex-marriage/?smid=tw-share&_r=0",
    "title": "Mary Cheney Criticizes Her Sister on Same-Sex Marriage",
    "date": "2013-08-31",
    "triplet-uuid": "11c9f251-35c8-4452-b052-df9be61464c6",
    "word-count": 488,
    "body-paragraphs": [
        [
            "Mary Cheney, the younger sister of Liz Cheney, a Wyoming Senate candidate, sharply criticized her sister’s stance on same-sex marriage and urged her own Facebook friends to share the message."
        ],
        [
            "Posting on Facebook on Friday evening, Mary Cheney, who is gay and married her longtime partner last year, wrote: “For the record, I love my sister, but she is dead wrong on the issue of marriage.”"
        ],
        [
            "Their father, former Vice President Dick Cheney, supports same-sex marriage, and the younger Cheney echoed some of his language on the issue when she added, “Freedom means freedom for everyone.”"
        ],
        [
            "“That means that all families — regardless of how they look or how they are made — all families are entitled to the same rights, privileges and protections as every other,” Mary Cheney wrote."
        ],
        [
            "Earlier Friday, Liz Cheney revealed her position on same-sex marriage, a topic she has kept relatively quiet about since declaring her candidacy in July against incumbent Senator Mike Enzi, Republican of Wyoming."
        ],
        [
            "“I am not pro-gay marriage,” Liz Cheney said in a statement responding to an apparent push poll against her in Wyoming.",
            "“I believe the issue of marriage must be decided by the states, and by the people in the states, not by judges and not even by legislators, but by the people themselves.”"
        ],
        [
            "That position — deferring to the will of the voters on a state-by-state basis — may represent something of a compromise between total support or opposition.",
            "But it did little to placate her sister."
        ],
        [
            "“It’s not something to be decided by a show of hands,” Mary Cheney wrote."
        ],
        [
            "And to emphasize that she was not shying away from drawing attention to her view, Mary Cheney concluded her Facebook post: “Please like and share if you agree.”"
        ],
        [
            "In an e-mail, Mary Cheney declined to comment further on her sister’s position, saying she would let her Facebook post speak for itself."
        ],
        [
            "The Cheney family dispute mirrors the broader disagreement among Republicans on same-sex marriage.",
            "Less than a decade after George W. Bush and Dick Cheney won re-election in part thanks to conservative enthusiasm over enshrining traditional marriage into law, some in the party believe they are losing voters, particularly younger ones, over an issue on which public opinion has changed rapidly.",
            "But other Republicans believe traditional marriage is a pillar of family values, and in some cases are reluctant to abandon their social conservative base on the issue."
        ],
        [
            "Liz Cheney’s stance underlines the degree to which full-throated support for same-sex marriage, even in a libertarian-leaning state like Wyoming, still poses a political risk in a Republican primary."
        ],
        [
            "Mr. Enzi opposes legalizing same-sex marriage."
        ]
    ]
}
