{
    "source": "fox",
    "main-entities": ["Hillary Clinton","State Department officials", "Obama administration"],
    "main-event": "White House releases e-mails relating to the Benghazi talking points",
    "title": "Benghazi emails underscore State Department’s concern over failure to act on warnings",
    "url": "http://www.foxnews.com/politics/2013/05/13/benghazi-emails-underscore-state-departments-concern-over-failure-to-act-on/?intcmp=related",
    "word-count": 749,
    "date": "2013-05-13",
    "uuid": "cb62fdc6-242a-4a95-9f03-44e1a1cd7ba2",
    "triplet-uuid": "1bb79cc1-5d69-4136-a23d-6dbd300cbf25",
    "body-paragraphs": [
        [
            "The resurgent controversy over the Obama administration's initial story-line on the Benghazi attack underscores State Department concerns about the leadership's failure to act on documented warnings and security incidents."
        ],
        [
            "Draft \"talking points\" obtained by The Weekly Standard and ABC News depicted efforts by State Department spokeswoman Victoria Nuland in the days after the attack to strip out references to prior attacks in Benghazi.",
            "According to the excerpts, she argued that the administration should not give Congress ammunition to \"beat up\" on her department."
        ],
        [
            "During a press conference Monday, President Obama even acknowledged that the country now knows that \"clearly (the staff in Benghazi) were not in a position where they were adequately protected.\""
        ],
        [
            "A review of now-public State Department records as well as a classified State Department cable, first reviewed and reported by Fox News, shows a steady stream of documented warnings to Washington from intelligence and State security officials on the ground in Libya that the Islamist threat was severe and growing."
        ],
        [
            "One of the most significant warnings was an August 2012 State Department classified cable, which has not been made public, that summarized an emergency meeting in Benghazi where the CIA briefed on the significant threat of terrorist activity."
        ],
        [
            "The cable, sent under Ambassador Chris Stevens' signature and marked SECRET, warned the office of Secretary of State Clinton that the CIA advised \"ten Islamist militias and AQ training camps (were) within Benghazi.\""
        ],
        [
            "The cable also warned that the 17 February Brigade, the group charged with protecting the consulate, appeared to be compromised.",
            "It said \"requests to provide a daily police presence have gone unanswered,\" adding there was also a \"lack of host nation security support to the US mission.\""
        ],
        [
            "In addition to identifying the presence of Al Qaeda and Ansar al-Sharia in Benghazi, the groups ultimately blamed for the assault, a key section of the cable, which remains classified, seemed to foreshadow the attack itself."
        ],
        [
            "\"RSO (Regional Security Officer) expressed concerns with the ability to defend Post in the event of a coordinated attack due to limited manpower, security measures, weapons capabilities, host nation support, and the overall size of the compound,\" it said."
        ],
        [
            "During congressional hearings in January, Clinton was asked whether she had seen the cable by Republican Rep. Michael McCaul.",
            "Clinton said she had no knowledge of the warning which former diplomatic security agents have told Fox News amounted to a \"cry for help.\""
        ],
        [
            "\"Congressman, that cable did not come to my attention,\" Clinton testified before the House Foreign Affairs committee.",
            "\"I have made it very clear that the security cable did not come to my attention or above the assistant secretary level where the ARB (Accountability Review Board) placed responsibility where, as I think, Ambassador Pickering said the rubber hit the road.\""
        ],
        [
            "In February, Republican Sen. Lindsey Graham followed up on the classified cable."
        ],
        [
            "After the chairman of the Joint Chiefs of Staff confirmed he knew about the cable which summarized the August emergency meeting in Benghazi, Graham questioned why the military was read in when Clinton apparently was not."
        ],
        [
            "Gen. Martin Dempsey responded: \"Well, I don't know that she didn't know about the cable.\""
        ],
        [
            "Graham said: \"She said she didn't. Are you stunned that she didn't?\""
        ],
        [
            "Dempsey said: \"I would call myself surprised that she didn't.\""
        ],
        [
            "In addition to attacks in Benghazi on the British ambassador -- which forced the temporary closure of the U.K. operation -- the International Red Cross and United Nations, in the summer of 2012 the group Ansar al-Sharia was so well-established it held an annual conference in Benghazi to promote Islamic law."
        ],
        [
            "Records released by the House oversight committee, including a report from the regional security officer, also documented more than 200 cases of violence in Libya in the year leading up to the attack, specifically between June 2011 and July 2012.",
            "Another security review, on June 25, 2012, reported a spike in violence with \"foreigners also increasingly targeted.\""
        ],
        [
            "While much has been made of the State Department's failure to respond to repeated security requests for extra help, a former diplomatic security agent and 20-year veteran of the department, who reviewed the publicly available documents on the condition of anonymity, told Fox News the multiple warnings present a compelling argument that State Department leadership was negligent."
        ],
        [
            "The State Department, in a document put out last week, noted that while an internal review found certain senior officials \"demonstrated a lack of proactive leadership and management ability\" in response to security concerns, there was no specific finding of misconduct."
        ]
    ]
}
