{
    "source": "hpo",
    "main-entities": ["Barack Obama"],
    "main-event": "President Barack Obama unveiled on Wednesday the most sweeping effort at gun control policy reform in a generation",
    "title": "Obama Gun Control Proposals Unveiled, Marking Biggest Legislative Effort In A Generation",
    "url": "https://www.huffingtonpost.com/2013/01/16/obama-gun-control-proposals_n_2486919.html",
    "word-count": 1124,
    "date": "2013-01-16",
    "uuid": "2052529f-cc0f-4e4d-9221-2236094f7de6",
    "triplet-uuid": "526cabb7-02a3-4adb-8e90-ec781c40c498",
    "body-paragraphs": [
        [
            "Obama Gun Control Proposals Unveiled, Marking Biggest Legislative Effort In A Generation"
        ],
        [
            "WASHINGTON -- In a bold and potentially historic attempt to stem the increase in mass gun violence, President Barack Obama unveiled on Wednesday the most sweeping effort at gun control policy reform in a generation."
        ],
        [
            "\"This is our first task as a society: keeping our children safe.",
            "This is how we will be judged,\" Obama said.",
            "“We can’t put this off any longer.\""
        ],
        [
            "The proposal, which comes at the end of a month-long review process spearheaded by Vice President Joe Biden, is broken down into four key subsections: law enforcement, the availability of dangerous firearms and ammunition, school safety and mental health."
        ],
        [
            "In an effort to touch on all four of those elements, the president recommended requiring criminal background checks for all gun sales; reinstating the assault weapons ban; restoring a 10-round limit on ammunition magazines; eliminating armor-piercing bullets; providing mental health services in schools; allocating funds to hire more police officers; and instituting a federal gun trafficking statute, among other policies.",
            "The cost of the package, senior officials estimated, would be roughly $500 million, some of which could come from already budgeted funds."
        ],
        [
            "Because these recommendations require congressional approval, the administration is supplementing its proposal with 23 executive actions that will be taken immediately.",
            "Those actions include requiring federal agencies to hand over relevant data for a background check system; providing law enforcement officials, first responders and school officials with better training for active shooting situations; directing the Centers for Disease Control to research the causes and prevention of gun violence; and many more."
        ],
        [
            "\"I intend to use whatever weight this office holds to make them a reality,\" said the president, speaking about his full set of recommendations.",
            "\"If there's even one life that can be saved, then we've got an obligation to try.\""
        ],
        [
            "The approach is so sweeping that what would have otherwise been a headline-grabbing announcement received second billing.",
            "The president on Wednesday will nominate Byron Todd Jones, the acting director of the Bureau of Alcohol, Tobacco, Firearms and Explosives, to take over the post permanently."
        ],
        [
            "In total, the proposal goes beyond what most gun control advocates were hoping for at the start of Biden's review process, during which he held 22 different meetings with 229 different organizations and 31 elected officials."
        ],
        [
            "\"This is a monumental moment.",
            "It's a long time coming and we're thrilled the president's putting the full weight of his office behind this,\" said Josh Horowitz, executive director of the Coalition to Stop Gun Violence.",
            "\"We're ready to push this thing through.\""
        ],
        [
            "But putting together ideas is the easy part.",
            "Selling them on the Hill will take a bit of legislative craft."
        ],
        [
            "Seasoned political observers have questioned whether it makes more sense to break the package into separate bills or push for one comprehensive proposal.",
            "A senior administration official said that the president's proposal shouldn't be considered finalized legislative language, but rather a series of recommendations for Congress to consider.",
            "The president would be working with lawmakers to move the process forward, the official added, and would be trying to build up public opinion as well."
        ],
        [
            "\"I will put everything I've got into this and so will Joe [Biden].",
            "But I tell you, the only way we can change is if the American people demand it,\" said Obama.",
            "\"We are going to need voices in those areas and congressional districts where the tradition of gun ownership is strong.\""
        ],
        [
            "\"It can't just be the usual suspects,\" he continued.",
            "\"This will not happen unless the American people demand it.\""
        ],
        [
            "The gun-rights lobby has already signaled that it will try to block the administration's effort.",
            "A spokesman for the National Rifle Association did not immediately respond to requests for comment on the president's proposal.",
            "But the organization has already harshly criticized the Obama administration for overreach."
        ],
        [
            "\"It is unfortunate that this administration continues to insist on pushing failed solutions to our nation's most pressing problems,\" the NRA said after meeting with Biden last week.",
            "\"We will not allow law-abiding gun owners to be blamed for the acts of criminals and madmen.\""
        ],
        [
            "The group continued its offensive this week, launching an advertising campaign attacking Obama as an \"elitist hypocrite\" for opposing the NRA's widely-criticized proposal, made after the Newtown, Conn. shooting, to place armed guards in all of the nation's schools."
        ],
        [
            "But that attack appeared a bit premature.",
            "As part of its policy recommendations, the White House called on Congress to act on an old administration proposal to spend $4 billion to keep 15,000 cops on the streets.",
            "In addition, the president is proposing a new initiative that would incentivize police departments to hire more school resource officers and encourage schools to hire more mental health professionals.",
            "The president's plan also calls on Congress to allocate resources to help schools, other educational institutions and houses of worship develop emergency management plans."
        ],
        [
            "The White House proposals, even officials there admit, are not a cure-all for mass shootings.",
            "Among the suggested recommendations on the gun-policy front, only the ban on high-capacity magazines could have had a tangible impact on the shooting in Newtown, and it's unclear what, exactly, the effect would have been."
        ],
        [
            "Moreover, the administration is pointedly not going after those weapons and ammunition magazines that are currently and lawfully owned.",
            "The proposal would instead affect the future production and sale of military-style weapons or high-capacity magazines."
        ],
        [
            "\"We are not going to go after existing stock of weapons or magazines,\" said a senior administration official.",
            "\"We are going to limit it to the manufacturing of assault weapons and clips going forward.\""
        ],
        [
            "The White House nevertheless insists that its package of proposals has teeth.",
            "It would provide law enforcement with the mechanisms needed to go after the illegal transfer of weapons and help prevent those weapons from falling into the wrong hands.",
            "It would also stem the use of military-style weapons -- the White House says its proposal would improve on the 1994 Assault Weapons Ban, which was riddled with loopholes -- and give schools and communities resources to address violence when it occurs."
        ],
        [
            "The question, in some respects, is not what's missing from the set of ideas, but what took the administration so long to get to this point."
        ],
        [
            "\"It is not as though we had this whole policy paper sitting on the shelf somewhere,\" said a senior administration official.",
            "\"[We worked] 24/7 for the past month.",
            "And we met with a lot of groups and we learned a lot of ideas that came as a result of this process.",
            "We tried to be as comprehensive as possible.",
            "We are hoping that as the process goes on and as the debate goes on, we might come up with some other ideas.\""
        ]
    ]
}
