{
    "source": "hpo",
    "main-entities": ["Asa Hutchinson", "National Rifle Association"],
    "main-event": "NRA and Hutchinson recommends schools to have armed staff",
    "title": "NRA School Safety Report Recommends Arming Teachers, Loosening Gun Laws",
    "url": "https://www.huffingtonpost.com/2013/04/02/nra-school-safety-report_n_2999968.html",
    "word-count": 725,
    "date": "2013-04-02",
    "uuid": "ce6cf2d5-7b58-4b09-8641-a030301a38bf",
    "triplet-uuid": "68748e7f-cf6e-4ac7-8504-454c0876880d",
    "body-paragraphs": [
        [
            "NRA School Safety Report Recommends Arming Teachers, Loosening Gun Laws"
        ],
        [
            "WASHINGTON -- Former Rep. Asa Hutchinson (R-Ark.) on Tuesday released a 225-page report on school safety funded by the National Rifle Association.",
            "The report, commissioned in the wake of the Sandy Hook Elementary School shooting, recommended properly trained armed employees to provide \"an important layer of security in schools.\""
        ],
        [
            "The report was prepared by a 12-person task force, called the School Shield Program, led by Hutchinson.",
            "At Tuesday's press conference, he stated that its findings were independent of the nation's largest gun lobby."
        ],
        [
            "\"Teachers should teach, but if there is personnel that has interest and is willing to go through 40 to 60 hours of [firearms] training, then schools should be willing to [arm them],\" Hutchinson said.",
            "He added that the report found that \"local school authorities are in the best position\" to determine their own school security measures, \"specifically whether an armed security guard is necessary and supported by the education and citizen community.\""
        ],
        [
            "The task force recommended that schools designate willing staff to be armed and trained, and it proposed a model training program, 40-60 hours per person, at what Hutchinson said would be a cost of about $800 to $1,000 per trained employee.",
            "Armed school personnel, called school resource officers, would also be required to undergo a \"background investigation, testing, and [have] relevant experience.\""
        ],
        [
            "The committee didn't recommend any specific kind of firearm for school security, Hutchinson said, adding, \"Everything from a sidearm, to a shotgun, to an AR-15\" would work."
        ],
        [
            "The task force also suggested that states loosen current legal restrictions on who can carry a firearm on school property.",
            "Many states currently prohibit anyone but a law enforcement officer from possessing guns in a school."
        ],
        [
            "Other recommendations included creating threat assessment teams at schools, better coordinating state and federal funding for school security, and offering an online assessment tool, so that administrators can evaluate their schools' potential security gaps."
        ],
        [
            "Hutchinson's report and his press conference were both met with scathing criticism from the American Federation of Teachers, which supports broader gun control measures and strongly opposes arming educators.",
            "In a statement, union President Randi Weingarten called the report \"a cruel hoax that will fail to keep our children and schools safe,\" adding that the findings \"are simply designed to assist gun manufacturers flood the nation and our schools with more guns.\""
        ],
        [
            "The NRA also put out a statement on the report, over which the gun lobby insists it had no influence.",
            "The NRA said it needs \"time to digest\" the findings, but it commended Hutchinson and his team for contributions that \"will go a long way to making America's schools safer.\""
        ],
        [
            "The report marks the culmination of a controversial process that began in December, when NRA CEO Wayne LaPierre held a press conference the week after the shooting in Newtown, Conn.",
            "At the time, LaPierre assailed the media and gun control advocates for their responses to the massacre, and he proposed that armed volunteers protect schools and that gun-free school zones be eliminated.",
            "The speech was widely considered a public relations disaster."
        ],
        [
            "Hutchinson said Tuesday that the idea of armed volunteers was scrapped after it was met with \"great reluctance\" from school employees.",
            "But the recommendation that states allow non-law enforcement officers, such as teachers and principals, to carry guns in schools would essentially eliminate gun-free school zones."
        ],
        [
            "Asked about the current debate in Congress over gun control legislation, Hutchinson said he had \"not dealt with the separate debate\" because he had been too busy considering school safety issues."
        ],
        [
            "He did, however, weigh in on state gun control efforts currently being debated in Connecticut, which include a ban on high-capacity magazines and a broader assault weapons ban.",
            "Hutchinson called them \"totally inadequate.\""
        ],
        [
            "\"You can address assault weapons, but it doesn't stop violence in schools.",
            "So if you're going to protect children, you have to do something about enhancing school safety,\" he said."
        ],
        [
            "Hutchinson also encouraged the NRA to continue funding pilot programs to train school employees to carry weapons."
        ],
        [
            "When he had finished introducing the report, Hutchinson called up Mark Mattioli, whose 6-year-old son, James Mattioli, was killed in December along with 19 other children at Sandy Hook Elementary School.",
            "Mattioli praised the NRA \"for coming up and spending the time and resources on putting a program like this together.\""
        ]
    ]
}
