{
    "source": "nyt",
    "main-entities": ["Asa Hutchinson", "National Rifle Association"],
    "main-event": "NRA and Hutchinson recommends schools to have armed staff",
    "title": "N.R.A. Details Plan for Armed School Guards",
    "url": "http://www.nytimes.com/2013/04/03/us/nra-details-plan-for-armed-school-guards.html?n=Top/Reference/Times%20Topics/People/S/Stolberg,%20Sheryl%20Gay?ref=sherylgaystolberg&_r=0",
    "word-count": 729,
    "date": "2013-04-02",
    "uuid": "a550672c-45e6-42e2-b05a-93d025d0227c",
    "triplet-uuid": "68748e7f-cf6e-4ac7-8504-454c0876880d",
    "body-paragraphs": [
        [
            "Report Sees Guns as Path to Safety in Schools"
        ],
        [
            "WASHINGTON — With the Senate set to debate gun control this month, a National Rifle Association task force released a 225-page report on Tuesday that called for armed police officers, security guards or staff members in every American school, and urged states to loosen gun restrictions to allow trained teachers and administrators to carry weapons."
        ],
        [
            "Asa Hutchinson, a former Republican congressman from Arkansas who led the task force, unveiled the report at a packed news conference with unusually heavy security, including a bomb-sniffing yellow Labrador retriever.",
            "A dozen officers in plain clothes and uniforms stood watch as he spoke; one warned photographers to “remain stationary” during the event."
        ],
        [
            "Among the study’s central conclusions is that “the presence of armed security personnel adds a layer of security and diminishes response time” in a shooting, Mr. Hutchinson said.",
            "He cited a 1997 Mississippi case in which an assistant principal ran to his truck to retrieve a .45-caliber semiautomatic pistol and subdued a gunman who had killed two students."
        ],
        [
            "The recommendations — which also included expanding the police presence in schools — drew immediate criticism from gun control advocates and many Democrats, who have been fighting to tighten gun restrictions after the massacre at Sandy Hook Elementary School in Newtown, Conn., in December."
        ],
        [
            "“Arming the teacher is merely a response to the last tragedy,” said Representative Mike Thompson, a California Democrat who is chairman of a House task force on gun violence.",
            "“The one before that was in a shopping mall in Oregon, and the one before that was in a movie theater in Colorado.",
            "I don’t think the proper response is to arm all the projectionists in the movie theaters or all the vendors in the mall.”"
        ],
        [
            "After the Newtown shooting, Wayne LaPierre, the rifle association’s executive director, announced that it would devise a plan to put armed guards in every school.",
            "Technically, Mr. Hutchison’s task force is independent of the rifle association, even though it paid for the study, and Mr. LaPierre was not present on Tuesday.",
            "But critics see no distinction between the two."
        ],
        [
            "Marian Wright Edelman, president of the Children’s Defense Fund, an advocacy group here, criticized the study as “nothing more than a continuation of the N.R.A.’s attempts to prey on America’s fears, saturate our schools with more guns and turn them into armed fortresses.”"
        ],
        [
            "But the report did get support from at least one Newtown parent: Mark Mattioli, whose 6-year-old son, James, was killed."
        ],
        [
            "“I think politics needs to be set aside here, and I hope this doesn’t lead to name-calling,” said Mr. Mattioli, who joined Mr. Hutchinson at the news conference.",
            "“This is a recommendation for solutions, real solutions that will make our kids safer.",
            "That’s what we need.”"
        ],
        [
            "At least one state, Indiana, is considering the idea of armed officers at schools.",
            "On Tuesday, a proposal that would require public and charter schools to have an armed “protection officer” on school property during class hours passed a State House committee."
        ],
        [
            "The task force panel called on the Departments of Homeland Security, Education and Justice to coordinate school safety efforts and provide grant money for schools to assess their ability to prevent and respond to attacks.",
            "It recommended that officers or employees who are armed take a 40- to 60-hour training course to be developed by the rifle association based on a model the task force has designed."
        ],
        [
            "The group also called on states to require schools to develop security plans."
        ],
        [
            "But how and whether the task force recommendations will be put into effect — and the cost — was unclear."
        ],
        [
            "The timing of Tuesday’s announcement was not a coincidence: Congress will wrap up its spring recess after this week and is expected to consider gun legislation after lawmakers return.",
            "President Obama has called for tough new controls on gun ownership, but the prospects for such legislation are murky — a testimony to the rifle association’s prowess as a lobbying force."
        ],
        [
            "A plan to revive and revamp a ban on assault weapons, which expired in 2004, is almost certain to be defeated.",
            "Mr. Obama is pushing for a measure that would impose mandatory background checks for gun buyers, and the Senator Harry Reid, Democrat of Nevada, the majority leader, has promised to present a bill that would expand background checks to the floor for a vote."
        ]
    ]
}
