{
    "source": "fox",
    "main-entities": ["joint tax rule for homosexual couples"],
    "main-event": "Legally married same-sex couples will now be allowed to file federal joint tax returns",
    "title": "IRS extends tax benefits to married gay couples",
    "url": "http://www.foxnews.com/politics/2013/08/29/irs-issues-tax-rules-for-married-gay-couples/?test=latestnews",
    "word-count": 293,
    "date": "2013-08-29",
    "uuid": "8c2e4c5e-ac2b-4728-99bc-4e114c641bde",
    "triplet-uuid": "70c744ad-e950-445c-8a7a-0782b0a7d20b",
    "body-paragraphs": [
        [
            "WASHINGTON – Legally married same-sex couples will now be allowed to file federal joint tax returns, the IRS and Treasury Department announced Thursday.",
            "The ruling allows homosexual couples to receive the same tax benefits that heterosexual couples do when filing jointly."
        ],
        [
            "Thursday’s announcement comes on the heels of a historic decision by the U.S. Supreme Court, which overturned a part of the Defense of Marriage Act earlier this year."
        ],
        [
            "Questions were raised following the high court’s decision on how the federal government would treat same-sex couples whose home states don’t recognize gay marriage."
        ],
        [
            "The rules issued Thursday said the policies would affect all legally married gay couples regardless of where they live.",
            "The rules, though, would not apply to domestic partnerships and civil unions."
        ],
        [
            "\"Today's ruling provides certainty and clear, coherent tax filing guidance for all legally married same-sex couples nationwide.",
            "It provides access to benefits, responsibilities and protections under federal tax law that all Americans deserve,\" Treasury Secretary Jacob Lew said in a written statement."
        ],
        [
            "Human Rights Campaign President Chad Griffin said that, because of today’s ruling, “committed and loving gay and lesbian married couples will now be treated equally under our nation’s federal tax laws, regardless of what state they call home.”"
        ],
        [
            "He added, “These families finally have access to crucial tax benefits and protections previously denied to them under the discriminatory Defense of Marriage Act.”"
        ],
        [
            "Not everyone was on board with the decision."
        ],
        [
            "Brian Brown, president of the National Organization of Marriage, believes that giving same sex couples the right to file jointly “continues a pattern of lawlessness” across the country."
        ],
        [
            "\"The Obama administration is intent on forcing same-sex 'marriage' on an unwilling public,\" Brown said in a written statement.",
            "\"Congress alone has the responsibility of determining federal tax law.\""
        ]
    ]
}
