{
    "source": "hpo",
    "main-entities": ["joint tax rule for homosexual couples"],
    "main-event": "Legally married same-sex couples will now be allowed to file federal joint tax returns",
    "title": "Same-Sex Married Couples To Get Federal Tax Recognition Regardless Of State",
    "url": "http://www.huffingtonpost.com/2013/08/29/same-sex-couples-federal-taxes_n_3837444.html",
    "word-count": 558,
    "date": "2013-08-29",
    "uuid": "f6994655-46b7-46bf-81a5-b771922efeec",
    "triplet-uuid": "70c744ad-e950-445c-8a7a-0782b0a7d20b",
    "body-paragraphs": [
        [
            "WASHINGTON -- The U.S. Department of the Treasury announced Thursday that when it comes to taxes, it will recognize same-sex couples' marriages even if they live in a state that does not."
        ],
        [
            "The decision, which was prompted by the U.S. Supreme Court’s ruling to overturn the Defense of Marriage Act, marks the latest political progress for the lesbian, gay, bisexual and transgender community."
        ],
        [
            "Prior to this spring, the Internal Revenue Service did not recognize same-sex married couples pursuant to section 3 of DOMA.",
            "Once DOMA was overturned in June, the question became: What about same-sex married couples who moved to a state that didn’t recognize their marriage (a couple married in Massachusetts who moved to Arkansas, for example)?"
        ],
        [
            "Thursday’s ruling by Treasury Secretary Jacob Lew provides a uniform policy for the IRS; the state of celebration -- where the wedding took place -- now trumps the state of residency when it comes to federal tax status for same-sex married couples."
        ],
        [
            "“Today’s ruling provides certainty and clear, coherent tax filing guidance for all legally married same-sex couples nationwide.",
            "It provides access to benefits, responsibilities and protections under federal tax law that all Americans deserve,” Lew said in a statement.",
            "“This ruling also assures legally married same-sex couples that they can move freely throughout the country knowing that their federal filing status will not change.”"
        ],
        [
            "The new policy, which was first shared by Lew in a conference call that included LGBT advocates, holds a bit of political significance.",
            "It was the burden of federal tax law on same-sex couples, after all, that prompted the legal challenge to DOMA in the first place."
        ],
        [
            "Edie Windsor, the plaintiff in the DOMA case, sued the government after being forced to pay estate taxes following the death of her wife, Thea Spyer.",
            "Had they been a heterosexual couple, Windsor's tax burden would have been zero.",
            "After DOMA was overturned, it was reported that the IRS owed Windsor $363,053."
        ],
        [
            "Under the new Treasury policy, all federal tax provisions where marriage is a factor, including filing status, employee benefits, IRA contributions, earned income, child tax credits, and income, gift and estate taxes, will apply to same sex couples regardless of where they live.",
            "On the flip side, gay couples also will now be subjected to the so-called marriage penalty, in which some (usually upper-middle class) joint filers incur a higher tax burden than they would if they filed as single people."
        ],
        [
            "The policy only applies to married couples, and not those in domestic partnerships or same-sex unions."
        ],
        [
            "“With today’s ruling, committed and loving gay and lesbian married couples will now be treated equally under our nation’s federal tax laws, regardless of what state they call home,” said Human Rights Campaign President Chad Griffin.",
            "“These families finally have access to crucial tax benefits and protections previously denied to them under the discriminatory Defense of Marriage Act.”"
        ],
        [
            "The Treasury’s actions on Thursday are just the latest in a set of LGBT policies offered by agencies within the Obama administration following the DOMA ruling.",
            "The Federal Election Commission, and Departments of Health and Human Services and Homeland Security, also extended federal benefits to gay couples in states that don’t recognize their marriages."
        ],
        [
            "UPDATE: Commenting on the Treasury Department's new policy, Edie Windsor hailed the decision as the precise remedy that she sought when she challenged the constitutionality of DOMA."
        ]
    ]
}
