{
    "source": "fox",
    "main-entities": ["Lois Lerner"],
    "main-event": "IRS official who refused to testify facing more scrutiny over scandal",
    "title": "IRS official who refused to testify facing more scrutiny over scandal, past",
    "url": "http://www.foxnews.com/politics/2013/05/23/irs-official-who-refused-to-testify-facing-more-scrutiny-over-scandal-past/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+foxnews%2Fmost-popular+%28Internal+-+Most+Popular+Content%29",
    "word-count": 466,
    "date": "2013-05-23",
    "uuid": "7a1a604b-37ac-476f-8cdb-2e7c98705171",
    "triplet-uuid": "84678e18-0b79-4570-9c9f-cb1cf88d968e",
    "body-paragraphs": [
        [
            "The IRS official who refused to testify at a House hearing Wednesday has become a key focus of the congressional investigations into the IRS practice of singling out conservative groups."
        ],
        [
            "Now under the protection of her lawyers and the Fifth Amendment, Lois Lerner is facing a maelstrom of controversy."
        ],
        [
            "Members of Congress are calling her evasive, and question why she didn't reveal the program sooner -- plus her history at the Federal Elections Commission is coming under scrutiny."
        ],
        [
            "Lerner touched off the public controversy when, at an American Bar Association conference earlier this month, she apologized for the IRS' practice of targeting conservative organizations for additional scrutiny.",
            "It was the first time the agency acknowledged the practice."
        ],
        [
            "\"They used names like Tea Party or patriots ... and they selected cases simply because the application had those names in the title,\" she admitted."
        ],
        [
            "She said she hadn't revealed the information sooner, because she was never asked.",
            "But just two days before the ABA conference, Lerner was specifically asked about the investigation."
        ],
        [
            "Rep. Joseph Crowley, D-N.Y., asked her if she could \"comment briefly on the status on the IRS investigation into these political not-for-profits.\""
        ],
        [
            "She said: \"Well there's a questionnaire that began this discussion and there's also a questionnaire out there that is seeking info from 501 c3,4,5 organizations.\""
        ],
        [
            "Crowley later called her answer evasive."
        ],
        [
            "\"The bottom line is you cannot lie to Congress, and you cannot be evasive, you cannot try to mislead Congress,\" he said."
        ],
        [
            "In the 1990's, Lerner also served as chief of enforcement at the Federal Elections Commission."
        ],
        [
            "Under her direction, the FEC undertook the largest enforcement action in its history -- suing the Christian Coalition for violating campaign laws.",
            "The Christian Coalition won, but in one deposition, FEC lawyers asked a defendant if televangelist Pat Robertson prayed for him."
        ],
        [
            "James Bopp, the Christian Coalition's lawyer, said he was \"shocked and appalled\" by that."
        ],
        [
            "\"Both political activity and religious activity are specifically protected by the First Amendment,\" he said."
        ],
        [
            "When Bopp learned years later that Lerner had been promoted to an IRS position, he became concerned."
        ],
        [
            "\"She was in effect being promoted for what she had done at the Federal Election Commission and now was going to be expected ... to replicate that at the IRS and now we know that's exactly what happened,\" he said."
        ],
        [
            "Lerner is represented by lawyer William W. Taylor, who is noted for winning a dismissal of all charges against former IMF director Dominique Strauss-Kahn in a high-profile sexual assault case."
        ],
        [
            "Lerner said at Wednesday's hearing that she had done nothing wrong."
        ],
        [
            "\"I have not done anything wrong,\" she said.",
            "\"I have not broken any laws. I have not violated any IRS rules or regulations, and I have not provided false information to this or any other congressional committee.\""
        ]
    ]
}
