{
    "source": "nyt",
    "main-entities": ["Hillary Clinton", "Republican Lawmakers"],
    "main-event": "Clinton Defends Her Actions Before and After Libya Attack",
    "title": "Facing Congress, Clinton Defends Her Actions Before and After Libya Attack",
    "url": "http://www.nytimes.com/2013/01/24/us/testifying-on-benghazi-clinton-cites-new-security-steps.html?n=Top%2FReference%2FTimes%20Topics%2FPeople%2FC%2FClinton%2C%20Hillary%20Rodham",
    "word-count": 1192,
    "date": "2013-01-23",
    "uuid": "38bb4694-1254-4475-b9ae-2cbb7b24ac0e",
    "triplet-uuid": "9879bbc0-eab3-482f-bf6b-a4b519393986",
    "body-paragraphs": [
        [
            "Facing Congress, Clinton Defends Her Actions Before and After Libya Attack"
        ],
        [
            "WASHINGTON — In one of her final appearances as secretary of state, Hillary Rodham Clinton on Wednesday vigorously defended her handling of last September’s attack on the United States diplomatic compound in Benghazi, Libya, which killed four Americans and prompted a scathing review of State Department procedures."
        ],
        [
            "“As I have said many times, I take responsibility, and nobody is more committed to getting this right,” she said, reading a statement during a day of testimony before Senate and House committees.",
            "“I am determined to leave the State Department and our country safer, stronger and more secure.”"
        ],
        [
            "But Mrs. Clinton, whose appearance before Congress had been postponed since December because of illness, quickly departed from the script.",
            "She jousted with Republican lawmakers over who deserved blame for the security problems at the compound, and choked up as she described being at Joint Base Andrews outside Washington when the bodies of the Americans killed in the assault arrived from Libya."
        ],
        [
            "“I stood next to President Obama as the Marines carried those flag-draped caskets off the plane at Andrews,” she said.",
            "“I put my arms around the mothers and fathers, sisters and brothers, sons and daughters.”"
        ],
        [
            "The continuing controversy over the attack, which resulted in the deaths of Ambassador J. Christopher Stevens and three other Americans, has cast a cloud over Mrs. Clinton’s final months at the State Department.",
            "It also has enormous political implications for Mrs. Clinton, the former New York senator who is already regarded as the front-runner for the 2016 Democratic presidential nomination if she chooses to run.",
            "It was the first time she had faced extensive questioning about her role in the episode."
        ],
        [
            "In essence, Mrs. Clinton’s approach was to accept the responsibility for security lapses in Benghazi but not the blame."
        ],
        [
            "“I feel responsible for the nearly 70,000 people who work for the State Department,” Mrs. Clinton told the Senate Foreign Relations Committee in the morning.",
            "“But the specific security requests pertaining to Benghazi, you know, were handled by the security professionals in the department.",
            "I didn’t see those requests. They didn’t come to me. I didn’t approve them. I didn’t deny them.”"
        ],
        [
            "When the question of her role was taken up again in the afternoon hearing by Representative Ed Royce, the California Republican who is chairman of the House Foreign Affairs Committee, Mrs. Clinton acknowledged that she had been briefed on a series of events that indicated that security in Benghazi was deteriorating in the months before the attack.",
            "They included the placement of a bomb at the outer wall of the compound in June and an ambush that month on the British ambassador."
        ],
        [
            "But she said she had gone along with a recommendation from subordinates that the Benghazi post be kept open and assumed that they would take the necessary steps to protect it."
        ],
        [
            "Mrs. Clinton first publicly took responsibility for the Sept. 11 attack in an Oct. 15 interview with television reporters.",
            "Since then, she has committed herself to putting in place all of the recommendations of an independent review that was led by Thomas R. Pickering, a former American ambassador, and Mike Mullen, the retired admiral who served as the chairman of the Joint Chiefs of Staff."
        ],
        [
            "For all of the hours of testimony, the hearings did little to clarify the role of the White House in overseeing the American presence in Libya before the attack or explain why the Pentagon had few forces available on the anniversary of the Sept. 11, 2001, terrorist attacks to respond quickly to any assault on diplomatic outposts in the region."
        ],
        [
            "One of the sharpest exchanges of the day came when Mrs. Clinton responded to questions from Senator Ron Johnson, a Wisconsin Republican, by saying there was too much focus on how the Benghazi attack had been characterized in its early hours and not enough on how to prevent a recurrence.",
            "Republicans have repeatedly charged that Obama administration officials deliberately played down the attack, focusing much of their criticism on Susan E. Rice, the ambassador to the United Nations and once Mr. Obama’s choice to succeed Mrs. Clinton."
        ],
        [
            "“Was it because of a protest, or was it because of guys out for a walk one night who decided they’d go kill some Americans?",
            "What difference, at this point, does it make?” Mrs. Clinton said, her voice rising.",
            "“It is our job to figure out what happened and do everything we can to prevent it from ever happening again, Senator.”"
        ],
        [
            "Senator John McCain, Republican of Arizona, began his questions by saying, “It’s wonderful to see you in good health and as combative as ever,” and then proceeded to complain that she had failed to answer lingering questions."
        ],
        [
            "Mr. McCain asserted that the Obama administration’s aversion to nation-building had precluded it from providing the kind of training and assistance that would have helped the fledgling Libyan government in Tripoli confront growing security threats from militants."
        ],
        [
            "“We did not give them the kind of assistance that would have been necessary to help dismantle these militias that still, to this day, remain a challenge to democracy in Libya,” he said."
        ],
        [
            "Mrs. Clinton responded that Congress had delayed aid to Libya and said she would provide a list of steps that had been taken to train and equip Libyan forces."
        ],
        [
            "A persistent line of questioning by Republican lawmakers concerned the initial comments from Ms. Rice that the attack might have resulted from a protest, over an anti-Islamic video, that spun out of control."
        ],
        [
            "Mrs. Clinton defended Ms. Rice even as she appeared to distance herself from Ms. Rice’s comments.",
            "“I told the American people that heavily armed militants assaulted our compound, and I vowed to bring them to justice,” Mrs. Clinton said."
        ],
        [
            "The Senate Foreign Relations Committee’s chairman, Senator John Kerry, Democrat of Massachusetts, has been nominated to succeed Mrs. Clinton and is scheduled to appear before his committee on Thursday for a confirmation hearing.",
            "To avoid the perception of a conflict of interest, the hearing on Wednesday was led by Senator Robert Menendez, Democrat of New Jersey, the incoming chairman, and Mr. Kerry did not attend."
        ],
        [
            "In a rare criticism of the committee by one of its members, Senator Bob Corker of Tennessee, the ranking Republican, complained that the panel Mr. Kerry led had failed to conduct proper oversight of security and other State Department issues."
        ],
        [
            "“This is an opportunity for this committee to finally do the work that it should have been doing for years,” Mr. Corker said."
        ],
        [
            "Mrs. Clinton sought to put the events in Benghazi in a regional context, noting the presence of a group in northern Mali affiliated with Al Qaeda."
        ],
        [
            "“Benghazi didn’t happen in a vacuum,” she said.",
            "“The Arab revolutions have scrambled power dynamics and shattered security forces across the region.",
            "And instability in Mali has created an expanding safe haven for terrorists who look to extend their influence and plot further attacks of the kind we saw just last week in Algeria.”"
        ],
        [
            "“We are in for a struggle, but it is a necessary struggle,” she said.",
            "“We cannot permit northern Mali to become a safe haven.”"
        ]
    ]
}
