{
    "source": "hpo",
    "main-entities": ["William Cowan","Deval Patrick"],
    "main-event": "William Cowan named interim senator in Massachusetts",
    "title": "Mo Cowan Senate: Deval Patrick Names Former Chief Of Staff To Replace John Kerry",
    "url": "https://www.huffingtonpost.com/2013/01/30/mo-cowan-senate_n_2567798.html",
    "word-count": 833,
    "date": "2013-01-30",
    "uuid": "3e600f15-2b94-4350-a9c8-d00e072386c4",
    "triplet-uuid": "d3a1ce0a-fc48-4827-a278-8f0ce8c7a519",
    "body-paragraphs": [
        [
            "Mo Cowan Senate: Deval Patrick Names Former Chief Of Staff To Replace John Kerry"
        ],
        [
            "WASHINGTON -- Massachusetts Gov. Deval Patrick (D) on Wednesday appointed William \"Mo\" Cowan to the Senate seat vacated by newly confirmed Secretary of State John Kerry.",
            "Cowan will hold the seat in an interim capacity until an election in June."
        ],
        [
            "Patrick, Cowan and Lt. Governor Tim Murray were all smiles as they walked into a news conference to announce the appointment."
        ],
        [
            "\"He's cool,\" Murray said of Cowan.",
            "\"Tom Brady, George Clooney, James Bond, the president have nothing on Mo.\""
        ],
        [
            "\"It was a private fact, but now known publicly thanks to the lieutenant governor, that he also brought cool,\" Patrick said to laughs.",
            "He and Cowan shook hands and hugged."
        ],
        [
            "Cowan, 43, is a former chief of staff and former legal counsel to Patrick.",
            "Like Patrick, who grew up on the South Side of Chicago before attending Milton Academy, Harvard and Harvard Law, Cowan came from a poor background to Boston for education and made a career there.",
            "After growing up in poverty in rural North Carolina, Cowan went to Duke University and then Northeastern University School of Law.",
            "He never left, and became a prominent Boston lawyer."
        ],
        [
            "Cowan's appointment means that there will be two black senators serving together for the first time in American history.",
            "Neither was elected -- Sen. Tim Scott (R-S.C.) was appointed in December after former Sen. Jim DeMint (R-S.C.) left the chamber in the middle of his term."
        ],
        [
            "Cowan's selection is a step forward for a state that has a troubled history with race relations, exploding in the South Boston busing riots in the 1970s.",
            "Patrick, the state's first African-American governor, said recently on local cable television that it was a priority for him to pick a woman or a person of color for the seat.",
            "Cowan will become the second black senator from Massachusetts, after Edward Brooke, who served from 1967 to 1979."
        ],
        [
            "Patrick on Wednesday was asked to reflect on the fact that eight years ago, the highest black official in the state was Suffolk County D.A. Ralph Martin.",
            "Patrick said it was important to have black elected officials, adding, \"the commonwealth and the country [are] changing.\""
        ],
        [
            "Cowan said Patrick offered him the job on Tuesday, and he accepted."
        ],
        [
            "He said there would be \"no daylight\" between him and Kerry on policy.",
            "When asked about the looming sequester, he said the \"best-case scenario\" was a \"balanced approach\" of spending cuts and tax increases.",
            "\"I don't think anyone believes it's in the best interest to do straight across-the-board cuts,\" he said."
        ],
        [
            "Patrick has consistently said that the pick to succeed Kerry should not run in the general election slated for June 25.",
            "Cowan embraced the temporary appointment Wednesday, repeating over and over that his stint would be short.",
            "Asked about his political future, he said, \"I am not running for office; I am not a candidate in the future.\""
        ],
        [
            "The late Sen. Ted Kennedy (D-Mass.) requested in a letter written before his death that the interim pick to replace him not run in the general election, a principle that Patrick honored after Kennedy died by picking Kennedy's longtime chief of staff, Paul Kirk."
        ],
        [
            "Former Rep. Barney Frank (D-Mass.) was the only person to publicly campaign for the interim appointment, announcing his desire to fill the seat on MSNBC and doing subsequent interviews about it.",
            "Frank promised that he would not run in the June election if appointed, and he endorsed Rep. Edward Markey (D-Mass.) for Senate, though the two fought over the redistricting process that Frank blamed for his exit from the House of Representatives.",
            "Progressive groups lined up to rally support for Frank, but Patrick reportedly bristled at his public pursuit of the seat."
        ],
        [
            "Frank praised Cowan in a brief statement Wednesday.",
            "\"I know Mr. Cowan is committed to working hard and in a socially fair and economically efficient manner toward solving pending budget issues,\" he said.",
            "“I now look forward to working for the election of Ed Markey to continue this work, and to providing President Obama the support he deserves in carrying out the mandate he received in November.\"",
            "A Frank representative did not respond to interview requests from The Huffington Post."
        ],
        [
            "The only announced candidate for the general election is Markey, who has received a flood of endorsements from Democrats -- including Kerry -- and has a $3.1 million war chest.",
            "Rep. Stephen Lynch (D-Mass.) is expected to announce his bid Thursday for the seat.",
            "Lynch holds more conservative positions than Markey; he opposes abortion rights and voted against President Barack Obama's health care law."
        ],
        [
            "Former Sen. Scott Brown (R-Mass.) has not said what he will do, but the Associated Press reported Tuesday that he was \"leaning strongly\" towards a run and would likely announce his candidacy early next week.",
            "Brown has kept a low public profile since leaving the Senate in January, other than lashing out at his Twitter critics in a string of messages early Saturday morning."
        ]
    ]
}
