{
    "source": "fox",
    "main-entities": ["William Cowan"],
    "main-event": "William Cowan named interim senator in Massachusetts",
    "title": "Massachusetts Gov. Deval Patrick  picks former staffer to fill Kerry's Senate seat",
    "url": "http://www.foxnews.com/politics/2013/01/30/mass-gov-picks-former-staffer-to-fill-kerry-senate-seat-until-june-election/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+foxnews%2Fpolitics+%28Internal+-+Politics+-+Text%29",
    "word-count": 410,
    "date": "2013-01-30",
    "uuid": "de43e785-3d88-444a-8edd-e503a205ed71",
    "triplet-uuid": "d3a1ce0a-fc48-4827-a278-8f0ce8c7a519",
    "body-paragraphs": [
        [
            "Massachusetts Gov. Deval Patrick on Wednesday picked a former chief of staff to fill Sen. John Kerry’s open seat until a special election in June."
        ],
        [
            "The Democratic governor picked former Chief of Staff William \"Mo\" Cowan, who also served as Patrick’s chief legal counsel."
        ],
        [
            "Kerry, also a Democrat and the state’s senior U.S. senator, was confirmed Tuesday as the new secretary of state, following his nomination by President Obama to replace the retiring Hillary Clinton."
        ],
        [
            "Both political parties will hold special-election primaries in mid May.",
            "But the winner of the Democratic primary will be a likely favorite to win the June 25 special general election, considering Massachusetts is among the most liberal states in the country.",
            "Patrick also announced the general election date Wednesday."
        ],
        [
            "Among the potential Democratic candidates are Reps. Stephen F. Lynch, Michael E. Capuano and Edward Markey."
        ],
        [
            "The most high-profile potential Republican candidate is former Sen. Scott Brown, who pulled off a surprise 2010 victory in the race for the open seat of Sen. Ted Kennedy.",
            "However, Brown lost his re-election bid in November to Democrat Elizabeth Warren."
        ],
        [
            "Cowan joined the Patrick administration in 2009 and reportedly quit earlier this month to join private practice.",
            "He previously practiced civil litigation at the Boston office of Mintz, Levin, Cohn, Ferris, Glovsky and Popeo PC, where he was a partner.",
            "He also was a special assistant district attorney in the Office of the Middlesex County District Attorney."
        ],
        [
            "Cowan is a graduate of Duke University and Northeastern University School of Law.",
            "He and wife Stacy have two young sons."
        ],
        [
            "“I am confident this is the right and best choice,” Patrick said at a late-morning press conference."
        ],
        [
            "The appointment marks the first time in Senate history that two black senators have served at the same time."
        ],
        [
            "“I’m not standing here because I’m a person of color, but because (the governor) believes I can do the job,” said Cowen, who joins South Carolina Republican Sen. Tim Scott as the chamber’s two black senators."
        ],
        [
            "Cowmen also emphasized that his assignment is “temporary” and that he will work together with Kerry’s team."
        ],
        [
            "Patrick gave little indication who he favored during his deliberations."
        ],
        [
            "The only possible candidate he confirmed speaking with was former Democratic Rep. Barney Frank, and then only after Frank told reporters he'd spoken with Patrick."
        ],
        [
            "Michael Dukakis, the former governor and 1988 Democratic presidential nominee, and Victoria Kennedy, Sen. Kennedy’s widow, had also been mentioned as possible candidates for the interim post."
        ]
    ]
}
