{
    "source": "nyt",
    "main-entities": ["William Cowan"],
    "main-event": "William Cowan named interim senator in Massachusetts",
    "title": "William Cowan Named Interim Senator in Massachusetts",
    "url": "http://www.nytimes.com/2013/01/31/us/politics/boston-lawyer-chosen-for-kerrys-senate-seat.html?hpw",
    "word-count": 967,
    "date": "2013-01-30",
    "uuid": "8b00d3db-6d26-4e0d-a94d-bd8ff47ae3c5",
    "triplet-uuid": "d3a1ce0a-fc48-4827-a278-8f0ce8c7a519",
    "body-paragraphs": [
        [
            "Site Mobile Navigation"
        ],
        [
            "Governor Appoints Ex-Aide to Fill Kerry’s Seat"
        ],
        [
            "BOSTON — Gov. Deval Patrick on Wednesday appointed William Cowan, a Boston lawyer who is a longtime friend and former aide, to serve as an interim United States senator until voters chose a successor to John Kerry in a special election set for June 25."
        ],
        [
            "Mr. Cowan, 43, who is known as Mo, is a former partner in the politically connected law firm of Mintz Levin and will become Massachusetts’ first black senator since Edward Brooke, a Republican, held the seat from 1966 to 1978.",
            "His appointment makes Mr. Cowan the second black member to be seated in the current Senate, after Tim Scott of South Carolina was appointed by Gov. Nikki R. Haley."
        ],
        [
            "Mr. Patrick had said he wanted to appoint someone who did not want to run for the seat later because that person would have to conduct a campaign while learning the ropes in the Senate, and would be unlikely to do either job well.",
            "At a packed news conference at the State House, Mr. Cowan said he would not seek the permanent office or use the appointment as a springboard later.",
            "“This is going to be a very short political career,” he vowed."
        ],
        [
            "The clock is now ticking toward the special election.",
            "It promises to be another bruising campaign, with two Democratic congressmen likely to face off in a primary in April."
        ],
        [
            "The biggest question remaining in this drawn-out episode, which began last fall when Mr. Kerry’s name surfaced as a possible successor to Hillary Rodham Clinton as secretary of state, is whether former Senator Scott P. Brown, a Republican, will jump in."
        ],
        [
            "Mr. Brown has remained mum on the subject, and his camp has sent few signals about his intentions, but he may find the opportunity hard to resist."
        ],
        [
            "Polls show him beating Representative Edward J. Markey, the only Democrat who has officially declared his candidacy.",
            "Mr. Brown has high name recognition and money left over from his unsuccessful race last year against Elizabeth Warren."
        ],
        [
            "If he entered the race and won, Mr. Brown would be in the awkward position of becoming the junior senator to Ms. Warren, even though she has been in office only a few weeks.",
            "The Senate historian said that those who return to the Senate after leaving — like Dan Coats of Indiana and Frank R. Lautenberg of New Jersey, for example — lose their seniority, although the distinction has little meaning beyond a way to refer to a state’s senators in the formal oratory of the Senate floor."
        ],
        [
            "Still, it would be unusual for a state to have two senators who had run against each other, especially in a race that was particularly hard fought."
        ],
        [
            "The June 25 special election would be Mr. Brown’s third statewide Senate race in three years, starting with his win in a special election in January 2010 to finish Senator Edward M. Kennedy’s term.",
            "If he won, he would presumably run in 2014 for a full six-year term — or four statewide races in nearly five years."
        ],
        [
            "So far, the only Democrat in the race is Mr. Markey, 66, a liberal and dean of the state’s Congressional delegation.",
            "Several Democrats, including Mr. Kerry, have closed ranks behind him in the hopes of discouraging anyone else from getting in and avoiding a bruising primary."
        ],
        [
            "But Representative Stephen F. Lynch, a conservative Democrat from South Boston, is expected to announce Thursday that he will challenge Mr. Markey.",
            "The primary would be held on April 30."
        ],
        [
            "The rough and tumble of the coming campaign seemed far away at Wednesday’s news conference, which was attended by Mr. Cowan’s wife, Stacey, and their two young sons."
        ],
        [
            "“He’s cool,” Lt. Gov. Timothy Murray said of Mr. Cowan. “Tom Brady, George Clooney, James Bond and the president have nothing on Mo.”"
        ],
        [
            "Mr. Cowan, who usually wears a bow tie but opted not to for this occasion, is a former chief of staff and chief legal counsel to Mr. Patrick, the state’s first black governor.",
            "From 1997 to 2009, he practiced civil litigation as an associate and later a partner in the Boston office of Mintz, Levin, Cohn, Ferris, Glovsky & Popeo.",
            "He also served as a special assistant district attorney in Middlesex County.",
            "He left the Patrick administration last year to return to the private sector, but said this brief detour to Washington was a sacrifice worth making because he wanted to give something back to the state that had given him so much."
        ],
        [
            "Mr. Cowan said at the news conference that he was proud to take the post, noting that his mother, who was home in North Carolina recovering from knee surgery, was a child of the segregated South and had not attended college.",
            "The death of Mr. Cowan’s father at a young age left her to raise her children alone."
        ],
        [
            "Despite her hardships, he said, “My mother told me that days like this were possible.”"
        ],
        [
            "He seemed to be a quick study in the senatorial art of not answering questions definitively.",
            "Asked, for example, if he would vote for military cuts if they cost jobs in Massachusetts, he called for “a balanced approach,” with some cuts and some revenue growth."
        ],
        [
            "Mr. Patrick showed similar deftness, skirting a question about why he had not picked former Representative Barney Frank, who had asserted that he would have loved the interim appointment."
        ],
        [
            "Mr. Cowan said that he would be relying on Mr. Kerry’s staff in Washington and in Massachusetts for guidance and that he intended to continue Mr. Kerry’s work.",
            "“There won’t be any daylight there at all,” he said."
        ],
        [
            "Mr. Patrick, who has served as a mentor to Mr. Cowan, was asked whether he saw some of himself in Mr. Cowan."
        ],
        [
            "“I’m not that cool,” the governor replied."
        ]
    ]
}
