{
    "source": "fox",
    "main-entities": ["Jesse Jackson"],
    "main-event": "Jackson pleads guilty over illegal campaign spending spree",
    "title": "Jackson pleads guilty over illegal campaign spending spree",
    "url": "http://www.foxnews.com/politics/2013/02/20/jackson-pleads-guilty-to-misuse-campaign-funds/?cmpid=cmty_plus_fn",
    "word-count": 530,
    "date": "2013-02-20",
    "uuid": "af6977f5-1200-4e4a-a948-9f632e86a6b6",
    "triplet-uuid": "f506aafc-8b43-427a-936e-bbd1ef33e076",
    "body-paragraphs": [
        [
            "Former Rep. Jesse Jackson Jr. pleaded guilty Wednesday in federal court to charges that he spent $750,000 in campaign cash on personal items."
        ],
        [
            "The Illinois Democrat faces up to five years in prison, but guidelines recommend slightly less.",
            "Sentencing has been set for June 28."
        ],
        [
            "“I truly understand the consequences of my actions and of the preceding,” Jackson said through tears.",
            "“I did these things. … I used money that should have been used for my campaign.”"
        ],
        [
            "Federal prosecutors say Jackson, who resigned from Congress in November amid the investigation and health issues, used campaign money to buy items including a $43,350 gold-plated men's Rolex watch and $9,587.64 worth of children's furniture."
        ],
        [
            "He and his wife, Sandra, had agreed to plead guilty in deals with federal prosecutors.",
            "Jackson's guilty plea was to a conspiracy charge."
        ],
        [
            "His wife later pleaded guilty Wednesday to a charge of filing false joint federal income tax returns for the years 2006 through 2011 that knowingly understated the income the couple received."
        ],
        [
            "Jackson told the judge that he had been hospitalized for psychological issues.",
            "The whole hearing lasted about 50 minutes."
        ],
        [
            "\"Not a proud day,\" he said. \"I'm sorry I let everybody down.\""
        ],
        [
            "The Jacksons were appearing separately before U.S. District Judge Robert L. Wilkins in Washington, D.C. Jackson's wife spent $5,150 on fur capes and parkas, court documents said."
        ],
        [
            "When prosecutors charged the couple last Friday, the ex-congressman said he fully accepts the responsibility for the improper decisions and mistakes he has made.",
            "Tom Kirsch, an attorney for Jackson's wife, said she has signed a plea agreement with federal prosecutors and would plead guilty to one tax count."
        ],
        [
            "The conspiracy charge against the former congressman carries a maximum statutory penalty of up to five years in prison, a fine of up to $250,000, and other penalties."
        ],
        [
            "The charge against Sandra Jackson carries a maximum of three years in prison.",
            "However, one of her lawyers, Tom Kirsch, says the plea agreement \"does not contemplate a sentence of that length.\"",
            "Sandra Jackson was a Chicago alderman before she resigned last month during the federal investigation."
        ],
        [
            "In court papers filed against Jackson on Friday, prosecutors said that upon conviction he must forfeit $750,000, plus tens of thousands of dollars' worth of memorabilia items and furs.",
            "The memorabilia includes a football signed by U.S. presidents, a Michael Jackson fedora, and memorabilia of Martin Luther King Jr., Malcolm X, Jimi Hendrix and Bruce Lee -- all from a company called Antiquities of Nevada."
        ],
        [
            "As the hearing for Jackson got under way Wednesday, newly filed court papers disclosed that the judge had offered to disqualify himself from handling the cases against Jackson and his wife."
        ],
        [
            "As a Harvard Law School student, Wilkins said he had supported the presidential campaign of Jackson's father, civil rights leader Rev. Jesse Jackson, and that as an attorney in 1999, Wilkins had been a guest on a show hosted by Jackson's father."
        ],
        [
            "In the newly filed court papers, prosecutors and lawyers for both Jesse Jackson Jr. and Sandra Jackson said they were willing to proceed with the cases with Wilkins presiding.",
            "Judicial ethics require that a judge disqualify himself if his impartiality might reasonably be questioned."
        ]
    ]
}
