{
    "source": "nyt",
    "main-entities": ["Jesse Jackson"],
    "main-event": "Jackson pleads guilty over illegal campaign spending spree",
    "title": "Jesse Jackson Jr. Pleads Guilty in Campaign Money Case",
    "url": "http://www.nytimes.com/2013/02/21/us/politics/jesse-l-jackson-jr-pleads-guilty-to-wire-and-mail-fraud.html?n=Top/Reference/Times%20Topics/People/S/Schmidt,%20Michael%20S.?ref=michaelsschmidt",
    "word-count": 778,
    "date": "2013-02-20",
    "uuid": "580654bb-eb52-4800-932d-cf00ee661796",
    "triplet-uuid": "f506aafc-8b43-427a-936e-bbd1ef33e076",
    "body-paragraphs": [
        [
            "WASHINGTON — Jesse L. Jackson Jr., the former Democratic representative from Illinois, pleaded guilty on Wednesday to one felony fraud count in connection with his use of $750,000 in campaign money to pay for living expenses and buy items like stuffed animals, elk heads and fur capes."
        ],
        [
            "As part of a plea agreement, prosecutors recommended that Mr. Jackson receive a sentence of 46 to 57 months in prison.",
            "The federal judge overseeing the case, Robert L. Wilkins, is scheduled to sentence Mr. Jackson on June 28."
        ],
        [
            "“For years I lived off my campaign,” Mr. Jackson, 47, said in response to questions from the judge about the plea.",
            "“I used money I shouldn’t have used for personal purposes.”"
        ],
        [
            "At one point during the hearing, the judge stopped his questioning of Mr. Jackson, who was crying, so that he could be given a tissue."
        ],
        [
            "“Guilty, Your Honor — I misled the American people,” Mr. Jackson said when asked whether he would accept the plea deal.",
            "Mr. Jackson’s father, the Rev. Jesse L. Jackson, his mother and several brothers and sisters accompanied him to the hearing."
        ],
        [
            "Mr. Jackson’s wife, Sandi, also accompanied him, and later in the day she pleaded guilty to a charge that she filed false income tax statements during the time that Mr. Jackson was dipping into his campaign treasury.",
            "Prosecutors said they would seek to have her sentenced to 18 to 24 months."
        ],
        [
            "Mr. Jackson’s plea was yet another chapter in the downward spiral of his career.",
            "Elected to Congress in 1995 at the age of 30 from a district that includes part of the South Side of Chicago, Mr. Jackson was once one of the most prominent young black politicians in the country, working on issues related to health care and education for the poor."
        ],
        [
            "But as the federal authorities investigated Gov. Rod R. Blagojevich of Illinois over his efforts to sell the Senate seat that President Obama vacated in 2008, they uncovered evidence that one of Mr. Jackson’s friends had offered to make a contribution to Mr. Blagojevich’s campaign in exchange for the seat.",
            "Since then, Mr. Jackson, who has said he had no knowledge of the offer, has been dogged by questions about his ethics."
        ],
        [
            "Last summer, Mr. Jackson took a medical leave from Congress and was later treated for bipolar disorder.",
            "After winning re-election in November, he resigned, citing his health and the federal investigation into his use of campaign money."
        ],
        [
            "After the hearing, Mr. Jackson’s lawyer, Reid H. Weingarten, said his client had “come to terms with his misconduct.”"
        ],
        [
            "Mr. Weingarten said that Mr. Jackson had serious health issues that “directly related” to his conduct."
        ],
        [
            "“That’s not an excuse, it’s just a fact,” Mr. Weingarten said."
        ],
        [
            "Court papers released by federal prosecutors on Wednesday provided new details about how Mr. Jackson and his wife used the $750,000 in campaign money to finance their lavish lifestyle."
        ],
        [
            "From 2007 to 2011, Mr. Jackson bought $10,977.74 worth of televisions, DVD players and DVDs at Best Buy, according to the documents.",
            "In 2008, Mr. Jackson used the money for things like a $466.30 dinner at CityZen in the Mandarin Oriental in Washington and a $5,587.75 vacation at the Martha’s Vineyard Holistic Retreat, the document said."
        ],
        [
            "On at least two instances, Mr. Jackson and his wife used campaign money at Build-A-Bear Workshop, a store where patrons can create stuffed animals.",
            "From December 2007 through December 2008, the Jacksons spent $313.89 on “stuffed animals and accessories for stuffed animals” from Build-A-Bear, according to the documents."
        ],
        [
            "One of the more exotic items they bought was an elk head from a taxidermist in Montana.",
            "According to the documents, Mr. Jackson arranged in March 2011 to have $7,000 paid to the taxidermist, with much of the money coming from a campaign account, and it was shipped a month later to Mr. Jackson’s Congressional office."
        ],
        [
            "A year later, Mr. Jackson’s wife, knowing that the elk head had been bought with campaign money, had it moved from Washington to Chicago, and she asked a Congressional staff member to sell it, the documents say."
        ],
        [
            "In August 2012, the staff member sold the elk head for $5,300 to an interior designer and had the money wired to one of Mr. Jackson’s accounts.",
            "What the staff member did not know was that the interior designer was actually an undercover F.B.I. employee who was investigating the Jacksons, the documents say."
        ],
        [
            "Documents released on Friday showed how Mr. Jackson used his campaign money to buy items like fur capes, celebrity memorabilia and expensive furniture."
        ],
        [
            "Among those items were a $5,000 football signed by American presidents and two hats that once belonged to Michael Jackson, including a $4,600 fedora."
        ]
    ]
}
