{
    "uuid": "a143024b-3706-484e-a788-45ca4df7ade5",
    "main-event": "James Mattis quits as defense secretary",
    "main-entities": [
        "James Mattis",
        "Donald Trump"
    ],
    "title": "Defense Secretary James Mattis to leave as of January 1; Trump taps Patrick Shanahan as acting secretary of defense",
    "triplet-uuid": "01c59743-7082-44fc-8414-3c04126f470f",
    "body-paragraphs": [
        [
            "President Trump announced Sunday that Defense Secretary James Mattis will be leaving the administration on January 1, weeks earlier than planned and just days after Mattis' bombshell resignation letter made clear his policy disagreements with the White House."
        ],
        [
            "\"I am pleased to announce that our very talented Deputy Secretary of Defense, Patrick Shanahan, will assume the title of Acting Secretary of Defense starting January 1, 2019,\" Trump wrote on Twitter Sunday morning. "
        ],
        [
            "\"Patrick has a long list of accomplishments while serving as Deputy, & previously Boeing. "
        ],
        [
            "He will be great!\""
        ],
        [
            "Shanahan is a former Boeing executive who joined the Pentagon in July 2017."
        ],
        [
            "In his resignation letter Thursday, Mattis, 68, had said he would remain in his role for more than three months. "
        ],
        [
            "Also on Thursday, Trump had said Mattis -- the first Cabinet official in 40 years to resign over a stated policy difference with the president -- was leaving in February."
        ],
        [
            "\"The end date for my tenure is February 28, 2019, a date that should allow sufficient time for a successor to be nominated and confirmed as well as to make sure the Department's interests are properly articulated and protected at upcoming events to include Congressional posture hearings and the NATO Defense Ministerial meeting in February,\" Mattis wrote Thursday."
        ],
        [
            "It was not immediately clear why Mattis' departure date was apparently moved up, but tension in the Defense Department and Washington generally has skyrocketed in the days since he suddenly announced his resignation."
        ],
        [
            "Sources told Fox News this week that Mattis had quit \"in protest\" over the president's national security policies and that more resignations could be coming. "
        ],
        [
            "(In 2013, then-President Obama removed Mattis from his post running U.S. military's Central Command, reportedly without calling to notify him of the decision.)"
        ],
        [
            "U.S. officials said this week that the Trump administration is making plans to pull all 2,000 troops out of Syria, and Trump later tweeted that “we have defeated ISIS in Syria, my only reason for being there during the Trump Presidency.”"
        ],
        [
            "Trump has stood by his Syria decision despite fierce blowback, telling detractors that the pullout should come as “no surprise” given his 2016 campaign promises and arguing that America’s role as “Policeman of the Middle East” is not worth the sacrifice."
        ],
        [
            "Ground troops moved into Syria in 2015 to combat ISIS in the region, amid an escalating Syrian civil war. "
        ],
        [
            "Trump had talked about pulling out of Syria before, but military leaders had warned about ISIS re-emerging should the U.S. do so. "
        ],
        [
            "There is also concern about abandoning the U.S.' Kurdish allies."
        ],
        [
            "The news that Mattis will be leaving sooner than expected comes just days after Brett McGurk, the U.S. envoy for the global coalition to defeat Islamic State (ISIS), on Saturday accelerated his planned departure and announced his resignation."
        ],
        [
            "The Associated Press reported that McGurk said in a resignation letter to Secretary of State Mike Pompeo that ISIS was on the run, but wasn’t yet defeated and that U.S. work in Syria wasn’t yet done. "
        ],
        [
            "Fox News has confirmed that McGurk submitted his resignation letter on Friday, a day after Mattis resigned. "
        ],
        [
            "His resignation is effective December 31."
        ],
        [
            "The president downplayed the news via Twitter Saturday evening, saying he had neither met McGurk nor appointed him."
        ],
        [
            "\"Brett McGurk, who I do not know, was appointed by President Obama in 2015. "
        ],
        [
            "Was supposed to leave in February but he just resigned prior to leaving,\" Trump tweeted. "
        ],
        [
            "\"Grandstander? The Fake News is making such a big deal about this nothing event!\""
        ],
        [
            "\"If anybody but your favorite President, Donald J. Trump, announced that, after decimating ISIS in Syria, we were going to bring our troops back home (happy & healthy), that person would be the most popular hero in America,\" he continued in a follow-up tweet. "
        ],
        [
            "\"With me, hit hard instead by the Fake News Media. Crazy!\""
        ],
        [
            "Meanwhile, the White House's plan to withdraw half its troops in Afghanistan by the summer -- some 7,000 soldiers -- has drawn similar criticism. "
        ],
        [
            "While President Obama repeatedly promised to pull all troops out of Afghanistan by 2014, U.S. and NATO forces remain there in a predominately training and advising role."
        ],
        [
            "Afghanistan's security forces rely heavily on U.S. airpower against both Taliban and an upstart Islamic State affiliate. "
        ],
        [
            "More than 2,400 American soldiers have died in Afghanistan since the 2001 U.S.-led invasion, and Trump announced in a video last week that troop deaths were on his mind in announcing the pullouts."
        ]
    ],
    "source": "fox",
    "url": "https://www.foxnews.com/politics/defense-secretary-james-mattis-to-leave-as-of-january-1-trump-taps-patrick-shanahan-as-acting-secretary-of-defense",
    "date": "2018-12-23"
}
