{
    "triplet-uuid": "06ffda2d-1caf-45ba-99e2-268aac1bf0e1",
    "url": "http://www.foxnews.com/politics/2018/04/06/texas-rep-blake-farenthold-resigns-from-congress.html",
    "keywords": "",
    "word-count": 357,
    "body-paragraphs": [
        [
            "Texas Rep. Blake Farenthold resigns from Congress"
        ],
        [
            "U.S. Representative Blake Farenthold resigned from Congress on Friday, following multiple allegations of sexual harassment, misconduct and inappropriate behavior."
        ],
        [
            "Farenthold, R-Texas, had previously announced that he would not seek re-election in the 2018 midterm election, when reports of sexual misconduct first surfaced."
        ],
        [
            "“While I planned on serving out the remainder of my term in Congress, I know in my heart it’s time for me to move along and look for new ways to serve,” Farenthold said in a statement Friday evening, noting he sent a letter to Texas Gov.",
            "Greg Abbott to tell him about his resignation, effective at 5 p.m."
        ],
        [
            "“It’s been an honor and privilege to serve the constituents of Texas’ 27th Congressional District.",
            "I would like to thank my staff both in Washington and Texas for all of their hard work on behalf of our constituents.",
            "I would also like to thank my family for their unwavering support and most importantly the people that elected me,” Farenthold said.",
            "“Leaving my service in the House, I’m able to look back at the entirety of my career in public office and say that it was well worthwhile.”"
        ],
        [
            "Farenthold was sued by his former aide, Lauren Greene, in 2014, alleging a hostile work environment, gender discrimination and retaliation.",
            "Among other things, Greene claimed Farenthold asked her for a threesome.",
            "She sued him and was paid $84,000 from a public fund on behalf of Farenthold for a sexual harassment claim."
        ],
        [
            "Farenthold pledged to repay the $84,000 in taxpayer money spent to settle the claim."
        ],
        [
            "Farenthold’s former communications director, Michael Rekola, also described in detail the congressman’s alleged abusive behavior toward staff members, which ranged from making sexually graphic jokes to verbally abusing his aides."
        ],
        [
            "Other staffers accused Farenthold of routinely commenting on the size of women’s breasts and making jokes about being on “redhead patrol” because he was attracted to women with red hair."
        ]
    ],
    "uuid": "c7f8467e-2dca-4ad7-bb2e-52d01356510c",
    "source": "fox",
    "title": "Texas Rep. Blake Farenthold resigns from Congress",
    "date": "2018-04-06",
    "main-event": "Blake Farenthold resigns from Congress",
    "main-entities": ["Blake Farenthold"]
}
