{
    "source": "hpo",
    "main-entities": ["Blake Farenthold"],
    "main-event": "Blake Farenthold resigns from Congress",
    "title": "GOP Rep. Blake Farenthold Resigns After Sexual Harassment Allegations",
    "url": "https://www.huffingtonpost.com/entry/blake-farenthold-resignation-sexual-harassment_us_5ab17db0e4b054d118dddf24",
    "word-count": 406,
    "date": "2018-04-06",
    "uuid": "c16938aa-d402-4b97-8aff-c8bc99a11c3c",
    "triplet-uuid": "06ffda2d-1caf-45ba-99e2-268aac1bf0e1",
    "body-paragraphs": [
        [
            "GOP Rep. Blake Farenthold Resigns After Sexual Harassment Allegations"
        ],
        [
            "Rep. Blake Farenthold (R-Texas) is resigning from Congress, he announced Friday in a statement and accompanying video."
        ],
        [
            "Farenthold declared in December that he would not seek re-election in 2018 after reports emerged that he’d used taxpayer money to settle sexual harassment claims.",
            "A few of his GOP colleagues urged him to resign over the accusations, which Farenthold has repeatedly denied."
        ],
        [
            "“While I planned on serving out the remainder of my term in Congress, I know in my heart it’s time for me to move along and look for new ways to serve,” he said in the statement."
        ],
        [
            "In his video, flanked by an American flag and a Texas state flag, he added: “You know, I look forward to staying in touch with everyone.",
            "It’s been an honor and a privilege to serve.",
            "Thank you so much.",
            "Please, stay in touch.",
            "I love y’all.",
            "God bless you, God bless Texas, God bless America.”"
        ],
        [
            "Farenthold’s resignation took effect Friday at 5 p.m. Eastern time.",
            "He promptly deleted his Twitter and Facebook profiles."
        ],
        [
            "Farenthold used $84,000 in taxpayer funds to settle a sexual harassment lawsuit his former communications director, Lauren Greene, had filed in 2014, Politico reported in December.",
            "Greene accused Farenthold of telling her he had “sexual fantasies” and “wet dreams” about her, and then claimed she was fired after complaining to Farenthold."
        ],
        [
            "“I had no idea how to run a congressional office,” the four-term congressman said in December.",
            "“As a result, I allowed a workplace culture to take root in my office that was too permissive and decidedly unprofessional.”"
        ],
        [
            "Farenthold said after the reports broke that he would repay the $84,000 to the Treasury Department, but has not made good on that promise.",
            "A representative for his office told HuffPost in February that the congressman was waiting to see what changes lawmakers will add to the Congressional Accountability Act."
        ],
        [
            "“He is waiting on the advice of counsel to see what final bill is enacted,” Bob Haueter, Farenthold’s chief of staff, told HuffPost at the time.",
            "“Once the final bill is done and the law is changed and is complete and he can see that, he will make a determination of how he proceeds.”"
        ],
        [
            "In his resignation statement, Farenthold reflected on his time spent working to “make government more efficient and responsive, cut government spending, repeal Obamacare, protect life and reduce the debt.”"
        ],
        [
            "“I would like to thank my staff both in Washington and Texas for all of their hard work on behalf of our constituents. I would also like to thank my family for their unwavering support and most importantly the people that elected me,” he said."
        ]
    ]
}
