{
    "keywords": "",
    "word-count": 628,
    "date": "2018-04-06",
    "uuid": "369ffb5e-a8bd-4a00-b3d1-92261ba8ed6a",
    "body-paragraphs": [
        [
            "Texas Congressman Who Settled Harassment Case With Taxpayer Funds Resigns"
        ],
        [
            "Representative Blake Farenthold, Republican of Texas, in December at the Capitol.CreditJoshua Roberts/Reuters"
        ],
        [
            "WASHINGTON — Representative Blake Farenthold, the Texas Republican who used $84,000 in taxpayer funds to settle a sexual harassment case with his former communications director, abruptly resigned from Congress on Friday afternoon."
        ],
        [
            "In December, Mr. Farenthold, who represented the 27th District of Texas, said that he would not run for re-election amid scrutiny over the payment and accusations from other aides that he set the tone for a hostile work environment in his office.",
            "At the time, he was one of several lawmakers to announce his eventual departure from Congress after being accused of sexual harassment and discrimination."
        ],
        [
            "“While I planned on serving out the remainder of my term in Congress, I know in my heart it’s time for me to move along and look for new ways to serve,” Mr. Farenthold said in a statement on Friday, thanking his staff, his family and the voters who elected him."
        ],
        [
            "It was known for several years that Mr. Farenthold, already notorious for a heavily circulated photograph of him in duck pajamas, had been accused of sexual harassment by Lauren Greene, his former communications director.",
            "She sued him in 2014, claiming that he had illegally fired her after she complained about mistreatment."
        ],
        [
            "But in December, the extent of Mr. Farenthold’s settlement was revealed when Congress’s Office of Compliance released details of six settlements that it had paid out since 2013 as part of a review of discrimination and sexual harassment in congressional offices.",
            "His case was the only settlement involving sexual harassment since 2013."
        ],
        [
            "“While I 100 percent support more transparency with respect to claims against members of Congress, I can neither confirm nor deny that settlement involved my office,” Mr. Farenthold said at the time."
        ],
        [
            "A decision in 2015 by the Office of Congressional Ethics, an independent, nonpartisan board, cleared him of wrongdoing, and he promised to repay the settlement."
        ],
        [
            "A spokeswoman for Mr. Farenthold did not respond to questions about whether he had fulfilled that promise or whether he would do so after resigning.",
            "But fellow Republicans suggested that he had not."
        ],
        [
            "“Mr. Farenthold made a commitment that he would reimburse taxpayers for the settlement,” said AshLee Strong, a spokeswoman for Speaker Paul Ryan, Republican of Wisconsin.",
            "“He reiterated his commitment to the speaker, and the speaker expects him to follow through.”"
        ],
        [
            "Representative Steve Stivers, Republican of Ohio and the chairman of the National Republican Congressional Committee, also said in a statement that he hoped Mr. Farenthold would be “true to his word” and pay back the taxpayer money."
        ],
        [
            "After the disclosure, more of his aides came forward to accuse Mr. Farenthold of fostering a hostile environment, describing a congressman with a harsh temper who made sexually explicit jokes and engaged in casual sexual banter."
        ],
        [
            "The House Ethics Committee also opened a subcommittee investigation into Ms. Greene’s allegations."
        ],
        [
            "In a video in December announcing his resignation, Mr. Farenthold continued to deny the allegations, but he acknowledged running an “unprofessional” workplace and said he was “profoundly sorry” for his actions.",
            "At the time, Republican leadership praised his decision to step aside, over Democratic criticism that he should immediately resign."
        ],
        [
            "After his resignation on Friday, Mr. Farenthold deleted his Twitter account and the Facebook campaign page where he first announced his decision to not seek re-election."
        ],
        [
            "“Leaving my service in the House,” he said in his statement, “I’m able to look back at the entirety of my career in public office and say that it was well worthwhile.”"
        ]
    ],
    "triplet-uuid": "06ffda2d-1caf-45ba-99e2-268aac1bf0e1",
    "title": "Texas Congressman Who Settled Harassment Case With Taxpayer Funds Resigns",
    "source": "nyt",
    "url": "https://mobile.nytimes.com/2018/04/06/us/politics/farenthold-harassment-case-resigns.html",
    "main-event": "Blake Farenthold resigns from Congress",
    "main-entities": ["Blake Farenthold"]
}
