{
    "source": "hpo",
    "main-entities": ["Democratic Lawmakers", "Republican Lawmakers"],
    "main-event": "Schumer bashed by the left over shutdown-ending deals",
    "title": "Liberals Fume At 'Worst Negotiator' Chuck Schumer After Deal To End Shutdown",
    "url": "https://www.huffingtonpost.com/entry/chuck-schumer-liberals-fume_us_5a6639e1e4b0e56300727401",
    "word-count": 483,
    "date": "2018-01-22",
    "uuid": "71a88bdd-b74b-4d91-8144-c5de8a0550f2",
    "triplet-uuid": "1ed4f378-b9d4-43b8-8d50-53d0cc063332",
    "body-paragraphs": [
        [
            "Liberals Fume At 'Worst Negotiator' Chuck Schumer After Deal To End Shutdown"
        ],
        [
            "WASHINGTON ― Democrats provided votes to fund the government on Monday in exchange for an assurance from Senate Majority Leader Mitch McConnell (R-Ky.) that he would put an immigration bill on the floor in the coming weeks."
        ],
        [
            "Liberal groups, which are deeply skeptical whether Republicans will keep their word after years of inaction on codifying protections for the undocumented young people often called Dreamers, angrily slammed Democrats ― and in particular Senate Minority Leader Chuck Schumer (D-N.Y.) ― for giving away leverage with no firm promise that an immigration bill would reach President Donald Trump’s desk."
        ],
        [
            "“It’s official: Chuck Schumer is the worst negotiator in Washington ― even worse than Trump.",
            "Any plan to protect Dreamers that relies on the word of serial liars like Mitch McConnell, Paul Ryan or Donald Trump is doomed to fail,” CREDO Political Director Murshed Zaheed said in a statement."
        ],
        [
            "CREDO Action, the activist arm of the wireless phone company, advocates for progressive causes, including immigrants rights and the passage of legislation that would give Dreamers a pathway to citizenship."
        ],
        [
            "MoveOn.org, one of the most influential progressive organizations in Washington, similarly panned the agreement that 33 Senate Democrats voted to advance to a final vote on Monday."
        ],
        [
            "“This is a bad, outrageous deal.",
            "Trump and Republicans in Congress stood with their anti-immigrant nativist base, and too many Democrats backed down, abandoned Dreamers, and failed to fight for their values,” MoveOn.org Political Action Executive Director Ilya Sheyman said in a statement."
        ],
        [
            "McConnell said over the weekend that he intends to move to vote on an immigration bill if both parties can’t agree to one by Feb. 8, as long as the government is still fully open.",
            "The admission left some Senate Democrats encouraged by the prospect of a bipartisan solution ― even if they have no guarantee from House Speaker Paul Ryan (R-Wis.) that it will pass in the House."
        ],
        [
            "“I believe Sen. McConnell will follow through,” independent Sen. Angus King of Maine, who caucuses with the Democrats, told reporters on Monday.",
            "“I think he’s made his commitments so publicly and so unequivocally.”"
        ],
        [
            "Other Democrats, such as Sen. Kamala Harris (Calif.), remained unconvinced that McConnell and the House Republicans would follow through on immigration."
        ],
        [
            "“I don’t believe he made any commitment whatsoever and I think it would be foolhardy to believe that he made a commitment,” Harris said."
        ],
        [
            "While Senate Democrats did not receive everything they asked for in exchange for voting to reopen the government, they did manage to get the Children’s Health Insurance Program funded for six years.",
            "And if McConnell doesn’t follow through on immigration, Democrats will still be able to use his promise to vote against the next spending bill on Feb. 8 and pin the blame on Republicans."
        ],
        [
            "For now, though, Democrats who voted to reopen the government said that simply pushing the conversation in the right direction was a victory on its own."
        ],
        [
            "“I don’t think I can guarantee a House outcome but I think the stronger the bill, in terms of the strength of the bipartisanship in the bill ― the odds go up in the House,” Sen. Tim Kaine (D-Va.) told HuffPost on Monday."
        ]
    ]
}
