{
    "triplet-uuid": "1ed4f378-b9d4-43b8-8d50-53d0cc063332",
    "url": "http://www.foxnews.com/politics/2018/01/23/schumer-bashed-by-left-over-shutdown-ending-deal.html",
    "keywords": "",
    "word-count": 774,
    "body-paragraphs": [
        [
            "Schumer bashed by the left over shutdown-ending deal"
        ],
        [
            "Senate Democratic Leader Chuck Schumer is taking heat from some of the most influential and deep-pocketed groups in the liberal base for caving to Republicans in the shutdown standoff."
        ],
        [
            "“Today’s cave by most Senate Democrats was … a stunning display of moral and political cowardice,\" said Democracy for America, just one of several such groups bashing Schumer for the stand-down on Monday.",
            "“Most Senate Democrats, including Democratic Leader Chuck Schumer, voted to allow Donald Trump to continue to subject an ever-growing number of Dreamers to lives threatened by deportation from the only home they’ve ever known.”"
        ],
        [
            "Schumer and fellow Senate Democrats forced the shutdown over the weekend after insisting that any temporary spending bill to keep the government fully operational include permanent protections for the so-called DREAMers -- immigrants brought illegally to the United States as children."
        ],
        [
            "The four-term New York senator and the dozens of other Democrats who initially voted Friday to block the spending bill had been lauded by their progressive base even as nearly 1 million federal workers were furloughed without pay."
        ],
        [
            "“Let the Senate know we stand with them for the Dreamers … say THANKS!",
            "to @SenSchumer and your own senator, and to urge them to stay strong,” tweeted the Brooklyn, N.Y., chapter of Indivisible Nation, a leader in the progressive, Resist Trump movement."
        ],
        [
            "Yet by the time Schumer said Monday afternoon on the Senate floor that Democrats would soon vote in support of ending the shutdown, in exchange for Republicans’ commitment to promptly craft and vote on legislation to help DREAMers, Schumer’s support had turned.",
            "He suddenly faced calls to rally outside his Brooklyn apartment and suggestions that his leadership position was no longer secure."
        ],
        [
            "“This deal was morally reprehensible and political malpractice.",
            "It’s Senator Schumer’s job to keep the caucus together and fight for progressive values.",
            "He failed in that today,” said Indivisible co-founder Ezra Levin.",
            "“The big blue wave that Schumer hopes will make him Senate majority leader in 2019 will not build itself.”"
        ],
        [
            "Democracy for America, the political action committee founded by former Democratic presidential candidate Howard Dean, also said: \"If you want to know why we lost in 2016 and why a Democratic wave in 2018 is far from guaranteed … look no further than this weak and profoundly disappointing cave from Senate Democrats.”"
        ],
        [
            "Members of the “No, DREAM, No Deal” began stepping up their calls for Schumer and others to “stand strong” Sunday night, when Senate Majority Leader Mitch McConnell, R-Ky., suggested a compromise had been reached, without offering any solid commitment."
        ],
        [
            "“When the Democrat filibuster of the government funding bill ends, the serious, bipartisan negotiations that have been going on for months now to resolve our unfinished business -- military spending; disaster relief; healthcare; immigration and border security -- will continue,” he said.",
            "“Assuming that the government remains open, it would be my intention to proceed to legislation that would address DACA.”"
        ],
        [
            "Schumer, near the time of his announcement Monday, pledged his continued support for DREAMers, tweeting: “Soon, the govt will reopen, and we have a lot to do: #ProtectDreamers.",
            "Write a budget, Address health care, veterans, disaster relief, pensions & the opioid epidemic.",
            "The #TrumpShutdown will soon end, but the work goes on.”"
        ],
        [
            "But by the time Republicans had the 60-plus votes, with support from 33 Democrats, the revolt was in full force."
        ],
        [
            "“Enough is enough,” said Lorella Praeli, director of immigration policy and campaigns at the American Civil Liberties Union.",
            "“We cannot rely on empty promises from those who have already proven to play politics with the lives of Dreamers.",
            "… Let it be known -- we will be watching, and will make sure voters this November know if their representatives stood for Dreamers or for their deportations.”"
        ],
        [
            "The short-term deal now only gives Congress until Feb. 8 to work out longer-term legislation, and an agreement on immigration."
        ],
        [
            "Trump tweeted Tuesday he's not sure it will happen."
        ],
        [
            "\"Nobody knows for sure that the Republicans & Democrats will be able to reach a deal on DACA by February 8, but everyone will be trying....with a big additional focus put on Military Strength and Border Security.",
            "The Dems have just learned that a Shutdown is not the answer!\" he said."
        ]
    ],
    "uuid": "dba3c81f-9ecf-44f3-9b71-4e47f133520c",
    "source": "fox",
    "title": "Schumer bashed by the left over shutdown-ending deal",
    "date": "2018-01-23",
    "main-event": "Schumer bashed by the left over shutdown-ending deal",
    "main-entities": ["Chuck Schumer","Democratic Lawmakers", "Republican Lawmakers"]
}
