{
    "keywords": "",
    "word-count": 1124,
    "date": "2018-01-22",
    "uuid": "ba818730-bd59-4a1c-94ff-58141a581896",
    "body-paragraphs": [
        [
            "Senate Democrats’ Vote to End Shutdown Infuriates Some on the Left"
        ],
        [
            "WASHINGTON — The decision by Senate Democrats to end the government shutdown on Monday in exchange for a promised immigration vote enraged liberals, who accused the lawmakers of betrayal and threatened to mount primaries against some of the Democrats who voted yes."
        ],
        [
            "Regardless of what happens in the Senate, progressive and immigrant advocacy groups said House Republican leaders will never take up a bill that would offer legal status to young undocumented immigrants brought to the country as children without excruciating concessions on other immigration issues.",
            "They accused Senator Chuck Schumer of New York, the Democratic leader, and moderate Democratic senators of capitulating to protect senators up for re-election in November in Republican-leaning states."
        ],
        [
            "“They blinked because they’ll always put the party and the success of the party first,” said Representative Luis V. Gutiérrez of Illinois, one of the leading Democratic advocates for immigrants, complaining that Hispanics got short shrift.",
            "“It’s the one word they know in Spanish: mañana.”"
        ],
        [
            "The hasty retreat by 33 Senate Democrats was particularly humiliating in the immediate aftermath of the anniversary of the Women’s March, which saw thousands of activists reconvene in cities across the country to protest against President Trump and congressional Republicans.",
            "Liberal groups such as MoveOn.org began urging members to sign up on Monday for rallies aimed at pressuring Republicans to protect the young undocumented immigrants known as Dreamers."
        ],
        [
            "By noon, their own ostensible allies in Congress had buckled."
        ],
        [
            "“The grass-roots are rightly furious with a slew of elected Democrats,” said Ben Wikler, the Washington director of MoveOn.org.",
            "“In the Obama years, Republicans learned to be more afraid of primary challenges than general elections.",
            "But Democrats are still operating as though the Tea Party is more powerful than The Resistance.”"
        ],
        [
            "The anger on the left was reminiscent of conservative unrest that fueled primary race challenges against sitting Republican senators accused of appeasing an opposition president, Barack Obama, and his congressional allies."
        ],
        [
            "Mr. Schumer, determined to keep the fissures in his party coalition muted, used a meeting of Senate Democrats before the vote to urge the liberals in his caucus not to criticize those voting to reopen the government, according to one senator who spoke on the condition of anonymity to discuss a private meeting."
        ],
        [
            "And for the most part, the liberal senators who opposed the agreement held their fire.",
            "Democrats have largely avoided the internal insurrections that upended Republicans over the past decade.",
            "Mr. Schumer is not a figure of derision on the left as Mr. McConnell is on the right."
        ],
        [
            "And Senate Democrats have crushed most primary election challenges easily.",
            "Senate leaders have intervened freely in a number of 2018 races — in states like Arizona and Tennessee — to anoint more moderate standard-bearers."
        ],
        [
            "Former Senator Byron L. Dorgan, Democrat of North Dakota, said Democrats from the more rural states that make up much of the 2018 map would prefer to battle over issues other than immigration.",
            "The Obama-era program that protected young undocumented immigrants — Deferred Action for Childhood Arrivals, or DACA — is an important issue, he said, but “it isn’t the bread and butter of successful Democrat politics.”"
        ],
        [
            "“Our major issues are jobs, Medicare, Medicaid, CHIP, Social Security, infrastructure, supporting domestic programs, clean air, safe drinking water,” Mr. Dorgan said, adding of his conservative-state brethren, “While those Democrats do strongly support DACA, I’m sure they would prefer to be discussing different issues.”"
        ],
        [
            "But the patience of the left may be running thin.",
            "By appearing to retreat on Monday, Democrats have stirred new talk on the left about challenging incumbents who had previously given little thought to their own nominations."
        ],
        [
            "Faiz Shakir, the political director of the American Civil Liberties Union and an adviser to former Senator Harry Reid of Nevada, said the group and its allies were actively exploring places to intervene in primary elections."
        ],
        [
            "Mr. Shakir said of some Democrats that it is an “open question, still, whether they’re going to fight for Dreamers.”"
        ],
        [
            "Right now, only one Democratic senator faces a serious primary challenge: Senator Dianne Feinstein of California, who voted against the government-funding deal and complained privately that she and most of her colleagues had been asked to vote on Friday against a nearly identical measure to keep the government open."
        ],
        [
            "Ms. Feinstein has tacked to the left since Kevin de Léon, the president of the California State Senate, announced his challenge to her in October."
        ],
        [
            "Mr. de Léon said Monday that Democrats had made a grave mistake striking “another fingers-crossed bargain with Donald Trump and Mitch McConnell.”"
        ],
        [
            "Mr. de Léon said he had called and left a voice mail message with Thomas E. Perez, the Democratic National Committee chairman, and planned to convey that Democrats had sent a terrible message to “voters of color and millennial voters who feel like they’ve been abandoned.”"
        ],
        [
            "“Once again, the party’s leaders in Washington have capitulated, compromised and redrawn a line in the sand even further away from justice,” he said."
        ],
        [
            "One House Democrat is already under fire for not taking a stronger stance on behalf of immigrants: Representative Daniel Lipinski of Illinois, a moderate Democrat from Chicago who is facing a primary race challenger, Marie Newman, in March."
        ],
        [
            "“I asked him to sign on to Dream bill.",
            "He said, ‘I don’t think I can do that,’” said Mr. Gutiérrez, whoendorsed Ms. Newman last week.",
            "(Mr. Lipinski opposed the measure in 2010 but has said in recent months that he would support it if it comes to the House floor.)"
        ],
        [
            "The chances of a successful primary election challenge in the Senate are far more remote.",
            "Many of the Democrats facing re-election in November hail from states that Mr. Trump carried and are more concerned about well-funded Republican opponents than liberal challengers."
        ],
        [
            "Of the 10 Democrats who gathered outside the Senate chamber after the vote to crow about their bipartisan agreement, six are on the ballot this year."
        ],
        [
            "“If you want results, you have to compromise, and if you’re unwilling to compromise, you won’t get results,” said Senator Heidi Heitkamp, Democrat of North Dakota.",
            "“You maybe get a political issue, but you won’t get results.",
            "And I didn’t come here to do politics.”"
        ],
        [
            "Progressives, however, are already eyeing one of the Democrats who pushed for a compromise: Senator Amy Klobuchar of Minnesota.",
            "On a conference call convened Sunday night by liberal groups, there was notable anger toward Ms. Klobuchar, according to two participants."
        ],
        [
            "Ms. Klobuchar, however, illustrates why the Democratic base may find it difficult to inflict payback: She is broadly popular with liberals in Minnesota, and the shutdown fight has come late enough in the congressional calendar to leave any would-be challenger with little time to prepare."
        ],
        [
            "“I have been working hard for the people of Minnesota, and I think the people of Minnesota understand that, including in my party,” Ms. Klobuchar said."
        ]
    ],
    "triplet-uuid": "1ed4f378-b9d4-43b8-8d50-53d0cc063332",
    "title": "Senate Democrats’ Vote to End Shutdown Infuriates Some on the Left",
    "source": "nyt",
    "url": "https://www.nytimes.com/2018/01/22/us/politics/liberal-activists-democrats-betrayal-shutdown.html",
    "main-event": "Schumer bashed by the left over shutdown-ending deal",
    "main-entities": ["Democratic Lawmakers", "Republican Lawmakers"]
}
