{
    "uuid": "f75f0ffe-9f1d-4b90-8450-804a29544396",
    "main-event": "Cesar Sayoc arrested for sending pipe bombs to Trump critics",
    "main-entities": [
        "Cesar Sayoc",
        "Law enforcement/Federal authorities"
    ],
    "title": "Suspect arrested in Florida in connection with suspicious packages sent to Democrats",
    "triplet-uuid": "1f99798f-2b60-4ecb-b5f4-4aa7991e8ace",
    "body-paragraphs": [
        [
            "A male suspect was arrested in Florida on Friday morning in connection with the rash of suspicious packages sent to prominent Democrats nationwide, law enforcement sources confirmed to Fox News."
        ],
        [
            "Multiple sources identified the suspect to Fox News as Cesar Sayoc of Aventura, Florida."
        ],
        [
            "A separate law enforcement source told Fox News that the suspect is a white male in his 50s, who used to live in New York and had prior arrests for terroristic threats. ",
            "Several of the packages went through a U.S. postal facility in Opa-locka, which is less than 10 miles from Aventura."
        ],
        [
            "The Department of Justice will hold a press conference at 2:30 p.m. ET."
        ],
        [
            "Federal authorities had been focusing on Florida as the location where the majority of packages originated."
        ],
        [
            "“Some of the packages went through the mail,” Homeland Security Secretary Kirstjen Nielsen earlier told Fox News. ",
            "“They originated, some of them, from Florida. ",
            "I am confident that this person or people will be brought to justice.”"
        ],
        [
            "The Miami-Dade County Police Department confirmed Thursday it was helping federal agents who were at the facility in Opa-locka as part of the ongoing investigation."
        ],
        [
            "The USPS operates an innovative imaging system that photographs each piece of mail processed throughout the country. ",
            "Investigators were likely relying on that system to pinpoint where some of the packages were mailed."
        ],
        [
            "The FBI said the packages each consisted of a manila envelope with a bubble-wrap interior containing potentially destructive devices. ",
            "The packages were addressed with a computer-printed address label and six stamps."
        ],
        [
            "A government source told Fox News the FBI was analyzing the stamps in Quantico. ",
            "The source also said the investigation had progressed “significantly” and that the FBI was reaching out to retailers to zero in on where the elements of the bombs were made and where they were sold."
        ],
        [
            "The envelopes and packaging materials likely contained a treasure trove of DNA information. ",
            "Tiny bits of genetic material – traces of sweat, skin cells, saliva, hair or fingerprints – are typically used as a roadmap to the suspect’s door, investigators and bomb experts say."
        ],
        [
            "The Washington, D.C., field office and the FBI headquarters had 24 teams in place and on the hunt for the culprit."
        ],
        [
            "Forensic investigators in Quantico, Va., have been sifting through the packages addressed to former President Barack Obama, former Secretary of State Hillary Clinton, liberal billionaire George Soros, former Attorney General Eric Holder, former CIA Director John Brennan and California Democratic Rep. Maxine Waters."
        ],
        [
            "The devices are thought to have been fashioned from crude, bomb-making designs widely available on the Internet. ",
            "Authorities haven’t said whether the devices were built to explode and kill or simply sow fear."
        ],
        [
            "Ryan Morris, founder of Tripwire Operation Group, a company that provides explosives training to law enforcement and military officials, called the devices “Mickey Mouse” bombs that were meant to be found. ",
            "He told Fox News he believes the primary motive is fear. ",
            "The packages were sent about two weeks ahead of the midterm elections."
        ],
        [
            "Regardless, investigators were treating the devices as “live” explosives New York City Police Commissioner James O’Neill said."
        ],
        [
            "Larry Johnson, a former head of criminal investigations for the U.S. Secret Service who also served as a special agent in charge of the presidential protective detail, agreed that bomb makers usually leave evidence – and their signature- behind."
        ],
        [
            "“If there is a human involved, there is a high probability you’re going to get somewhere investigatively,” he told The Associated Press. ",
            "“There will be no stone left unturned.”"
        ],
        [
            "Johnson believes it’s “highly likely” the person who built the bombs will have been previously flagged by law enforcement. ",
            "The Secret Service maintains a wide database of groups and individuals who have made threats in the past against presidents or other top political leaders and activists via email, letters or on social media."
        ],
        [
            "James Fitzgerald, a retired FBI profiler and forensic linguist who, in 1996, helped catch \"Unabomber\" Ted Kaczynski -- who killed 3 people and injured 23 in bombings between 1978 and 1995 -- told Fox News on Wednesday that the letter sent to John Brennan, the former director of the CIA and a staunch Trump critic, reminded him of something the Unabomber would send because of the number of stamps used on the package."
        ],
        [
            "“The linguist in me noticed that Debbie Wasserman Schultz, the last name is spelled missing a ‘c’ and John Brennan’s name is spelled missing an ‘n’ and that kind of surprised me and I have a feeling that was done on purpose to make this look like somebody who doesn’t really know who these people are and that it wasn’t an honest mistake. ",
            "If he had this much anger and vitriol against these people, you would think he would know how to spell their names"
        ]
    ],
    "source": "fox",
    "url": "https://www.foxnews.com/us/suspect-arrested-in-florida-in-connection-with-suspicious-packages-sent-to-democrats",
    "date": "2018-10-26"
}
