{
    "source": "hpo",
    "main-entities": [
        "Cesar Sayoc",
        "Law enforcement/Federal authorities",
        "Donald Trump"
    ],
    "main-event": "Cesar Sayoc arrested for sending pipe bombs to Trump critics",
    "title": "Cesar Sayoc Identified As Mail Bomb Suspect",
    "url": "https://www.huffingtonpost.com/entry/mail-pipe-bomb-plot-suspect_us_5bd32b4de4b0d38b5882ca62",
    "word-count": 830,
    "date": "2018-10-26",
    "uuid": "9dd8a512-94fc-4f18-893e-7bcad0e1b078",
    "triplet-uuid": "1f99798f-2b60-4ecb-b5f4-4aa7991e8ace",
    "body-paragraphs": [
        [
            "Police have arrested a suspect in connection with at least a dozen packages containing likely pipe bombs mailed in the past week to people critical of President Donald Trump."
        ],
        [
            "Cesar Sayoc, 56, of South Florida was taken into custody on Friday, FBI Director Chris Wray confirmed at a press conference."
        ],
        [
            "Sayoc has been charged with five federal crimes ― interstate transportation of an explosive, illegal mailing of explosives, making threats against former presidents and certain other persons, threatening interstate communications, and assaulting current and former federal officers ― the Department of Justice said.",
            "He faces up to 48 years in prison."
        ],
        [
            "In remarks at the White House before a youth leadership summit, Trump congratulated local and national law enforcement agencies for apprehending the suspect.",
            "The president pledged to prosecute those responsible ― “them, him, her, whoever it may be,” he said ― to the fullest extent of the law."
        ],
        [
            "“We must never allow political violence to take root in America,” Trump said."
        ],
        [
            "“The bottom line is that Americans must unify,” he went on.",
            "His comments echoed those he has delivered at rallies and sent over Twitter in the wake of the bomb scares, calling for unity and a calmer discourse but refusing to tone down his own inflammatory rhetoric."
        ],
        [
            "Minutes after addressing the threats to prominent Democrats, Trump claimed Republicans are often attacked for supporting him.",
            "“Come to think of it, does anyone get attacked more than me?” Trump said."
        ],
        [
            "The development came hours after two additional packages were discovered, one addressed to Sen. Cory Booker (D-N.J.), and the other to former Director of National Intelligence James Clapper."
        ],
        [
            "A suspicious package was also found Friday in Burlingame, California, addressed to Democratic donor Tom Steyer, CNN and NBC reported.",
            "A law enforcement source told CNN the package was similar to the other ones sent to politicians and public figures this week."
        ],
        [
            "“We’re thankful that everyone we work with at NextGen America and Need to Impeach is safe,” Steyer said in a statement Friday, referring to his super PAC NextGen and his campaign to impeach Trump.",
            "“We are seeing a systematic attack on our democracy and our rule of law that extends much further than just one isolated terrorist in Florida.",
            "Whether it’s voter suppression, voter intimidation, attacks on our free press, gerrymandering, or attempted violence ― the trust and norms that are the actual basis for our civil society and political system are being eroded.”"
        ],
        [
            "Authorities have heightened their search in Florida, as several of the packages may have passed through the state.",
            "The FBI said Friday that the package for Booker was found in a Florida mail facility."
        ],
        [
            "Throughout the week, more than 10 packages containing potential explosive devices have been mailed to lawmakers and other public figures critical of Trump, including former President Barack Obama, former President Bill Clinton, Trump’s 2016 presidential opponent Hillary Clinton, Rep. Maxine Waters (D-Calif.), actor Robert De Niro and former CIA Director John Brennan."
        ],
        [
            "The package addressed Brennan was sent to CNN’s New York City bureau, sparking an evacuation Wednesday.",
            "Brennan is an MSNBC and NBC contributor.",
            "On Friday, postal officials intercepted the package for Clapper, a CNN contributor, before it could reach the CNN offices, where it was addressed, according to the network."
        ],
        [
            "The Sacramento County Sheriff Department also said Friday that a suspicious package found at a Sacramento mail facility and addressed to Sen. Kamala Harris (D-Calif.) contained an explosive device.",
            "FBI officials said they believed the package to be related to the others mailed out this week."
        ],
        [
            "All of the confirmed packages listed the Florida office of Rep. Debbie Wasserman Schultz (D-Fla.), the former chairwoman of the Democratic National Committee, as the return address."
        ],
        [
            "Asked why Sayoc appeared to be targeting Democratic politicians and others critical of Trump, Attorney General Jeff Sessions said he didn’t know but that the suspect “appears to be a partisan”"
        ],
        [
            "Wray added: “It’s too early at this stage to discuss motive.”"
        ],
        [
            "Investigators identified Sayoc based on a fingerprint found on the package sent to Waters and a DNA sample from a previous arrest in Florida, DOJ officials said Friday."
        ],
        [
            "When law enforcement arrested him on Friday in Plantation, Florida, they also took possession of a van covered in stickers supporting Trump and criticizing Democratic officials."
        ],
        [
            "Sayoc is a registered Republican and a self-described promoter and booking agent.",
            "He has a history of multiple arrests, including for felony grand theft and misdemeanor retail theft."
        ],
        [
            "A spokeswoman for Brevard College in North Carolina confirmed to HuffPost that Sayoc attended the school for three semesters starting in the fall of 1980 and did not graduate."
        ],
        [
            "Authorities were initially vague about the content of the packages, calling them simply “suspected explosive devices.”",
            "Wray elaborated at Friday’s press briefing that each device contained roughly 6 inches of PVC pipe, as well as a small clock and wiring.",
            "“These are not hoax devices,” he said."
        ],
        [
            "Wray noted that the investigation was ongoing and warned there could be other packages not yet intercepted."
        ]
    ]
}
