{
    "uuid": "49633772-4f25-4048-8da1-09ed3fcab44a",
    "main-event": "Trump critic Peter Strzok fired from FBI",
    "main-entities": [
        "Donald Trump",
        "Peter Strzok"
    ],
    "title": "F.B.I. Agent Peter Strzok, Who Criticized Trump in Texts, Is Fired",
    "triplet-uuid": "2a3fde8a-082a-4d8f-9567-f7e8366c0200",
    "body-paragraphs": [
        [
            "WASHINGTON — Peter Strzok, the F.B.I. senior counterintelligence agent who disparaged President Trump in inflammatory text messages and helped oversee the Hillary Clinton email and Russia investigations, has been fired for violating bureau policies, Mr. Strzok’s lawyer said Monday."
        ],
        [
            "Mr. Trump and his allies seized on the texts — exchanged during the 2016 campaign with a former F.B.I. lawyer, Lisa Page — in assailing the Russia investigation as an illegitimate “witch hunt.” ",
            "Mr. Strzok, who rose over 20 years at the F.B.I. to become one of its most experienced counterintelligence agents, was a key figure in the early months of the inquiry."
        ],
        [
            "Along with writing the texts, Mr. Strzok was accused of sending a highly sensitive search warrant to his personal email account."
        ],
        [
            "The F.B.I. had been under immense political pressure by Mr. Trump to dismiss Mr. Strzok, who was removed last summer from the staff of the special counsel, Robert S. Mueller III. ",
            "The president has repeatedly denounced Mr. Strzok in posts on Twitter, and on Monday expressed satisfaction that he had been sacked."
        ],
        [
            "Mr. Trump’s victory traces back to June, when Mr. Strzok’s conduct was laid out in a wide-ranging inspector general’s report on how the F.B.I. handled the investigation of Hillary Clinton’s emails in the run-up to the 2016 election. ",
            "The report was critical of Mr. Strzok’s conduct in sending the texts, and the bureau’s Office of Professional Responsibility said that Mr. Strzok should be suspended for 60 days and demoted. ",
            "Mr. Strzok had testified before the House in July about how he had not allowed his political views to interfere with the investigations he was overseeing."
        ],
        [
            "But Mr. Strzok’s lawyer said the deputy director of the F.B.I., David Bowdich, had overruled the Office of Professional Responsibility and fired Mr. Strzok."
        ],
        [
            "A spokeswoman for the F.B.I. did not respond to a message seeking comment about why Mr. Strzok was dismissed rather than demoted. ",
            "Firing Mr. Strzok, however, removes a favorite target of Mr. Trump from the ranks of the F.B.I. and gives Mr. Bowdich and the F.B.I. director, Christopher A. Wray, a chance to move beyond the president’s ire."
        ],
        [
            "Aitan Goelman, Mr. Strzok’s lawyer, denounced his client’s dismissal. ",
            "“The decision to fire Special Agent Strzok is not only a departure from typical bureau practice, but also contradicts Director Wray’s testimony to Congress and his assurances that the F.B.I. intended to follow its regular process in this and all personnel matters,” Mr. Goelman said."
        ],
        [
            "“This decision should be deeply troubling to all Americans,” Mr. Goelman added. ",
            "“A lengthy investigation and multiple rounds of congressional testimony failed to produce a shred of evidence that Special Agent Strzok’s personal views ever affected his work.”"
        ],
        [
            "Mr. Strzok’s text exchanges with Ms. Page demonstrated animosity toward Mr. Trump. ",
            "In one, Ms. Page asks: Trump is “not ever going to become president, right? Right?!” ",
            "Mr. Strzok responds: “No. No he won’t. We’ll stop it.” ",
            "The inspector general, who uncovered the messages, found no evidence that the pair imposed their political views on their investigative decisions but cited that exchange as “not only indicative of a biased state of mind but, even more seriously, implies a willingness to take official action to impact the presidential candidate’s electoral prospects.”"
        ],
        [
            "The report by the inspector general, Michael E. Horowitz, that preceded Mr. Strzok’s firing not only criticized his conduct in sending the texts but also his use of personal email accounts to handle sensitive information. ",
            "In addition, the inspector general criticized Mr. Strzok’s decision not to move swiftly to examine new emails related to the Clinton investigation just weeks before the 2016 election."
        ],
        [
            "Mr. Horowitz said in his report that he was “deeply troubled” by the text messages. ",
            "Hundreds exchanged over months were found in which the pair disparaged Mr. Trump and, to a lesser extent, Mrs. Clinton, exchanged work gossip and bantered."
        ],
        [
            "On Twitter, Mr. Strzok said he was “deeply saddened by this decision,” adding, “It has been an honor to serve my country and work with the fine men and women of the FBI.”"
        ],
        [
            "Mr. Strzok became emblematic of Mr. Trump’s unfounded assertions that a so-called deep state of bureaucrats opposed to him was undermining his presidency. ",
            "Mr. Trump contended that Mr. Strzok targeted the president and accused Mr. Strzok of being “treasonous” and a “disgrace.” ",
            "Mr. Strzok told lawmakers that he never leaked information about the Russia inquiry, which could have upended the election and hurt Mr. Trump’s chances of becoming president."
        ],
        [
            "After Mr. Horowitz uncovered the texts, Mr. Mueller, who had by then taken over the investigation, removed Mr. Strzok from his team. ",
            "He was reassigned to the F.B.I.’s human resources division. ",
            "Ms. Page, who had left Mr. Mueller’s team before the discovery of the text messages, quit the F.B.I. in May."
        ],
        [
            "The inspector general’s report also took issue with the reaction by Mr. Strzok and other F.B.I. officials to the discovery of possible new evidence in the Clinton investigation, known internally as Midyear Exam, in late September 2016 on a laptop that belonged to the disgraced politician Anthony D. Weiner, the husband of a top Clinton aide."
        ],
        [
            "At the time, Mr. Strzok was in the early stages of investigating whether any Trump associates had conspired with Russia’s interference in the presidential election, and nearly a month passed before agents and analysts began to act on the emails found on Mr. Weiner’s laptop. ",
            "Mr. Horowitz could not rule out that Mr. Strzok had slow-walked the examination of the new emails to help Mrs. Clinton’s presidential bid."
        ],
        [
            "“Under these circumstances, we did not have confidence that Strzok’s decision to prioritize the Russia investigation over following up on the Midyear-related investigative lead discovered on the Weiner laptop was free from bias,” he wrote."
        ],
        [
            "The delays were merely the “result of bureaucratic snafus,” Mr. Strzok’s lawyer wrote last month in USA Today."
        ],
        [
            "But the justifications for the delay were “unpersuasive” and had “far-reaching consequences,” the inspector general said. ",
            "James B. Comey, the former F.B.I. director, has told investigators that if he had known about the emails earlier, it might have influenced his decision to alert Congress to their existence days before the election."
        ],
        [
            "In addition, the inspector general said that Mr. Strzok had forwarded a proposed search warrant to his personal email account. ",
            "The inspector general said the email, which included a draft of the search warrant affidavit, contained information that appeared to be under seal."
        ],
        [
            "In a heated congressional hearing last month, Mr. Strzok expressed “significant regret” for the texts and rebutted the president’s attacks on the Russia inquiry. ",
            "“This investigation is not politically motivated; it is not a witch hunt; it is not a hoax,” he said."
        ],
        [
            "Mr. Strzok’s dismissal was not unexpected. ",
            "He is the second senior F.B.I. agent to be fired as a result of the inspector general’s investigation. ",
            "In March, Andrew G. McCabe, the former deputy director, was fired after the inspector general repeatedly faulted him for misleading investigators."
        ],
        [
            "The firing was politically motivated, Mr. McCabe has said, as an effort to discredit him as a witness in the special counsel investigation."
        ],
        [
            "Both men were fired before they were eligible for their pension and health benefits."
        ],
        [
            "Mr. Strzok, 48, a graduate of Georgetown University, served as an officer in the Army before he joined the F.B.I. ",
            "He held several key positions in the F.B.I., eventually becoming a top deputy in the counterintelligence division."
        ],
        [
            "He handled many important espionage cases including one involving a former C.I.A. officer suspected of working for China and a group of Russian spies who had been working undercover in the United States."
        ]
    ],
    "source": "nyt",
    "url": "https://www.nytimes.com/2018/08/13/us/politics/peter-strzok-fired-fbi.html",
    "date": "2018-08-13"
}
