{
    "uuid": "a058510f-e08f-40f1-81bb-43878ee41825",
    "main-event": "Trump Accuses Social Media Firms of Discrimination Against Conservatives",
    "main-entities": [
        "Donald Trump",
        "social media companies"
    ],
    "title": "Trump says 'too many voices are being destroyed' by social media censorship",
    "triplet-uuid": "ad409798-ee94-4436-92c5-92669193be14",
    "body-paragraphs": [
        [
            "President Trump on Saturday took aim at social media tech giants for “discriminating” against Republicans and conservatives -- saying that “too many voices are being destroyed” and promising that his administration would not allow it to happen."
        ],
        [
            "“Who is making the choices, because I can already tell you that too many mistakes are being made. ",
            "Let everybody participate, good & bad, and we will all just have to figure it out!” he said at the end of a lengthy post on Twitter."
        ],
        [
            "Both Facebook and Twitter have been under fire for allegedly censoring accounts, while ignoring rules violations by liberal and left-wing users. ",
            "Trump in the past has referred to alleged “shadow banning” by Twitter as “discriminatory and illegal.”"
        ],
        [
            "Trump uses Twitter on a daily basis, and his campaign was credited for its use of Facebook as one of the ways it secured its victory in November 2016."
        ],
        [
            "While conservatives have complained for years about what they say is discrimination by the tech giants, the controversy escalated last month when Vice News reported the issue, saying that accounts from top Republicans including GOP Chairwoman Ronna McDaniel were being given limited visibility on Twitter. ",
            "Twitter at the time said it was an algorithmic glitch that has since been fixed."
        ],
        [
            "\"We do not shadow ban. ",
            "You are always able to see the tweets from accounts you follow (although you may have to do more work to find them, like go directly to their profile). ",
            "And we certainly don’t shadow ban based on political viewpoints or ideology,\" the tech giant said in a statement."
        ],
        [
            "\"We do rank tweets and search results. ",
            "We do this because Twitter is most useful when it’s immediately relevant. ",
            "These ranking models take many signals into consideration to best organize tweets for timely relevance,\" the statement said. ",
            "\"We must also address bad-faith actors who intend to manipulate or detract from healthy conversation.\""
        ],
        [
            "A Facebook executive apologized last month for mistreating Diamond and Silk -- two pro-Trump personalities who have long claimed they are being censored by the platform, but the company has also denied being biased against conservatives."
        ],
        [
            "“We badly mishandled our communications with them,” Monika Bickert, head of Global Policy Management at Facebook, said at a House Judiciary Committee hearing."
        ],
        [
            "But that has done little to calm the controversy, and Trump on Saturday accused social media sites of “closing down the opinions of many people on the right, while at the same time doing nothing to others.”"
        ],
        [
            "\"Too many voices are being destroyed, some good & some bad, and that cannot be allowed to happen,\" he tweeted."
        ],
        [
            "He went on to call censorship “a dangerous thing” and then took a swipe at CNN and MSNBC, saying that while they are “fake,” he does not demand that offending content be taken off air."
        ],
        [
            "“If you are weeding out Fake News, there is nothing so Fake as CNN & MSNBC, & yet I do not ask that their sick behavior be removed,” he tweeted. ",
            "“I get used to it and watch with a grain of salt, or don’t watch at all..”",
            ""
        ]
    ],
    "source": "fox",
    "url": "http://www.foxnews.com/politics/2018/08/18/trump-says-too-many-voices-are-being-destroyed-by-social-media-censorship.html",
    "date": "2018-08-18"
}
