{
    "source": "hpo",
    "main-entities": ["Donald Trump"],
    "main-event": "Democrats Say Trump Should Cancel Putin Meeting After Indictments",
    "title": "John McCain, Top Democrats Call On Trump To Cancel Putin Meeting",
    "url": "https://www.huffingtonpost.com/entry/mccain-democrats-trump-cancel-putin-summit_us_5b4951b0e4b022fdcc597d9b",
    "word-count": 635,
    "date": "2018-07-13",
    "uuid": "f2571aa2-563a-4850-9bb4-37721d7d95df",
    "triplet-uuid": "c6a0e65c-4f8b-41de-8200-cd700f683c64",
    "body-paragraphs": [
        [
            "Sen. John McCain (R-Ariz.), Senate Minority Leader Chuck Schumer (D-N.Y.) and 18 members of the House Foreign Affairs Committee called on President Donald Trump to cancel his meeting with Russian President Vladimir Putin after indictments were announced Friday accusing a dozen Kremlin intelligence officers of hacking Democratic Party emails during the 2016 presidential campaign."
        ],
        [
            "But a senior administration source told NBC on Friday that there was “zero” chance the controversial private meeting between the two men would be canceled."
        ],
        [
            "McCain tweeted that if Trump “is not prepared to hold Putin accountable,” the talks in Helsinki on Monday “should not move forward.”"
        ],
        [
            "He said the indictments are evidence of an “extensive plot” by Putin’s government to “attack the 2016 election, sow chaos and dissension among the American electorate, and undermine faith in our democracy.”"
        ],
        [
            "Schumer said in a statement that “glad-handing with Vladimir Putin on the heels of these indictments would be an insult to our democracy.”",
            "He said the one-on-one meeting should not take place until “Russia takes demonstrable and transparent steps to prove that they won’t interfere in future elections.”"
        ],
        [
            "Sen. Elizabeth Warren (D-Mass.) tweeted tersely to Trump to “cancel your ridiculous Putin summit and get your butt on a plane back to the United States.”"
        ],
        [
            "Sen. Mark Warner, the top Democrat on the Senate Intelligence Committee, also said he is concerned that Putin will take “full advantage of an ill-prepared” Trump.",
            "The president has said he plans to meet with the Russian leader alone.",
            "“There should be no one-on-one meeting between President Trump and Vladimir Putin,” Warner told reporters Friday."
        ],
        [
            "Rep. Ted Lieu (D-Calif.) also called for the cancellation of the meeting, saying that Trump “cannot claim to love the U.S. while meeting with ... a man who is overseeing an all-out attack on America’s democracy.”",
            "He was one of several members of the House Foreign Affairs Committee who signed a letter calling on Trump to cancel."
        ],
        [
            "Rep. David Cicilline (D-R.I.) tweeted to Trump: “Don’t hand another dictator a propaganda victory.”"
        ],
        [
            "Most Republicans were keeping mum.",
            "A terse response from the GOP only said: “No collusion.”",
            "But the investigation is ongoing, and there hasn’t yet been a determination on possible collusion with the Trump campaign."
        ],
        [
            "The indictments did reveal that attempts to hack into Democratic Party emails occurred later the same day that Trump called on Russians in a speech to uncover emails that his rival Hillary Clinton had held on a private server."
        ],
        [
            "“I will tell you this, Russia: If you’re listening, I hope you’re able to find the 30,000 emails that are missing,” Trump said at a Florida news conference on July 27, 2016.",
            "“I think you will probably be rewarded mightily by our press.”"
        ],
        [
            "White House officials were reportedly furious that the indictments were announced by U.S. Deputy Attorney General Rod Rosenstein on Friday morning, just days before the planned summit with Putin."
        ],
        [
            "“It’s a big F-U from [special prosecutor Robert] Mueller,” a White House official told Politico, adding that it “wasn’t an accident” that the indictments were announced before the Helsinki summit."
        ]
    ]
}
