{
    "keywords": "",
    "word-count": 824,
    "date": "2018-07-13",
    "uuid": "8fab0133-9b78-42b9-b0c3-e35f9134a298",
    "body-paragraphs": [
        [
            "Democrats Say Trump Should Cancel Putin Meeting After Indictments"
        ],
        [
            "WASHINGTON — Leading Democrats called Friday for President Trump to cancel his upcoming meeting with President Vladimir V. Putin of Russia after the Justice Department indicted 12 Russian intelligence officers accused of hacking Democrats’ emails and computer networks during the 2016 presidential race."
        ],
        [
            "Top Republicans were mostly mute, though a handful — including Representative Ed Royce of California, the retiring chairman of the House Foreign Affairs Committee; Senator John McCain of Arizona, the chairman of the Senate Armed Services Committee, who has brain cancer; and Senator Ben Sasse of Nebraska, a frequent critic of Mr. Trump — urged the president to use the indictments to get tough with Mr. Putin when they meet on Monday in Helsinki, Finland."
        ],
        [
            "“President Trump must be willing to confront Putin from a position of strength and demonstrate that there will be a serious price to pay for his ongoing aggression towards the United States and democracies around the world,” Mr. McCain said in a statement.",
            "“If President Trump is not prepared to hold Putin accountable, the summit in Helsinki should not move forward.”"
        ],
        [
            "A grand jury indicted the officers on Friday, accusing them of conspiring to interfere with the outcome of the 2016 presidential election by hacking the Democratic National Committee, Hillary Clinton’s presidential campaign and the Democratic Congressional Campaign Committee.",
            "The indictment is part of an open investigation led by Robert S. Mueller III, the special counsel, who is examining whether the Trump campaign colluded with Russia, and whether Mr. Trump obstructed justice."
        ],
        [
            "“These indictments are further proof of what everyone but the president seems to understand: President Putin is an adversary who interfered in our elections to help President Trump win,” Senator Chuck Schumer of New York, the Democratic leader, said, adding that Mr. Trump should cancel the meeting “until Russia takes demonstrable and transparent steps to prove that they won’t interfere in future elections.”"
        ],
        [
            "A number of Democrats lined up behind Mr. Schumer.",
            "Some on the House Foreign Affairs Committee also called for Mr. Trump to cancel the Monday session, as did Representative Adam B. Schiff of California, the senior Democrat on the House Intelligence Committee, and Senator Dianne Feinstein of California, the top Democrat on the Senate Judiciary Committee."
        ],
        [
            "Representative Jerrold Nadler of New York, the top Democrat on the House Judiciary Committee, stopped short of calling on Mr. Trump to cancel, but he said the president should insist that other Americans be present and should demand that Mr. Putin extradite those indicted."
        ],
        [
            "“I would not trust the president alone with Putin without some other Americans in the administration in there,” he said.",
            "“For the president to break with the normal practice and meet with the Russian president alone, I wouldn’t trust what he says there.”"
        ],
        [
            "The charges were announced here on Friday by Rod J. Rosenstein, the deputy attorney general, who made clear during a news conference that the Justice Department views the hacking not as an attack on one party, but as an attack against the United States."
        ],
        [
            "“It’s important for us to avoid thinking politically, as Republicans or Democrats, and instead to think patriotically as Americans,” Mr. Rosenstein said.",
            "“Our response must not depend on which side was victimized.”"
        ],
        [
            "Mr. Sasse echoed that sentiment."
        ],
        [
            "“The U.S. intelligence community knows that the Russian government attacked the U.S.,” Mr. Sasse said.",
            "“This is not a Republican or a Democrat view — it is simply the reality.",
            "All patriotic Americans should understand that Putin is not America’s friend, and he is not the president’s buddy.",
            "We should stand united against Putin’s past and planned future attacks against us.”"
        ],
        [
            "But with the exception of Mr. McCain, Republicans steered clear of discussing whether Mr. Trump should cancel Monday’s meeting in Helsinki.",
            "Senator Mitch McConnell, Republican of Kentucky and the majority leader, did not have any immediate reaction, while a spokeswoman for Speaker Paul D. Ryan of Wisconsin said simply that Mr. Ryan was “glad these hackers are being held to account.”"
        ],
        [
            "Representative Jim Jordan, Republican of Ohio, a founder of the conservative House Freedom Caucus, asked if Mr. Trump should demand extradition of the hackers, said, “I’ll leave that to the president.”",
            "Mr. Jordan said the president has already “been clear he is going to ask Mr. Putin some tough questions.”"
        ],
        [
            "The chairman of the House Oversight and Government Reform Committee, Representative Trey Gowdy, Republican of South Carolina, said he intends to hold a hearing on election security at the end of July.",
            "But asked if Mr. Trump should recalibrate his approach to the Putin meeting, Mr. Gowdy said, “That’s above my pay grade.”"
        ],
        [
            "But Mr. Royce, of California, called Friday for Mr. Trump to “use today’s indictments to challenge”",
            "Mr. Putin at Monday’s summit meeting, adding, “We can’t afford to give an inch of ground in defending democracy.”"
        ]
    ],
    "triplet-uuid": "c6a0e65c-4f8b-41de-8200-cd700f683c64",
    "title": "Democrats Say Trump Should Cancel Putin Meeting After Indictments",
    "source": "nyt",
    "url": "https://www.nytimes.com/2018/07/13/us/politics/democrats-russia-hacking-indictments.html?action=click&module=RelatedCoverage&pgtype=Article&region=Footer",
    "main-event": "Democrats Say Trump Should Cancel Putin Meeting After Indictments",
    "main-entities": ["Donald Trump"]
}
