{
    "triplet-uuid": "c6a0e65c-4f8b-41de-8200-cd700f683c64",
    "url": "http://www.foxnews.com/politics/2018/07/13/democrats-urge-trump-to-cancel-putin-summit-after-indictment-russian-intel-officers.html",
    "keywords": "",
    "word-count": 578,
    "body-paragraphs": [
        [
            "Democrats urge Trump to cancel Putin summit, after indictment of Russian intel officers"
        ],
        [
            "Top Democrats on Friday swiftly pressured President Trump to consider cancelling his upcoming summit with Vladimir Putin, after a dozen Russian intelligence officers were indicted for allegedly hacking party emails in 2016."
        ],
        [
            "Sen. Mark Warner, top Democrat on the Senate Intelligence Committee, offered Trump an ultimatum for the highly anticipated summit: make Russian interference a priority, or cancel the meeting."
        ],
        [
            "Other Democrats said Trump should nix the summit regardless -- though they were raising concerns about the meeting even before the indictment."
        ],
        [
            "Deputy Attorney General Rod Rosenstein announced the charges during a Friday press conference.",
            "According to the DOJ document, 12 Russian intelligence officers are accused of hacking emails from the Hillary Clinton campaign and Democratic Party during the 2016 election."
        ],
        [
            "“I want to make sure that other Americans hear ... the president make this issue of Russian interference a priority in the meeting,” Warner, D-Va., told reporters on Capitol Hill Friday.",
            "“If they don’t make the indictments a priority in the meeting in Helsinki, then the summit should be canceled.”"
        ],
        [
            "Warner, whose committee has been investigating Russian meddling and potential collusion with Trump campaign associates in the 2016 election for more than a year, also stressed that there “needs to be other Americans in the room” in Helsinki, Finland Monday to ensure that Trump makes the issue of interference in the 2016 election a “priority.”"
        ],
        [
            "“There should be no one-on-one meeting between this president and Putin,” Warner said.",
            "“There needs to be other Americans in the room, or the summit should be canceled.”"
        ],
        [
            "He warned, “I’m afraid the president could be taken advantage of.”"
        ],
        [
            "But as Trump continues to describe the Russia probe as a \"witch hunt,\" the White House downplayed the latest allegations."
        ],
        [
            "“Today’s charges include no allegations of knowing involvement by anyone on the campaign and no allegations that the alleged hacking affected the election result,” said Lindsay Walters, the deputy White House press secretary.",
            "“This is consistent with what we have been saying all along.”"
        ],
        [
            "Within minutes of the indictment, Senate Minority Leader Chuck Schumer, D-N.Y., urged Trump to call off the Putin meeting."
        ],
        [
            "“Cancel the Putin meeting. Now,” Schumer tweeted Friday."
        ],
        [
            "Sen. Ron Wyden, D-Ore., said a handshake with Putin would be \"a moment of historic cowardice.\""
        ],
        [
            "\"In light of what's been revealed about Russia’s attack on our democracy, the president shaking Putin's hand would be a moment of historic cowardice.",
            "Call off this summit, @realDonaldTrump,\" Wyden tweeted."
        ],
        [
            "Sen. Jack Reed, D-R.I., said Trump should “immediately cancel his meeting.”"
        ],
        [
            "House Democratic Leader Nancy Pelosi, D-Calif., said “the stakes” for the summit “could not be higher.”"
        ],
        [
            "“President Trump must demand and secure a real, concrete and comprehensive agreement that the Russians will cease their ongoing attacks on our democracy,” Pelosi said in a statement Friday.",
            "“Failure to stand up to Putin would constitute a profound betrayal of the Constitution and our democracy.”"
        ],
        [
            "Presuming the meeting takes place as scheduled, Helsinki will be the final stop on Trump’s four-nation European tour."
        ],
        [
            "Trump spent the past week meeting with NATO allies in Brussels; meeting with British Prime Minister Theresa May and Queen Elizabeth II in England; and visiting Scotland."
        ]
    ],
    "uuid": "2da92159-d4e4-4045-85c2-bc67c0f3872c",
    "source": "fox",
    "title": "Democrats urge Trump to cancel Putin summit, after indictment of Russian intel officers",
    "date": "2018-07-13",
    "main-event": "Democrats Say Trump Should Cancel Putin Meeting After Indictments",
    "main-entities": ["Donald Trump"]
}
