{
    "source": "hpo",
    "main-entities": ["Duncan Hunter", "Margaret Hunter"],
    "main-event": "Congressman Hunter and wife indicted on corruption charges",
    "title": "GOP Rep. Duncan Hunter, Wife Indicted On Campaign Finance Fraud Charges",
    "url": "https://www.huffingtonpost.com/entry/duncan-hunter-margaret-hunter_us_5b7c83b7e4b0cd327df795f9",
    "word-count": 521,
    "date": "2018-08-21",
    "uuid": "a1f10f4a-4ea8-43dc-8e15-1094d1f8d7af",
    "triplet-uuid": "eb17fa36-89f2-4d0b-8133-7bb4682228e1",
    "body-paragraphs": [
        [
            "U.S. Rep. Duncan Hunter (R-Calif.) and his wife, Margaret Hunter, were indicted Tuesday on charges of improperly using campaign funds for private use."
        ],
        [
            "A grand jury in San Diego indicted the Hunters on charges of filing false campaign finance records, saying the couple misused more than $250,000 after a two-year investigation.",
            "The Justice Department said the pair used political money to pay for their children’s tuition and spent thousands of dollars at shopping malls, Washington restaurants and surf shops, among other expenditures."
        ],
        [
            "The indictment includes details accusing the Hunters of making efforts to hide their personal expenses, including labeling fees for dental work as a donation to a charity called “Smiles for Life” and tickets to see Riverdance as a fundraising event for “Republican women.”"
        ],
        [
            "Hunter, 41, is a five-term congressman representing San Diego County who served for three tours in Afghanistan and Iraq as a Marine.",
            "His family has been a household name in California politics for decades, and his father, also named Duncan Hunter, served in the U.S. House for nearly 30 years until handing the reins to his son."
        ],
        [
            "Hunter had blamed his wife, who acted as a campaign manager, for many of the improper charges, saying she controlled the campaign’s credit card, and in February he feigned ignorance in an interview with Politico, saying: “Nah, I know the rules.”"
        ],
        [
            "“And if I did” spend campaign funds improperly, he said, “it was an accident and I paid it back.”"
        ],
        [
            "He repaid his campaign more than $60,000 earlier this year for improper expenses dating back to 2015, but the FBI began investigation additional charges dating back as far as 2009, according to the San Diego Union-Tribune."
        ],
        [
            "“The goal of the conspiracy was for Duncan Hunter and Margaret Hunter to enrich themselves, and others at their direction, by converting campaign funds for their own personal benefit and enjoyment,” the 47-page indictment says.",
            "“The Hunters knew that many of their desired purchases could be made only by using campaign funds, since they did not otherwise have sufficient personal funds to pay for their purchases.”"
        ],
        [
            "In a speech earlier this month, Hunter echoed President Donald Trump and castigated the Justice Department, accusing the agency of being “corrupt, answerable to no one” and said it “uses the law to extort the American people and effect political change.”"
        ],
        [
            "“I call on this Congress to root out all the corrupt lawyers and bureaucrats in the DOJ and the FBI so the greatest president of my generation can do the work that the American people duly elected him to do,” Hunter said."
        ],
        [
            "The lawmaker is running for re-election in November against Democrat Ammar Campa-Najjar."
        ],
        [
            "When HuffPost asked Hunter how his campaign was going at the end of July, just before House lawmakers left for the August break, Hunter said things were good."
        ],
        [
            "“I don’t think there’s a big wave right now,” Hunter said, referring to a wave of Democratic gains.",
            "He said polling had him safely above his opponent — “We’re looking good” — and he indicated he wasn’t really afraid of losing."
        ],
        [
            "“The Republicans left in California are pretty well-liked by their constituents,” he said."
        ]
    ]
}
