{
    "source": "fox",
    "main-entities": ["Duncan and Margaret Hunter"],
    "main-event": "Congressman Hunter and wife indicted on corruption charges",
    "title": "Rep. Duncan Hunter, wife indicted on corruption charges in California",
    "url": "http://www.foxnews.com/politics/2018/08/21/rep-duncan-hunter-wife-indicted-on-corruption-charges-in-california.html",
    "word-count": 412,
    "date": "2018-08-21",
    "uuid": "85642250-766d-4a22-9432-f5e9b2762bcd",
    "triplet-uuid": "eb17fa36-89f2-4d0b-8133-7bb4682228e1",
    "body-paragraphs": [
        [
            "Rep. Duncan Hunter, R-Calif., and his wife, Margaret, were indicted on charges of illegally converting $250,000 in campaign funds for personal expenses and filing false records, prosecutors announced Tuesday."
        ],
        [
            "In response, House Speaker Paul Ryan said Tuesday evening that he would remove the congressman from all committee assignments for the time being, calling the charges against Hunter “deeply serious.”"
        ],
        [
            "Among the allegations named in the 48-page indictment included instances between 2009 and 2016 when Hunter and his wife used campaign funds to pay for family vacations to Italy and Hawaii, school tuition, dental work, and even domestic and international travel for almost a dozen relatives, according to a press release from the Southern District of California’s U.S. Attorney’s Office."
        ],
        [
            "The indictment also alleged that the pair spent “tens of thousands of dollars” on items ranging from movie tickets, fast food, golf outings, groceries and home utilities."
        ],
        [
            "Fox News obtained a letter sent from Hunter's attorney, Gregory A. Vega, to U.S. Deputy Attorney General Rod J. Rosenstein on Aug. 6 asking him to postpone the indictment."
        ],
        [
            "Vega contended that there was a \"rush to indict\" after a two-year grand jury investigation."
        ],
        [
            "Vega asserted the prosecution was \"politically motivated\" because of Hunter's early support of Donald Trump for president.",
            "He also claimed bias from prosecutors in the Southern District of California who supported Hillary Clinton's candidacy."
        ],
        [
            "The congressman's lawyers said in 2017 that Hunter and his wife repaid the campaign about $60,000."
        ],
        [
            "Prosecutors said Hunter and his wife “mischaracterized” the purchases in Federal Election Commission (FEC) filings to hide the illicit spending."
        ],
        [
            "“Family dental bills paid with campaign funds were characterized as a charitable contribution to ‘Smiles for Life,’” the press release from the U.S. Attorney’s Office said as an example."
        ],
        [
            "Charges included conspiracy to commit offenses against the United States, wire fraud and falsifying records."
        ],
        [
            "Hunter, one of Trump’s earliest supporters in the presidential race, allegedly was aware of what he and his wife were doing and continued to spend campaign funds on personal expenses despite multiple warnings from his campaign treasurer about “questionable purchases.”"
        ],
        [
            "“According to the indictment, the Hunters knew that many of their desired purchases could be made only by using campaign funds, since they did not otherwise have sufficient personal funds to pay for their purchases,” according to the U.S. Attorney’s Office."
        ],
        [
            "U.S. Attorney Adam Braverman said Tuesday’s indictment proved that “no one is above the law.”"
        ],
        [
            "The pair is due to be arraigned in court on Thursday morning."
        ]
    ]
}
