{
    "uuid": "93ca4051-9fa9-44f5-94f5-75806088d83f",
    "main-event": "Trump intends to end birthright citizenship",
    "main-entities": [
        "Trump",
        "birthright citizenship"
    ],
    "title": "President Wants to Use Executive Order to End Birthright Citizenship",
    "triplet-uuid": "f688c56d-7fae-42ef-b7f7-7db207b58d27",
    "body-paragraphs": [
        [
            "President Trump said he was preparing an executive order that would nullify the long-accepted constitutional guarantee of birthright citizenship in the United States, his latest attention-grabbing maneuver days before midterm congressional elections as he has sought to activate his base by vowing to clamp down on immigrants and immigration."
        ],
        [
            "“We’re the only country in the world where a person comes in and has a baby, and the baby is essentially a citizen of the United States for 85 years, with all of those benefits,” Mr. Trump told Axios during an interview that was released in part on Tuesday, making a false claim.",
            "“It’s ridiculous. It’s ridiculous. And it has to end.”"
        ],
        [
            "In fact, at least 30 other countries, including Canada, Mexico and many others in the Western Hemisphere, grant automatic birthright citizenship, according to a study by the Center for Immigration Studies, an organization that supports restricting immigration and whose work Mr. Trump’s advisers often cite."
        ],
        [
            "But Mr. Trump’s plan met with swift pushback from some even in his own party on Tuesday.",
            "House Speaker Paul D. Ryan of Wisconsin, who is retiring, said in an interview that the president “obviously” cannot eviscerate birthright citizenship by executive order."
        ],
        [
            "“You obviously cannot do that,” Ryan told WVLK, a radio station in Lexington, Ky.",
            "“I’m a believer in following the plain text of the Constitution, and I think in this case, the 14th Amendment is pretty clear, and that would involve a very, very lengthy constitutional process.”"
        ],
        [
            "Mr. Ryan compared the idea of doing so to Barack Obama’s 2012 action to grant work permits and deportation reprieves to some undocumented immigrants brought to the United States as children, which Republicans, including Mr. Trump, vociferously protested as a naked abuse of presidential power."
        ],
        [
            "Doing away with birthright citizenship for the children of undocumented immigrants was an idea Mr. Trump pitched as a presidential candidate, but there is no clear indication that he would be able to do so unilaterally, and attempting to would be certain to prompt legal challenges.",
            "The consensus among legal scholars is that he cannot, but Mr. Trump and his allies are eager to test it in the Supreme Court."
        ],
        [
            "“We all cherish the language of the 14th Amendment, but the Supreme Court of the United States has never ruled on whether the language of the 14th Amendment — ’subject to the jurisdiction thereof’ — applies specifically to people who are in the country illegally,” Vice President Mike Pence told Politico in an interview on Tuesday, several hours after Mr. Trump’s comments were reported."
        ],
        [
            "It is likewise unknown how serious Mr. Trump is about taking the action.",
            "In recent days, with the approach of the midterm balloting in which Republican control of Congress is at risk, he has sought to appeal to voters by making other dramatic claims that appear to have no chance of materializing, such as imminent action to grant a 10 percent tax cut for the middle class."
        ],
        [
            "To accomplish the idea he floated on Tuesday, Mr. Trump would have to find a way around the 14th Amendment to the Constitution, which states, “All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States and of the State wherein they reside.”"
        ],
        [
            "The amendment means that any child born in the United States is considered a citizen.",
            "Amendments to the Constitution cannot be overridden by presidential action — they can be changed or undone only by overwhelming majorities in Congress or the states, with a two-thirds vote of both houses of Congress or through a constitutional convention called for by two-thirds of state legislatures."
        ],
        [
            "Some conservatives have long made the argument that the 14th Amendment was meant to apply only to citizens and legal permanent residents, not immigrants who are present in the country without authorization.",
            "In an opinion piece in The Washington Post this year, Michael Anton, a former spokesman for Mr. Trump’s National Security Council, said birthright citizenship was based on a misreading of the amendment, and of an 1898 Supreme Court ruling that he argued pertained only to the children of legal residents."
        ],
        [
            "“The notion that simply being born within the geographical limits of the United States automatically confers U.S. citizenship is an absurdity — historically, constitutionally, philosophically and practically,” Mr. Anton wrote in July.",
            "“An executive order could specify to federal agencies that the children of noncitizens are not citizens.”"
        ],
        [
            "Mr. Trump told Axios that while he initially believed he needed a constitutional amendment or action by Congress to make the change, the White House Counsel’s Office has advised him otherwise."
        ],
        [
            "“Now they’re saying I can do it just with an executive order,” Mr. Trump said.",
            "The White House did not immediately respond to requests for clarification of the legal grounds the president’s lawyers have given him for validating such a move."
        ],
        [
            "His discussion of the idea comes after the administration announced it was streaming more than 5,000 active-duty troops to the southern border, part of an election-season rash of executive action Mr. Trump has undertaken as he works to energize his anti-immigrant base."
        ],
        [
            "It also follows action by the Trump administration to try to discourage legal immigrants from using public benefits through a new federal rule that would deny green card status to people who use social safety net services, like food assistance and Medicaid."
        ],
        [
            "The proposal provoked outrage among civil rights groups, a response that Mr. Trump’s advisers have argued privately is a central objective of many of the president’s most aggressive proposals on immigration and other matters."
        ],
        [
            "Jess Morales Rocketto, the chairwoman of Families Belong Together, an immigrant advocacy group, called the idea “ethnic cleansing.”"
        ],
        [
            "Kristen Clarke, the president and executive director of the Lawyers’ Committee for Civil Rights Under Law, called the idea illegal and offensive."
        ],
        [
            "“Aside from being unconstitutional, such an executive order would exacerbate racial tensions, exploit fears and drive further polarization across the country at a moment that calls for the promotion of unity and inclusion,” Ms. Clarke said in a statement.",
            "“The letter and spirit of the Fourteenth Amendment places those born in this country on equal footing, and an executive order that strips away citizenship would create a permanent group of second-class citizens and invite litigation.”"
        ],
        [
            "Some Republicans also rejected Mr. Trump’s suggestion, an indication of the political risks for the party that attend the president’s bid to stoke anti-immigrant sentiment in advance of next Tuesday’s voting."
        ],
        [
            "“The President is wrong to end #BirthrightCitizenship,” Bob Hugin, a Republican candidate for Senate in New Jersey, said in a Twitter post.",
            "“We’re a nation of immigrants made better by the diversity of its people, especially in NJ.",
            "We need compassionate comprehensive immigration reform now.”"
        ],
        [
            "A 1898 Supreme Court decision held that Wong Kim Ark, who was born in San Francisco to Chinese parents residing in the United States, was a citizen because of his birth on American soil.",
            "Mr. Anton argued in The Post that because his parents were legal residents, the ruling should not be read as an affirmation of the status of children of undocumented immigrants."
        ],
        [
            "But immigration advocates argue that scrapping the concept of birthright citizenship would do away with a vital principle, and would be counterproductive to the stated goals of those who, like Mr. Trump, rail routinely against illegal immigration.",
            "According to a study by the Migration Policy Institute, a nonpartisan group, if citizenship were denied to every child with at least one unauthorized parent, the unauthorized population in the United States would reach 24 million by 2050 — more than double what it is now."
        ],
        [
            "Stephen Legomsky, a Washington University School of Law professor and former chief counsel for U.S. Citizenship and Immigration Services, said the 14th Amendment’s application to the children of undocumented immigrants was a matter of pure common sense."
        ],
        [
            "“Like anyone else, native-born Americans, whoever their parents are, can be charged with crimes if they disobey U.S. law,” Mr. Legomsky said.",
            "“How would this be possible if the U.S. had no jurisdiction over them?”"
        ]
    ],
    "source": "nyt",
    "url": "https://www.nytimes.com/2018/10/30/us/politics/trump-birthright-citizenship.html",
    "date": "2018-10-30"
}
