{
    "uuid": "be779b0d-5737-4e7d-9c27-6f39fd63b6db",
    "main-event": "Trump intends to end birthright citizenship",
    "main-entities": [
        "Trump",
        "birthright citizenship"
    ],
    "title": "Trump vows birthright citizenship ‘will be ended one way or the other,’ as Hill debate rages",
    "triplet-uuid": "f688c56d-7fae-42ef-b7f7-7db207b58d27",
    "body-paragraphs": [
        [
            "President Trump vowed Wednesday that birthright citizenship will end “one way or the other,” a day after it emerged he was considering killing the policy by executive order -- a development that sparked disagreement among Republicans and condemnation from Democrats."
        ],
        [
            "“So-called Birthright Citizenship, which costs our Country billions of dollars and is very unfair to our citizens, will be ended one way or the other,” he tweeted. ",
            "\"It is not covered by the 14th Amendment because of the words 'subject to the jurisdiction thereof.'\""
        ],
        [
            "He also took aim at former Senate Democratic Leader Harry Reid, who he said “was right in 1993, before he and the Democrats went insane and started with the Open Borders (which brings massive crime) ‘stuff.’”"
        ],
        [
            "He was referring to comments unearthed from 1993 in which Reid said that \"no sane country\" would award citizenship to children of illegal immigrants born on its soil and promoted legislation to end the practice."
        ],
        [
            "\"If making it easy to be an illegal alien isn't enough, how about offering a reward for being an illegal immigrant? ",
            "No sane country would do that, right?\" Reid said. ",
            "\"Guess again. ",
            "If you break our laws by entering this country without permission and give birth to a child, we reward that child with U.S. citizenship and guarantee a full access to all public and social services this society provides.\""
        ],
        [
            "Reid later apologized for his stance and reversed it in 1999."
        ],
        [
            "But the comments helped Trump make his controversial case, after his push first emerged in an interview with “Axios on HBO”. ",
            "He said he wants to use an executive order to end the practice by which children born in the U.S. of non-citizen or illegal immigrant parents are immediately a citizen."
        ],
        [
            "“How ridiculous, we’re the only country in the world where a person comes in, has a baby, and the baby is essentially a citizen of the United States for 85 years with all of those benefits,” Trump said."
        ],
        [
            "The U.S. is not the only country to grant birthright citizenship, with Canada and a number of Latin American countries also doing so, but the issue has long been a contentious one in the U.S. -- particularly for those seeking to restrict illegal immigration into the U.S."
        ],
        [
            "The 14th Amendment states that “all persons born or naturalized in the United States and subject to the jurisdiction thereof, are citizens of the United States and of the State wherein they reside.” ",
            "Critics of birthright citizenship say that the amendment was never intended to apply to children of two non-citizens -- and particularly those who have come to the country illegally."
        ],
        [
            "Critics say the policy encourages illegal immigrants to come to the country, give birth and then try to claim residency themselves as a result."
        ],
        [
            "But many scholars counter that it would take a constitutional amendment to change the policy. ",
            "And the announcement Tuesday was met with a mixed reception by lawmakers in Congress, particularly the idea that Trump might use an executive order to impose such a significant immigration change -- something Republicans blasted former President Barack Obama for doing with the Deferred Action for Childhood Arrivals (DACA) policy."
        ],
        [
            "Speaker Paul Ryan, R-Wis., said in an interview with WVLK that the 14th Amendment is “pretty clear” and said that “you cannot end birthright citizenship with an executive order.” ",
            "Senate Judiciary Chairman Chuck Grassley, R-Iowa, said he will \"closely review\" the proposed executive order, but said that \"as a general matter, this is an issue that Congress should take the lead to carefully consider and debate.\""
        ],
        [
            "Sen. Lindsey Graham, R-S.C., announced he will be introducing legislation “to deal with the issue of birthright citizenship for children of illegal immigrants” and said it was a “magnet for illegal immigration in modern times.”"
        ],
        [
            "On Wednesday, Trump appeared to shift stance somewhat by avoiding saying it would be ended by executive order, while acknowledging the matter “will be settled by the United States Supreme Court.”"
        ],
        [
            "Democrats appeared united in condemnation against Trump’s move this week. ",
            "In a Tuesday appearance on \"The Late Show with Stephen Colbert,\" House Minority Leader Nancy Pelosi, D-Calif., said the Axios interview didn't surprise her."
        ],
        [
            "\"This is just more of the same of what he's been saying,\" she said, referring to Trump's remarks on immigration. ",
            "\"What he was saying today has no relationship to what his authority is, but that's of course not unusual.\""
        ]
    ],
    "source": "fox",
    "url": "https://www.foxnews.com/politics/trump-promises-birthright-citizenship-will-be-ended-one-way-or-the-other",
    "date": "2018-10-31"
}
