{
    "source": "hpo",
    "main-entities": ["Bruce Braley", "Chuck Grassley"],
    "main-event": "Bruce Braley apologizes for farmer comments",
    "title": "Democratic Senate Candidate Faces Harsh Criticism Over Farmer Comments",
    "url": "https://www.huffingtonpost.com/2014/03/26/bruce-braley-iowa_n_5034847.html",
    "word-count": 344,
    "date": "2014-03-26",
    "uuid": "7a35344d-1a8b-4e96-861f-4f9380342ba8",
    "triplet-uuid": "22b6e900-4826-4b09-a9f8-5d7afe46e78b",
    "body-paragraphs": [
        [
            "Rep. Bruce Braley (D-Iowa), who is running to succeed retiring Sen. Tom Harkin (D-Iowa), faced tough local coverage Tuesday after critical comments he made about Sen. Chuck Grassley (R-Iowa) were made public."
        ],
        [
            "At a January fundraiser in Texas, Braley urged the attorneys present to contribute to his campaign and contrasted his background with Grassley's."
        ],
        [
            "\"If you help me win this race, you may have someone with your background, your experience, your voice ... on the Senate Judiciary Committee,\" Braley said.",
            "\"Or you might have a farmer from Iowa who never went to law school, never practiced law, serving as the next chair of the Senate Judiciary Committee,\" he continued, referring to Grassley."
        ],
        [
            "Braley's remarks were released Tuesday by America Rising, a conservative political action committee which conducts opposition research on Democrats."
        ],
        [
            "One of the Republican primary field's leading candidates, businessman Mark Jacobs, immediately released a radio ad in an attempt to capitalize on the negative attention focused on Braley."
        ],
        [
            "Both the Des Moines Register and the Quad-City Times featured the backlash over Braley’s comments on their front pages."
        ],
        [
            "Braley apologized to Grassley in person on Tuesday after state Republican Party leaders and a number of Braley's potential Republican general election opponents condemned his remarks."
        ],
        [
            "The representative also posted a statement Tuesday in which he apologized and emphasized that he has farmers in his family."
        ],
        [
            "“I apologize to Sen. Grassley and anyone I may have offended,” Braley wrote.",
            "“My parents both grew up on Iowa farms during the Great Depression.",
            "It deeply influenced who they are and who I am, and gave me a profound appreciation for what farmers do for the world.”"
        ],
        [
            "Grassley, who owns a farm, often notes in Senate Judiciary Committee hearings that he is the only non-lawyer on the panel, which oversees the judicial nominations process."
        ],
        [
            "Braley went to the University of Iowa's law school and worked as a lawyer in private practice before he was elected to the House of Representatives in 2006.",
            "His race is one of a handful across the country that will determine control of the Senate."
        ]
    ]
}
