{
    "source": "fox",
    "main-entities": ["Jan Brewer", "SB 1062 bill"],
    "main-event": "Jan Brewer urged to veto gay discrimination bill",
    "title": "Prominent Republicans call for Ariz. Gov. Jan Brewer to veto bill allowing denial of service to gays",
    "url": "http://www.foxnews.com/us/2014/02/26/arizona-gov-jan-brewer-jets-home-amid-furor-over-bill-allowing-denial-service/print",
    "word-count": 580,
    "date": "2014-02-26",
    "uuid": "d36907c6-327f-44c7-bea1-b8d1099436e7",
    "triplet-uuid": "58ed2376-35a0-453a-a08e-5cd87e3bdea5",
    "body-paragraphs": [
        [
            "Prominent Republicans are calling for Ariz. Gov. Jan Brewer to veto a controversial bill that would allow businesses to deny service over religious beliefs."
        ],
        [
            "The Republican governor returned home Tuesday afternoon to a political climate that is much different from just a week ago when she left for Washington the last five days for a governor's conference."
        ],
        [
            "The Arizona Legislature passed a bill last week allowing businesses whose owners cite sincerely held religious beliefs to deny service to gays.",
            "It allows any business, church or person to cite the law as a defense in any action brought by the government or individual claiming discrimination."
        ],
        [
            "The legislation has caused a national uproar.",
            "The chorus of opposition has grown each day, with the business community, the state's Super Bowl Committee and both Republican U.S. senators calling for a veto.",
            "Former GOP presidential nominee Mitt Romney was the latest prominent voice to weigh in and urge Brewer to veto the bill."
        ],
        [
            "Brewer will likely spend the next day or more pondering Senate Bill 1062 before deciding whether to sign or veto the legislation."
        ],
        [
            "There is widespread speculation that Brewer will veto the bill, but she has not said how she'll act, as is her longtime practice with pending legislation."
        ],
        [
            "Political observers in Arizona cautioned that the governor is deliberate and not prone to act hastily, despite the growing calls from business, politicians of all stripes, and civil rights groups for a veto."
        ],
        [
            "\"She's no rookie to these high-profile deals — she gives both sides their due,\" said Doug Cole, a political consultant whose firm has run all of Brewer's campaigns for decades."
        ],
        [
            "\"She's going to get a very detailed briefing from her legal team, and give the proponents their best shot, and the opponents their best shot,\" he said.",
            "\"Everybody's going to get their say, and they've giving it.\""
        ],
        [
            "Some Republican senators who pushed the bill through the Legislature are now calling for a veto as well, but they cite \"inaccurate\" information about the measure for igniting a firestorm.",
            "They argue the bill is designed only to protect business owners with strong religious beliefs from discrimination lawsuits that have happened in other states.",
            "Some blame the media for blowing the law out of proportion."
        ],
        [
            "Democrats say that argument doesn't wash and call SB1062 \"toxic\" legislation that allows discrimination.",
            "They said they warned Republicans who voted for the bill that it was destined for trouble."
        ],
        [
            "\"We brought this to their attention five weeks ago,\" said Sen. Steve Gallardo, D-Phoenix.",
            "\"We said this is exactly what is going to happen.",
            "You have a bill here that's so toxic it's going to divide this Legislature.",
            "It's going to be polarizing the entire state. And that's exactly what happened.\""
        ],
        [
            "The bill was pushed by the Center for Arizona Policy, a social conservative group that opposes abortion and gay marriage.",
            "The group says the proposal simply clarifies existing state law and is needed to protect against increasingly activist federal courts."
        ],
        [
            "The center's president, Cathi Herrod, has been deriding what she called \"fear-mongering\" from the measure's opponents."
        ],
        [
            "\"What's happened is our opponents have employed a new political tactic, and it's working,\" she said.",
            "\"Throw out the threat of a boycott to attempt to defeat a bill, and you might just be able to be successful."
        ],
        [
            "Herrod added she was surprised and disappointed that \"in America today, false attacks and irresponsible characterizations about a piece of legislation can so intimidate and persuade people to change their opinion about religious liberty.\""
        ]
    ]
}
