{
    "source": "hpo",
    "main-entities": ["Elizabeth Lauten", "Barack Obama", "Sasha and Malia Obama"],
    "main-event": "Elizabeth Lauten apologizes for criticizing Obama daughters",
    "title": "GOP Staffer Apologizes For Lecturing Obama Daughters To 'Show A Little Class'",
    "url": "https://www.huffingtonpost.com/2014/11/29/elizabeth-lauten-obama-daughters-class_n_6241202.html",
    "word-count": 357,
    "date": "2014-11-29",
    "uuid": "d66faaee-4cca-415f-b7c6-bbef87dd0800",
    "triplet-uuid": "96b7046f-f584-422f-a626-6f86a26dfd8b",
    "body-paragraphs": [
        [
            "A Republican staffer on Friday apologized for a Facebook post that criticized Malia and Sasha Obama's appearance at the annual White House turkey pardon ceremony, one of America's silliest holiday traditions."
        ],
        [
            "Elizabeth Lauten, the communications director for Rep. Stephen Fincher (R-Tenn.), wrote that the two teenagers should \"try showing a little class,\" \"dress like you deserve respect, not a spot at a bar,\" and, most of all, \"don't make faces\" at Very Serious public events."
        ],
        [
            "Read the full rant via Gawker:"
        ],
        [
            "Dear Sasha and Malia, I get you’re both in those awful teen years, but you’re a part of the First Family, try showing a little class.",
            "At least respect the part you play.",
            "Then again your mother and father don’t respect their positions very much, or the nation for that matter, so I’m guessing you’re coming up a little short in the ‘good role model’ department.",
            "Nevertheless, stretch yourself. Rise to the occasion.",
            "Act like being in the White House matters to you.",
            "Dress like you deserve respect, not a spot at a bar.",
            "And certainly don’t make faces during televised public events."
        ],
        [
            "The First Daughters join President Obama at the ceremony every year, where they can hardly contain their disdain for the lame dad jokes that predictably follow.",
            "Before approaching Mac and Cheese, the two turkeys, the president remarked that it was \"puzzling that I do this every year.\"",
            "Malia even declined her father's offer to pet one of the pardoned turkeys with a nonchalant, \"Nah.\""
        ],
        [
            "Lauten later apologized for rushing to judgment on Facebook."
        ],
        [
            "\"I reacted to an article and quickly judged the two young ladies in a way that I would never have wanted to be judged myself as a teenager,\" she said.",
            "\"After many hours of prayer, talking to my parents and re-reading my words online, I can see more clearly how hurtful my words were.",
            "Please know that these judgmental feelings truly have no place in my heart.",
            "Furthermore, I'd like to apologize to all of those who I have hurt and offended with my words, and pledge to learn and grow (and I assure you I have) from this experience.\""
        ]
    ]
}
