{
    "source": "nyt",
    "main-entities": ["Elizabeth Lauten", "Barack Obama", "Sasha and Malia Obama", "Stephen Fincher"],
    "main-event": "Elizabeth Lauten apologizes for criticizing Obama daughters",
    "title": "G.O.P. Aide Quits After Ridiculing Obama’s Daughters, Sasha and Malia",
    "url": "https://www.nytimes.com/2014/12/02/us/gop-aide-quits-after-ridiculing-obamas-daughters.html",
    "word-count": 658,
    "date": "2014-12-01",
    "uuid": "94b195c8-1938-4ab9-9b38-2c24f4f652e0",
    "triplet-uuid": "96b7046f-f584-422f-a626-6f86a26dfd8b",
    "body-paragraphs": [
        [
            "WASHINGTON — A young Republican congressional aide resigned Monday after her Facebook post berating President Obama’s daughters for their attitude and outfits during the annual White House turkey pardon became a sensation on the Internet."
        ],
        [
            "On Friday, the aide, Elizabeth Lauten, 31, who has more than 14,000 followers on Twitter as @DCGopGirl and at the time was a spokeswoman for a little-known congressman from Tennessee, wrote an open letter to Sasha and Malia Obama on her Facebook page, saying they should “try showing a little class” and “dress like you deserve respect, not a spot at a bar.”"
        ],
        [
            "By Monday, Ms. Lauten had resigned as communications director to Representative Stephen Fincher, a farmer and gospel singer perhaps best known for his whimsically named hometown, Frog Jump.",
            "Ms. Lauten, now a footnote in Mr. Fincher’s career, is the latest cautionary tale about the dangers of social media sniping directed at the country’s most famous offspring."
        ],
        [
            "It started Wednesday with the most innocuous of events: the annual naming of the National Thanksgiving Turkey, when Mr. Obama officially liberated Cheese, a large white bird with impressive plumage, from the Thursday dinner table."
        ],
        [
            "Per tradition, the first daughters were in attendance, this time wearing mostly cheerless expressions and short outfits.",
            "Malia, 16, was dressed in a plaid miniskirt, sweater, dark tights and black hiking-style boots.",
            "Sasha, 13, wore a maroon dress, a cardigan sweater, a pair of white midcalf-high socks and black ankle boots."
        ],
        [
            "At times, the girls gazed glumly at the floor and threw an occasional eye roll at their father as he compared pardoning Cheese to granting amnesty to unauthorized immigrants.",
            "“You want to pet him?” Mr. Obama asked his daughters."
        ],
        [
            "“Nah,” Malia said quickly."
        ],
        [
            "Their teenage disdain drew its fair share of media attention, including a BuzzFeed article titled “The Obama Girls Could Not Be More Bored by Their Dad’s Jokes.”"
        ],
        [
            "Enter Ms. Lauten — a former Republican National Committee new media aide who describes herself on Twitter as loving God, cats, the Daughters of the American Revolution “& all things pink, green and pearls!” — whose commentary had a sharper edge."
        ],
        [
            "“I get you’re both in those awful teen years, but you’re a part of the First Family, try showing a little class,” she wrote above a picture of the unenthused Obama daughters.",
            "“At least respect the part you play.”"
        ],
        [
            "She went on to say that Malia and Sasha were “coming up a little short in the ‘good role model’ department” because their parents “don’t respect their positions very much, or the nation for that matter.”"
        ],
        [
            "Ms. Lauten wrote what she thought the daughters should have done: “Rise to the occasion.",
            "Act like being in the White House matters to you.",
            "Dress like you deserve respect, not a spot at a bar.”"
        ],
        [
            "Her views were widely circulated and eventually posted on Twitter by a reporter for The Root, a news, opinion and culture site aimed at African-American audiences.",
            "A flood of angry responses quickly followed."
        ],
        [
            "Ms. Lauten, who did not respond to repeated requests for further comment, later posted an apology for her “hurtful” words, saying she had “judged the two young ladies in a way that I would never have wanted to be judged myself as a teenager.”"
        ],
        [
            "Josh Earnest, the White House press secretary, told reporters on Monday that he was “taken aback that there was some political operative on Capitol Hill who did use the occasion of a Thanksgiving-themed event to criticize members of the first family.”"
        ],
        [
            "Patti Davis, the daughter of Ronald Reagan, could relate.",
            "In a letter to Sasha and Malia posted on her website, Ms. Davis recalled being criticized by a reporter decades ago for the outfit she wore to a cocktail reception her parents held for Queen Elizabeth II when Mr. Reagan was president."
        ],
        [
            "“As First Daughters, you can’t win,” Ms. Davis wrote.",
            "“And while there isn’t anything normal about the life you are living right now, you still can be.”"
        ]
    ]
}
