{
    "triplet-uuid": "b764f81f-6d08-4d7c-b1a8-8961bed0a455",
    "url": "http://www.foxnews.com/politics/2014/12/19/colorado-top-cop-defends-pot-law-after-challenges-from-neighboring-states.html",
    "keywords": "",
    "word-count": 856,
    "body-paragraphs": [
        [
            "Colorado's top cop defends pot law after challenges from neighboring states"
        ],
        [
            "Denver (AP) – Colorado's top law enforcement official promises to vigorously defend the state's historic law legalizing marijuana after Nebraska and Oklahoma asked the U.S. Supreme Court to declare it unconstitutional, saying the drug is freely flowing into neighboring states."
        ],
        [
            "The two states filed a lawsuit seeking a court order to prevent Colorado from enforcing the measure known as Amendment 64, which was approved by voters in 2012 and allows recreational marijuana for adults over 21.",
            "The complaint says the measure runs afoul of federal law and therefore violates the Constitution's supremacy clause, which says federal laws trump state laws."
        ],
        [
            "Colorado Attorney General John Suthers said the lawsuit was without merit."
        ],
        [
            "\"Because neighboring states have expressed concern about Colorado-grown marijuana coming into their states, we are not entirely surprised by this action,\" he said.",
            "\"However, it appears the plaintiffs' primary grievance stems from non-enforcement of federal laws regarding marijuana, as opposed to choices made by the voters of Colorado.\""
        ],
        [
            "The lawsuit says Colorado marijuana flows into neighboring states undermining their efforts to enforce their anti-marijuana laws."
        ],
        [
            "\"This contraband has been heavily trafficked into our state,\" Nebraska Attorney General Jon Bruning said at a news conference in Lincoln.",
            "\"While Colorado reaps millions from the sale of pot, Nebraska taxpayers have to bear the cost.\""
        ],
        [
            "Colorado has raised more than $60 million in taxes, licenses and fees from medical and recreational marijuana, which has been sold in stores since January."
        ],
        [
            "The lawsuit says the sales have strained Nebraska and Oklahoma's finances and legal systems.",
            "Police are spending more time and money making arrests, housing inmates, impounding vehicles, seizing drugs and handling other problems related to Colorado pot."
        ],
        [
            "Bruning, a Republican, blamed U.S. Attorney General Eric Holder for failing to enforce the federal law's ban on drugs in Colorado."
        ],
        [
            "In a policy statement last year, the U.S. Justice Department noted it doesn't have the resources to police all violations of federal marijuana law.",
            "It laid out eight federal law enforcement priorities that states need to protect if they want to authorize \"marijuana-related conduct.\"",
            "They include keeping marijuana in-state — something Oklahoma and Nebraska says Colorado has failed to do.",
            "The suit doesn't contain statistics to support the claim."
        ],
        [
            "Law enforcement agencies have long said anecdotally that they are feeling the impacts of Colorado's legal weed, making more marijuana arrests and seizing more of the drug."
        ],
        [
            "But there's no way to know exactly how much legal pot is leaving Colorado."
        ],
        [
            "The Rocky Mountain High Intensity Drug Trafficking Area wrote in a recent report that the amount of Colorado pot seized on highways increased from an annual average of 2,763 pounds between 2005 and 2008 to a yearly average of 3,690 pounds from 2009 to 2013.",
            "The weed was headed for at least 40 different states."
        ],
        [
            "Scotts Bluff County Sheriff Mark Overman, in western Nebraska, said Colorado marijuana is extra potent, making it worth more in his region and giving sellers a greater financial incentive to do business there."
        ],
        [
            "\"I think this is overdue, and I think other states should jump on board,\" Overman said of the lawsuit.",
            "\"I'm very frustrated.",
            "I take an oath of office, as does every other police officer in this country.",
            "I don't just get to pick and choose which laws I enforce.\""
        ],
        [
            "Colorado Gov. John Hickenlooper told The Denver Post he spoke with Nebraska and Oklahoma officials about their concerns."
        ],
        [
            "\"I'm not sure filing a lawsuit is the most constructive way to find a solution to whatever issues they are,\" he said."
        ],
        [
            "Legal scholars say it's too early to know how the Supreme Court might handle the case or if it will even accept it."
        ],
        [
            "\"Right now, these regulations exist in legal no-man's-land,\" said Sam Kamin, a University of Denver law professor.",
            "\"It's incredibly unusual for a state to be suing another state.",
            "(The lawsuit) certainly was a surprise to me given the movement at the federal level, which seems to be in favor of allowing states to experiment.\""
        ],
        [
            "It was unclear if other neighboring states would take similar action.",
            "Attorneys general in Utah and New Mexico said they had no immediate plans to join the suit."
        ],
        [
            "Brian Vicente, a Colorado attorney and legalization advocate who wrote Amendment 64, said the challenge is \"political grandstanding\" without merit.",
            "He said 23 states have enacted medical marijuana laws, and none have been overturned because of federal law."
        ],
        [
            "\"I think it shows they are on the wrong side of history,\" Vicente said.",
            "\"Colorado voters passed this measure, and more and more states are passing these laws.",
            "If the attorney general has a problem with how federal laws are being enforced he should bring that up with the U.S.",
            "attorney.\""
        ]
    ],
    "uuid": "aaddc4d1-d6c2-4388-9588-1b6d17979113",
    "source": "fox",
    "title": "Colorado's top cop defends pot law after challenges from neighboring states ",
    "date": "2014-12-19",
    "main-event": "Nebraska and Oklahoma fight Colorado's recreational marijuana policy",
    "main-entities": ["Colorado officials", "Nebraska officials"]
}
