{
    "keywords": "",
    "word-count": 808,
    "date": "2014-12-18",
    "uuid": "6b573b3f-9b68-4aac-996e-8bd06bf614b8",
    "body-paragraphs": [
        [
            "DENVER — Two heartland states filed the first major court challenge to marijuana legalization on Thursday, saying that Colorado’s growing array of state-regulated recreational marijuana shops was piping marijuana into neighboring states and should be shut down."
        ],
        [
            "The lawsuit was brought by attorneys general in Nebraska and Oklahoma, and asks the United States Supreme Court to strike down key parts of a 2012 voter-approved measure that legalized marijuana in Colorado for adult use and created a new system of stores, taxes and regulations surrounding retail marijuana."
        ],
        [
            "While marijuana remains illegal under federal law, officials have largely allowed Colorado and other states to move ahead with state-run programs allowing medical and recreational marijuana.",
            "But the lawsuit from Nebraska and Oklahoma, where marijuana is still outlawed, argues that Colorado has “created a dangerous gap” in the federal drug-control system."
        ],
        [
            "“Marijuana flows from this gap into neighboring states,” the suit says, undermining their marijuana bans, “draining their treasuries, and placing stress on their criminal justice systems.”"
        ],
        [
            "For months, some sheriffs and police officers in rural counties bordering Colorado have complained that they have seen more marijuana entering their towns and being transported down their highways since recreational sales began in January.",
            "Oklahoma and Nebraska said the influx had led to more arrests, more impounded vehicles and higher jail and court costs.",
            "They say it has also forced law-enforcement agencies to spend more time and dedicate more resources to handling marijuana-related arrests."
        ],
        [
            "“We’re seeing a lot of marijuana coming over from Colorado,” said Sheriff Adam Hayward of Deuel County, Neb., who said that he was gratified that the two states were challenging Colorado’s marijuana laws.",
            "He has complained that marijuana arrests have strained his jail budget.",
            "“For the longest time we were saying, this is becoming a problem for us.”"
        ],
        [
            "Colorado’s attorney general, John Suthers, a Republican, said in a statement that the challenge from Nebraska and Oklahoma was “without merit.”",
            "Like many elected officials in Colorado, Mr. Suthers had opposed Amendment 64, which legalized marijuana.",
            "But on Thursday, he said “we will vigorously defend” against the lawsuit attempting to undo it."
        ],
        [
            "Nebraska and Oklahoma’s challenge is aimed more at the commercial side of marijuana legalization, which created new systems of regulations and taxes as well as recreational stores, dispensaries and production facilities that are monitored and licensed by state officials.",
            "The suit does not specifically seek to overturn the portion of Amendment 64 that made marijuana legal for personal use and possession, meaning that portions of legalization could survive even if Nebraska and Oklahoma prevail."
        ],
        [
            "But marijuana advocates said that the challenge — if it succeeds at shutting down marijuana retailers — could boost the black market."
        ],
        [
            "“If Nebraska and Oklahoma succeed, they will put the violent criminal organizations back in charge,” Michael Elliott, the executive director of the Marijuana Industry Group, a Colorado-based trade group, said in a statement."
        ],
        [
            "The lawsuit, which was brought by Nebraska’s attorney general, Jon Bruning, and Oklahoma’s attorney general, Scott Pruitt, accused Colorado officials of participating in a “scheme” that cultivates, packages and distributes marijuana in direct violation of controlled-substances laws while “ignoring every objective embodied in the federal drug control regulation.”",
            "It was filed directly with the Supreme Court because it involves a dispute among states."
        ],
        [
            "“The Constitution and the federal antidrug laws do not permit the development of a patchwork of state and local pro-drug policies and licensed distribution schemes throughout the country,” the lawsuit says."
        ],
        [
            "Nebraska and Oklahoma accused Colorado of leaving huge holes in marijuana rules that allowed the plant to flow out of state."
        ],
        [
            "While it is against the law to take legally purchased marijuana across state lines, Nebraska and Oklahoma said that Colorado does not require consumers to smoke or eat their marijuana where they buy it, and said that despite purchasing and possession limits, anyone can easily visit several dispensaries and stock up.",
            "Some sheriffs in bordering states say they have pulled over drivers and found edibles and marijuana from multiple Colorado retail outlets."
        ],
        [
            "They also criticized Colorado for not tracking marijuana once it is sold, and for not requiring marijuana buyers to undergo criminal background checks (under Colorado law, anyone 21 or older can legally purchase recreational marijuana).",
            "Colorado’s rules have no way to prevent “criminal enterprises, gangs and cartels from acquiring marijuana inventory directly from retail marijuana stores,” the lawsuit says."
        ],
        [
            "Nebraska and Oklahoma complained about a “significant influx of Colorado-sourced marijuana,” but the suit did not mention specific statistics about Colorado-related marijuana arrests or drug seizures.",
            "In earlier interviews, some local law-enforcement officers along Colorado’s borders said that they had not seen an increase in marijuana coming from Colorado."
        ]
    ],
    "triplet-uuid": "b764f81f-6d08-4d7c-b1a8-8961bed0a455",
    "title": "Nebraska and Oklahoma Sue Colorado Over Marijuana Law",
    "source": "nyt",
    "url": "https://www.nytimes.com/2014/12/19/us/politics/nebraska-and-oklahoma-sue-colorado-over-marijuana-law.html?_r=1",
    "main-event": "Nebraska and Oklahoma fight Colorado's recreational marijuana policy",
    "main-entities": ["Colorado officials", "Nebraska and Oklahoma officials"]
}
