{
    "source": "hpo",
    "main-entities": ["Colorado officials", "Nebraska officials", "Oklahoma officials"],
    "main-event": "Nebraska and Oklahoma fight Colorado's recreational marijuana policy",
    "title": "Nebraska, Oklahoma File Federal Suit Against Colorado Over Marijuana Legalization",
    "url": "https://www.huffingtonpost.com/2014/12/18/lawsuit-colorado-marijuana_n_6350162.html",
    "word-count": 805,
    "date": "2014-12-18",
    "uuid": "987ca58a-7b4b-4df5-b53f-b2a3902a01b7",
    "triplet-uuid": "b764f81f-6d08-4d7c-b1a8-8961bed0a455",
    "body-paragraphs": [
        [
            "Nebraska, Oklahoma File Federal Suit Against Colorado Over Marijuana Legalization"
        ],
        [
            "The states of Nebraska and Oklahoma filed a federal lawsuit in the U.S. Supreme Court Thursday, claiming that Colorado's legalization of recreational marijuana is unconstitutional under federal law."
        ],
        [
            "\"Federal law undisputedly prohibits the production and sale of marijuana,\" Nebraska Attorney General Jon Bruning said Thursday in a statement.",
            "\"Colorado has undermined the United States Constitution, and I hope the U.S. Supreme Court will uphold our constitutional principles.\""
        ],
        [
            "But Colorado Attorney General John Suthers isn't backing down.",
            "In a statement, he said he intends to defend the state's marijuana laws."
        ],
        [
            "“Because neighboring states have expressed concern about Colorado-grown marijuana coming into their states, we are not entirely surprised by this action,\" Suthers said.",
            "\"However, it appears the plaintiffs’ primary grievance stems from non-enforcement of federal laws regarding marijuana, as opposed to choices made by the voters of Colorado.",
            "We believe this suit is without merit and we will vigorously defend against it in the U.S. Supreme Court.”"
        ],
        [
            "Bruning, along with Oklahoma Attorney General Scott Pruitt, argue that under the U.S. Constitution's Supremacy Clause, Colorado's legalization of recreational marijuana is unconstitutional because marijuana remains illegal under federal law.",
            "The clause states that in general, federal law takes precedence over state law."
        ],
        [
            "\"The illegal products being distributed in Colorado are being trafficked across state lines thereby injuring neighboring states like Oklahoma and Nebraska,\" Pruitt said in a statement."
        ],
        [
            "The regulation of recreational marijuana -- as seen in programs currently in place in Colorado and Washington state, as well as those that will soon go into effect in Oregon and Alaska -- remains illegal under the 1970 Controlled Substances Act.",
            "The states that have legalized marijuana or softened penalties for possession have only been able to do so because of federal guidance urging federal prosecutors to refrain from targeting state-legal marijuana operations."
        ],
        [
            "Colorado voters approved Amendment 64, legalizing recreational marijuana in the state, in 2012.",
            "The first retail marijuana shops opened their doors on New Years Day 2014.",
            "To date, 23 states and the District of Columbia have legalized marijuana for medical purposes.",
            "Four states have legalized recreational marijuana, along with voters in D.C. -- though the D.C. measure is the subject of a congressional Republican effort to block its implementation."
        ],
        [
            "With a majority of Americans now supporting marijuana legalization, and with states continuing to pass legalization laws, it seems unlikely that the federal government would push back against the legalizations.",
            "But it's not impossible.",
            "If the Supreme Court were to rule in favor of Nebraska and Oklahoma, all state marijuana laws, in any form, could be in jeopardy of being unraveled."
        ],
        [
            "Harvard economist Jeff Miron, a vocal supporter of marijuana policy reform, highlighted the precarious nature of state marijuana laws in a November op-ed for CNN, saying that Congress needs to act now on federal marijuana policy."
        ],
        [
            "\"Despite the compelling case for legalization, and progress toward legalization at the state level, ultimate success is not assured,\" Miron wrote.",
            "\"Federal law still prohibits marijuana, and existing jurisprudence (Gonzales v. Raich 2005) holds that federal law trumps state law when it comes to marijuana prohibition.",
            "So far, the federal government has mostly taken a hands-off approach to state medicalizations and legalizations, but in January 2017, the country will have a new president.",
            "That person could order the attorney general to enforce federal prohibition regardless of state law.\""
        ],
        [
            "Kevin Sabet, president of anti-legalization group Smart Approaches to Marijuana, applauded the action by Nebraska and Oklahoma."
        ],
        [
            "\"We support this action by the attorneys general of Oklahoma and Nebraska because Colorado's decisions regarding marijuana are not without consequences to neighboring states, and indeed all Americans,\" Sabet said.",
            "\"The legalization of marijuana is clearly in violation of the federal Controlled Substances Act and is not implemented in a vacuum.\""
        ],
        [
            "Mason Tvert, communications director for Marijuana Policy Project, told The Huffington Post that MPP agrees with Suthers' opinion that the suit is \"without merit.\""
        ],
        [
            "\"Nebraska officials are acting like bullies, and they have no business trying to dictate Colorado's marijuana laws,\" Tvert said to HuffPost.",
            "\"They are wasting their taxpayers’ dollars by filing this suit and forcing Coloradans to pick up the bill for defending our state against it.",
            "Colorado's top law enforcement officials have better things to do and you’d think Nebraska’s would, as well.",
            "These guys are on the wrong side of history.\""
        ],
        [
            "Marijuana Industry Group's Mike Elliott echoed Tvert's sentiments, adding that despite the multi-decade federal war on drugs, marijuana remains \"universally available\" -- including in Nebraska and Oklahoma."
        ],
        [
            "\"If Nebraska and Oklahoma succeed, they will put the violent criminal organizations back in charge,\" Elliott said."
        ],
        [
            "Rep. Jared Polis (D-Colo.), a vocal supporter of drug policy reform who has sponsored multiple bills seeking protection for state-legal marijuana businesses and advocated full-scale federal legalization of the drug, told HuffPost that Nebraska and Oklahoma attempting to overturn the will of Colorado's voters is \"outrageous.\""
        ],
        [
            "\"Our federalist system is based on individual states of being able to enact policies that benefit their citizens, without the interference of other states,\" Polis said."
        ]
    ]
}
