{
    "source": "nyt",
    "main-entities": ["Raul Labrador", "Kevil McCarthy"],
    "main-event": "Raul Labrador challenges Kevin McCarthy for House majority leadership",
    "title": "",
    "url": "http://mobile.nytimes.com/2014/06/14/us/idaho-republican-appealing-to-right-enters-race-to-replace-cantor.html",
    "word-count": 871,
    "date": "2014-06-14",
    "uuid": "0a43f74c-0b97-462f-a5dc-346e49830006",
    "triplet-uuid": "c99adbdd-eaf3-4844-9548-2642e80de4e2",
    "body-paragraphs": [
        [
            "WASHINGTON — Representative Raúl R. Labrador, a Republican of Idaho who has barely served two terms in Congress, jumped into the race for House majority leader on Friday, offering himself as the more conservative alternative who could pull the House rightward in the wake of Representative Eric Cantor’s loss in a primary."
        ],
        [
            "“The message from Tuesday is clear — Americans are looking for a change in the status quo,” Mr. Labrador, a former immigration lawyer elected in the Tea Party wave of 2010, said in a statement.",
            "“President Obama and the Democrats have had their chance and they have failed.",
            "Republicans must be willing to take these challenges head on with new leadership, fresh ideas and a different approach.”"
        ],
        [
            "While some of those conservative lawmakers elected in 2010 were hoping that the House leadership elections on Thursday would offer them the chance to reclaim their influence on Capitol Hill, few of them give Mr. Labrador much of a chance against the current House majority whip, Representative Kevin McCarthy of California.",
            "Though Tea Party activists provided the energy and votes for Mr. Cantor’s ouster, the elections might be more of a plea for a place at the leadership table."
        ],
        [
            "Supporters of Mr. McCarthy, who confidently traveled home to his district in Bakersfield for the weekend, said Friday that the Californian had all but sewed up the votes he needs."
        ],
        [
            "“We have got to have an alternative,” Representative Louie Gohmert, Republican of Texas, said on Glenn Beck’s conservative radio show.",
            "“I mean, for us as a party in Congress to send the message that we didn’t learn a blessed thing from this amazing election result, we aren’t paying attention.”"
        ],
        [
            "House conservatives — lacking a rationale to fight Mr. McCarthy, a well-liked member of leadership who has raised millions of dollars for Republican incumbents — have begun protesting that his voting record is actually to the left of Mr. Cantor’s."
        ],
        [
            "FreedomWorks, which has provided financial support for Tea Party candidates, immediately began trying to generate support for Mr. Labrador through its websites and email lists.",
            "“Now that grass-roots conservatives FIRED Eric Cantor, we need a new majority leader in the House of Representatives,” FreedomWorks’ website said Friday."
        ],
        [
            "Matt Kibbe, the group’s president and chief executive, said that he did not have great qualms with Mr. McCarthy’s ideology, but that he was more about politics than ideas.",
            "“The Republican penchant for just choosing the next guy in line hasn’t proven to be a great strategy, and it hasn’t picked good leadership,” Mr. Kibbe said."
        ],
        [
            "But Mr. Labrador’s path to victory is steep, especially in the few days before House Republicans gather to elect Mr. Cantor’s replacement.",
            "Mr. McCarthy has been preparing for months to move up from No. 3 in the Republican leadership to No. 2 in the event that Speaker John A. Boehner of Ohio would retire after the November elections."
        ],
        [
            "Conservative Republicans in the House pleaded Friday for a delay in the voting.",
            "Some grumbled that the campaign by the college professor David Brat to unseat Mr. Cantor had ousted the one member of House Republican leadership willing to listen to the House’s most conservative members.",
            "Instead, the House will end up elevating a leader with a less conservative record and less patience for the far-right flank."
        ],
        [
            "For his part, Mr. Boehner has remained firm that he wanted to get it done quickly and minimize disruption."
        ],
        [
            "Mr. McCarthy spent much of the day calling members and shoring up support, said a Republican aide close to the majority whip.",
            "McCarthy supporters predicted that Mr. Labrador would muster no more than a few dozen votes."
        ],
        [
            "Some lawmakers questioned whether his run was really a quest to win the majority leader’s post or merely to raise his own profile.",
            "His decision to jump in was widely seen as proof that more experienced conservative members, like Representatives Jim Jordan of Ohio or Tom Price of Georgia, had rebuffed overtures to run from other conservatives."
        ],
        [
            "Tea Party groups off Capitol Hill may believe Mr. Labrador can win, and they will pressure House conservatives to join the campaign.",
            "But ultimately, supporting him could hurt more conservative members with the House leadership."
        ],
        [
            "Mr. Labrador tried on Friday to at least engage the Republican conference in a debate over ideas.",
            "He said the party needed to address issues like upward income mobility among the poor and middle-class economic insecurity.",
            "Born the son of a single mother in Puerto Rico, he has seen himself as an ambassador to young and minority voters out of reach to traditional Republicans."
        ],
        [
            "“I am running for majority leader because I want to help create a vision of growth and opportunity for everyone and start getting to work for the American people,” he said."
        ],
        [
            "Representative Justin Amash, Republican of Michigan, rushed to champion Mr. Labrador’s candidacy.",
            "Mr. Amash, after all, voted last year to make him speaker of the House."
        ],
        [
            "“We can’t respond to a stunning loss by giving a pat on the back and promotion to the same team,” Mr. Amash said of Mr. Cantor’s defeat.",
            "“It’s time for someone new, someone conservative, someone who will put forward a fresh agenda, and someone we know is a proven and talented spokesman. That man is Raúl Labrador.”"
        ]
    ]
}
