{
    "source": "hpo",
    "main-entities": ["Raul Labrador", "Kevil McCarthy"],
    "main-event": "Raul Labrador challenges Kevin McCarthy for House majority leadership",
    "title": "Raul Labrador To Run for House Majority Leader",
    "url": "http://www.huffingtonpost.com/2014/06/13/labrador-majority-leader_n_5491696.html?ir=Politics",
    "word-count": 723,
    "date": "2014-06-13",
    "uuid": "d03a3271-44ac-4059-85c0-8d45cc2b1d2c",
    "triplet-uuid": "c99adbdd-eaf3-4844-9548-2642e80de4e2",
    "body-paragraphs": [
        [
            "A two-term Republican congressman from Idaho with a track record of challenging the House Republican leadership said Friday he would run for the No. 2 job in the chamber."
        ],
        [
            "Raul Labrador, a 46-year-old Mormon father of five, tea party congressman and Puerto Rican-born only child of a single mother, will challenge House Majority Whip Kevin McCarthy (R-Calif.) for the position of House majority leader."
        ],
        [
            "It's a long shot bid.",
            "McCarthy, 49, began gathering commitments from other House Republicans on Wednesday, the day after then-Majority Leader Eric Cantor (R-Va.) suffered a stunning loss in the primary for his seat."
        ],
        [
            "In his current role as whip, McCarthy's job is to round up votes from other Republicans.",
            "The election is Thursday -- leaving little time for Labrador to build momentum and peel off votes from McCarthy."
        ],
        [
            "The former immigration attorney stepped forward to run after a number of other conservative House Republicans declined to."
        ],
        [
            "“I was stunned when Eric Cantor lost his primary election earlier this week.",
            "Eric is a good friend and I have tremendous respect for him.",
            "But the message from Tuesday is clear -- Americans are looking for a change in the status quo,\" Labrador said in a statement."
        ],
        [
            "He also said that he would run for majority leader in hopes of creating \"a leadership team that can bring the Republican conference together.\"",
            "It's a reference to the fact that Labrador is generally respected by both the House leadership and back-bench tea party legislators."
        ],
        [
            "Since the 2010 midterm tea party wave election, the House GOP has contained a bloc of members who have opposed the establishment leadership time and time again.",
            "The tea party group has pulled other legislators to the right on a host of issues, including many related to government spending and debt."
        ],
        [
            "When Cantor lost his seat in a shock result Tuesday, conservatives in the House were not prepared to unite behind a standard-bearer, much less wage an organized effort to whip up votes in support of a candidate for majority leader.",
            "Rep. Jeb Hensarling (R-Texas) was considered a front-runner to challenge McCarthy.",
            "But Hensarling pondered his options for a full day Wednesday, while McCarthy moved quickly to generate support."
        ],
        [
            "On Friday, the Washington Post reported that Hensarling does not plan to run, according to three people familiar with his plans."
        ],
        [
            "Rep. Pete Sessions (R-Texas) was the other conservative alternate to McCarthy, though he is almost as much an establishment character as anyone else in leadership.",
            "He too declined to run, sensing McCarthy's near inevitability.",
            "Rep. Jim Jordan (R-Ohio) also demurred."
        ],
        [
            "The situation left House Speaker John Boehner (R-Ohio) and the rest of the Republican leadership in the House with a problem: The 40 or so hardline tea party members of the House GOP do not want the response to Cantor's loss -- which was driven by grassroots discontent with the establishment -- to simply be more establishment leadership.",
            "This discontent may be satisfied if Rep. Steve Scalise (R-La.) wins his race against Rep. Peter Roskam (R-Ill.) for House majority whip, taking McCarthy's spot."
        ],
        [
            "Members of the tea party caucus also want to vote for a majority leader candidate that they believe in, even if he loses.",
            "House GOP leadership understands that desire, as does Labrador.",
            "A Labrador bid helps all parties regardless of the outcome -- including Labrador himself, since a run will elevate him as a leader inside the House GOP."
        ],
        [
            "There is always a chance that grassroots fervor in support of Labrador could gain a level of intensity that Boehner and McCarthy did not anticipate.",
            "However, there's not a lot of time for that to happen before next Thursday's election, and leadership elections generally are dominated by inside baseball politics and arcane political interests.",
            "In addition, a few of the most hardline House Republicans, such as Rep. Steve King (R-Iowa) and Rep. Michelle Bachmann (R-Minn.) said Thursday that Labrador was not conservative enough on immigration reform."
        ],
        [
            "Labrador is an ambitious, sometimes savvy politician.",
            "He is in Idaho this weekend chairing the state GOP convention.",
            "He also appeared Friday at an event with Sen. Rand Paul (R-Ky.), who offered his support for Labrador's candidacy."
        ],
        [
            "“There really is a question what is the message that’s sent when the voters replace someone in leadership.",
            "They want someone different.",
            "I think Raul brings that,\" Paul told reporters, according to the Spokesman-Review."
        ]
    ]
}
