{
    "source": "fox",
    "main-entities": ["Raul Labrador", "Kevil McCarthy"],
    "main-event": "Raul Labrador challenges Kevin McCarthy for House majority leadership",
    "title": "GOP Smackdown: Rep. Labrador Enters The Race For House Majority Leadership",
    "url": "http://latino.foxnews.com/latino/politics/2014/06/13/rep-labrador-is-running-against-rep-mccarthy-for-house-majority-leadership/?intcmp=related",
    "word-count": 910,
    "date": "2014-06-13",
    "uuid": "35410b5a-b76b-4045-a957-d430070e2635",
    "triplet-uuid": "c99adbdd-eaf3-4844-9548-2642e80de4e2",
    "body-paragraphs": [
        [
            "In one of the highest-profile showdowns between establishment Republicans and Tea Party conservatives so far this year, Rep. Raul Labrador said Friday that he is challenging Rep. Kevin McCarthy for the House majority leader position that became open this week."
        ],
        [
            "Labrador, of Idaho, would be the Tea Party alternative to McCarthy, who is the whip and is favored by establishment Republicans.",
            "Only in Congress since 2010, Labrador would represent several firsts: the first Latino, first Mormon and first Idaho lawmaker to be House majority leader."
        ],
        [
            "Labrador’s foray into the race for majority leader is yet another dramatic turn of events for Republicans, who were stunned by the defeat in Tuesday’s primary in Virginia of Rep. Eric Cantor to a Tea Party candidate who cast the congressman as someone who embraces the status quo of Beltway GOP politics and did not truly represent his constituents."
        ],
        [
            "Americans don’t believe their leaders in Washington are listening and now is the time to change that."
        ],
        [
            "And it upends the June 19 voting by the House Republicans for majority leader.",
            "On Friday morning, McCarthy, 49, appeared to be headed toward running unopposed after some rivals dropped out."
        ],
        [
            "“I was stunned when Eric Cantor lost his primary election earlier this week,” Labrador, who is 46, said in his announcement about running for majority leader.",
            "“Eric is a good friend and I have tremendous respect for him.",
            "But the message from Tuesday is clear – Americans are looking for a change in the status quo.”"
        ],
        [
            "Some conservatives in the House were pushing for a postponement of the June 19 election for majority leader, saying they wanted more time to put someone with more right-wing views in the running for the position."
        ],
        [
            "“I want a…leadership team that can bring the Republican conference together,” Labrador said in his statement, “A leadership team that can help unite and grow our party.",
            "Americans don’t believe their leaders in Washington are listening and now is the time to change that.”"
        ],
        [
            "Some lawmakers pressed Labrador to run, according to several published reports that quoted unnamed sources."
        ],
        [
            "Economics professor Dave Brat, the Tea Party candidate who defeated Cantor, attacked the congressman as soft on border security and on people who come here illegally."
        ],
        [
            "Cantor, who had once been more moderate on immigration issues – particularly on the bitterly divisive aspect of whether to give undocumented immigrants already in the U.S. a chance to legalize their status – shifted sharply to a hard line position, saying he would block any effort in the House to consider proposals to give such immigrants a break."
        ],
        [
            "But some observers said Cantor’s tough stance toward the end of the primary – one he’d seemed confident he’d easily win – was too little too late."
        ],
        [
            "Others say it was Cantor’s lack of popularity in general in his district, and his lackluster campaign, that doomed him."
        ],
        [
            "Nonetheless, many see the next majority leader as potentially influencing the House handling of immigration reform, which stalled as conservative members said they would not support a comprehensive measure for an overhaul of the system, and especially not one that, in their view, would grant amnesty to lawbreakers."
        ],
        [
            "The Senate last year passed a sweeping bipartisan immigration reform bill that both tightened border security and provided a path to legal status for undocumented immigrants who meet a strict set of criteria."
        ],
        [
            "McCarthy, whose district is 35 percent Latino, has expressed support for providing a path to legal status, but only after those applying for it earn it by learning English and paying fines and taxes, among other things."
        ],
        [
            "Labrador, who worked as an immigration attorney before serving in Congress, was part of a bipartisan group in the House that was working on a reform bill.",
            "But Labrador famously quit the group because of a disagreement with its other members over whether to entitle undocumented immigrants to some form of healthcare."
        ],
        [
            "Labrador has not been shy about criticizing House Speaker John Boehner of Ohio, saying that he should step down if he allows a vote on an immigration bill this year.",
            "The Idaho congressman, echoing other conservatives, has said that Congress should wait until at least 2015 to take up the issue again because President Obama must make a clear attempt to take steps to secure the borders and step up interior enforcement of immigration laws."
        ],
        [
            "He has said he will not back a version of the Senate reform bill, and prefers to deal with the subject in a piecemeal fashion.",
            "Labrador supports a path to legal status, but only after evidence that enforcement has been improved, he has said.",
            "He also supports expanding foreign worker visa programs."
        ],
        [
            "Labrador says this about himself on his website: “Born to a single mother in Puerto Rico, Raúl Labrador moved with his mother to the mainland U.S. at age 13.”"
        ],
        [
            "“His mother worked many different jobs to make ends meet,” it says.",
            "“Though times were tough, Raúl’s mother often reminded him that if he studied, worked hard, and played by the rules, he could achieve the American Dream.",
            "This encouraged Raúl to never give up on his professional aspirations and personal dreams.”"
        ],
        [
            "One of the conservative members in the House who wanted to postpone the June 19 vote for majority leader quickly indicated that for him, Labrador would not do."
        ],
        [
            "Rep. Steve King (R-Iowa), tweeted on Friday \"#Labrador is pro amnesty.",
            "If not this year, he has strongly advocated for amnesty next year.",
            "No fair trying to redefine amnesty.”"
        ]
    ]
}
