{
    "source": "fox",
    "main-entities": ["Senate Republicans", "Kevin McCarthy", "Barack Obama"],
    "main-event": "House Republicans offer broad immigration plan",
    "title": "Third-Highest Ranking Republican In U.S. House Calls For Legalizing Undocumented Immigrants",
    "url": "http://latino.foxnews.com/latino/politics/2014/01/23/third-highest-ranking-republican-in-us-house-calls-for-legalizing-undocumented/?intcmp=related",
    "word-count": 611,
    "date": "2014-01-23",
    "uuid": "e94ea105-6d01-4573-9ae2-57df392473cd",
    "triplet-uuid": "ccf19ab6-7878-4378-b99c-2b08cc21371f",
    "body-paragraphs": [
        [
            "One of the highest-profile Republicans in the House of Representatives – where national immigration reform will live or die this year – said he agrees with giving undocumented immigrants a chance to legalize their status."
        ],
        [
            "Majority Whip Kevin McCarthy, who is the third-ranking Republican in the House, made his comments in an interview with KBFX-TV in Bakersfield, Calif. just as his fellow GOP lawmakers are expected to unveil any day a set of “immigration principles” that reportedly call for a path to legal status for undocumented immigrants."
        ],
        [
            "“The principles aren’t written yet, but in my personal belief, I think it’ll go with legal status that will allow you to work and pay taxes,” he said.",
            "“But if you want to become a citizen, you’ll have to go through the path.",
            "There won’t be amnesty inside it.”"
        ],
        [
            "McCarthy’s district is roughly 35 percent Latino."
        ],
        [
            "The House Republican immigration principles reportedly will cover how the U.S. border should be protected, how immigration laws should be enforced inside the United States, and how many of the country’s estimated 11 million undocumented immigrants can embark on a path to legalize their status, according to various media stories."
        ],
        [
            "The path to legalization’s inclusion in the plan – which House Republican leaders discussed as recently as Wednesday -- is particularly significant given that it is one of the pivotal reasons that plans last year to pass a comprehensive immigration reform law broke down in the House of Representatives after it passed in the Senate in June."
        ],
        [
            "Conservative members of the Republicans in the House, where they hold a majority, had been adamant about not signing off on any measure that called for granting a pathway to legalization for people who are living in the country illegally.",
            "They maintain that that giving those immigrants any kind of break would amount to amnesty, or rewarding law-breakers."
        ],
        [
            "That created a fight among Republicans in Congress, with some – including conservatives such as Sen. Marco Rubio, a Tea Party lawmaker from Florida – arguing that deporting all 11 million undocumented immigrants was not a realistic option, and that not doing anything to bring them onto the radar amounted to an amnesty."
        ],
        [
            "Proponents of a pathway to legal status argued that the opportunity would be given only to those undocumented immigrants who earned it by meeting a strict set of criteria including paying fines, learning English, having a clean police record and paying taxes."
        ],
        [
            "Politico, a news site that covers politics, reported that House Speaker John Boehner, who is from Ohio, wants the plan, also referred to as “principles,” completed and made public before President Barack Obama delivers his State of the Union address on Jan. 28."
        ],
        [
            "The plan commits itself to the idea – which is heavily favored by many Republicans – that immigration reform will be handled in a piecemeal fashion, instead of comprehensively, as the Senate did."
        ],
        [
            "Obama told Senate Democrats this week that he believes that Boehner will make sure immigration reform is passed this year, according to The Hill, a a political publication in Washington, D.C."
        ],
        [
            "The president reportedly told the Democrats in a meeting that Republicans need to take action on immigration in order to keep the volatile issue from hurting their chances with Latino voters, as it appears to have done in 2012, when GOP presidential candidate Mitt Romney did extremely poorly with the increasingly important voting bloc."
        ],
        [
            "Obama obtained three quarters of Latino votes cast in 2012, while Romney racked up 27 percent."
        ],
        [
            "Sen. Charles Schumer, a New York Democrat, was quoted in The Hill as saying: “I think our Republican colleagues realize that to be blocking immigration reform is not good for them.”"
        ]
    ]
}
