{
    "source": "hpo",
    "main-entities": ["Eric Holder", "protestors", "police"],
    "main-event": "Eric Holder speaks on Ferguson",
    "title": "Eric Holder Hears From The People Of Ferguson Face To Face",
    "url": "https://www.huffingtonpost.com/2014/08/20/eric-holder-ferguson-shooting_n_5696164.html?ec_carp=4109904766417915149",
    "word-count": 861,
    "date": "2014-08-20",
    "uuid": "605bd90c-703d-455b-b4b9-660e0c2847ab",
    "triplet-uuid": "ed8c136f-8d44-4c83-ad05-0dcfc3a0c54a",
    "body-paragraphs": [
        [
            "FERGUSON, Mo. -- Attorney General Eric Holder said Wednesday that the “eyes of the nation and the world” are on this small suburb of St. Louis where an unarmed teenager was shot and killed by police earlier this month.",
            "The issues raised by Michael Brown's death, Holder said, have simmered “beneath the surface in more communities than just Ferguson.”"
        ],
        [
            "On Thursday, he told reporters in Washington that the Justice Department would thoroughly investigate the case, and would \"continue to stand with Ferguson.\"",
            "He also said that \"few things have affected me as greatly as my trip to Ferguson.\""
        ],
        [
            "Before a larger meeting at St. Louis Community College–Florissant Valley on Wednesday, the attorney general met with several students at the local school in what he described as an “opportunity to sit down with some wonderful young people and to hear them talk about the mistrust they have at a young age.”"
        ],
        [
            "Dominique McCoy, who attended the smaller meeting, told The Huffington Post that Holder said change wouldn't happen overnight.",
            "\"He just let us speak, basically.",
            "He semi-voiced his opinion, but we all did the talking.",
            "He agreed somewhat to what everyone said,” McCoy added."
        ],
        [
            "A separate attendee, Molyrik Welch, noted to another reporter that her brother had died following an encounter with Ferguson police in 2011."
        ],
        [
            "Holder told the students he understands \"the mistrust\" between some residents and the police."
        ],
        [
            "“I am the attorney general of the United States, but I am also a black man,\" Holder said."
        ],
        [
            "Holder told others at the community college how he had been stopped on the New Jersey Turnpike and accused of speeding twice in the past, with police searching his car."
        ],
        [
            "\"I remember how humiliating that was and how angry I was and the impact it had on me,\" Holder said."
        ],
        [
            "\"The same kid who got stopped on the New Jersey freeway is now the attorney general of the United States,\" Holder added.",
            "\"This country is capable of change. But change doesn't happen by itself.\""
        ],
        [
            "After the college events, Holder headed over to Drake's Place restaurant in Ferguson to talk with other community members.",
            "Some people were told that they would be meeting with an official from the Justice Department, but not that it was Holder.",
            "The owners of the restaurant said they were informed of the event only about an hour ahead of time.",
            "The Justice Department’s Community Relations Service had arranged for the gatherings."
        ],
        [
            "Holder was greeted as a star at Drake's Place, posing for selfies and group photos with residents and shaking hands.",
            "He settled into a corner booth as residents explained the problems that need to be rectified."
        ],
        [
            "Soon, Capt. Ron Johnson of the Missouri State Highway Patrol, who has earned some praise since he took over policing of Ferguson's nightly protests, stopped by to greet the attorney general."
        ],
        [
            "“My man! You are the man,” Holder said as Johnson walked in."
        ],
        [
            "After the meeting, attendees said they were thankful that Holder and the federal government were paying attention to Ferguson’s problems."
        ],
        [
            "“He told me that he was here because he was concerned about everything that was going on and he wanted us to voice our opinions and what did we want to change, and that he was going back to the White House to report so we can get some funding, so we can get a game plan on how to help our community,” Angela Whitman told HuffPost."
        ],
        [
            "Yvette Townsend-Saunders called the meeting “wonderful” and said she was thankful that Holder had come to the town."
        ],
        [
            "“He said that there needs to be some changes made, things need to be looked into and investigated,” Townsend-Saunders said.",
            "“When you were a little boy and you didn’t do something well at school, your mother had to jump in.",
            "When the teacher didn’t do something right, the principal had to jump in.",
            "I think if you do something right from the bottom, the top doesn’t have to jump in.",
            "If things were done right in the beginning, all this wouldn’t have to be.”"
        ],
        [
            "“We didn’t know it was Eric Holder [coming],” Rev. John Paul Hopping of Our Lady of Guadalupe, told HuffPost.",
            "“They were really nice and they were really listening.",
            "They’re looking for solutions and they want to help.”"
        ],
        [
            "At the community college, Holder said that they were starting “a good dialogue” but that it was “not enough.”"
        ],
        [
            "“We need concrete action to change things in this country,” he said, according to excerpts provided by the Justice Department.",
            "\"This dialogue is important. But it can't simply be that we have a conversation that begins based on what happened on August 9 and ends sometime in December, and nothing happens.",
            "As I was just telling these young people, change is possible.",
            "The same kid who got stopped on the New Jersey freeway is now the attorney general of the United States.",
            "This country is capable of change. But change doesn't happen by itself.”"
        ],
        [
            "In addition to Ferguson community members, Holder spent Wednesday meeting with officials from the St. Louis-based U.S. attorney's office and the local FBI office investigating Brown's death.",
            "He is talking with Brown's parents and with members of the local congressional delegation."
        ]
    ]
}
