{
    "source": "fox",
    "main-entities": ["Eric Holder", "protestors", "police"],
    "main-event": "Eric Holder speaks on Ferguson",
    "title": "Holder says he understands mistrust of police as Ferguson protests dwindle",
    "url": "http://www.foxnews.com/politics/2014/08/21/holder-says-understands-mistrust-police-as-ferguson-protests-dwindle/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+foxnews%2Fmost-popular+%28Internal+-+Most+Popular+Content%29",
    "word-count": 617,
    "date": "2014-08-21",
    "uuid": "6a2ea823-1d8b-4e82-9c40-23daf0847a47",
    "triplet-uuid": "ed8c136f-8d44-4c83-ad05-0dcfc3a0c54a",
    "body-paragraphs": [
        [
            "Attorney General Eric Holder said Wednesday that he understands why many black Americans distrust the police as he made a one-day swing through the St. Louis suburb of Ferguson, Mo., where a black teenager was fatally shot by a white police officer almost two weeks earlier."
        ],
        [
            "Holder made the comments during a meeting with about 50 community leaders at the Florissant campus of St. Louis Community College in which he heard about their own issues with law enforcement officials."
        ],
        [
            "Ferguson has endured more than a week of unrest since the August 9 death of 18-year-old Michael Brown, who was shot by Ferguson Police Officer Darren Wilson.",
            "The Obama administration intended the trip to underscore its commitment to civil rights in general and the Ferguson case in particular."
        ],
        [
            "\"I understand that mistrust,\" Holder said.",
            "\"I am the attorney general of the United States. But I am also a black man.\"",
            "The attorney general then described how he was stopped twice on the New Jersey Turnpike and accused of speeding.",
            "Police searched his car, going through the trunk and looking under the seats."
        ],
        [
            "\"I remember how humiliating that was and how angry I was and the impact it had on me,\" Holder said."
        ],
        [
            "Holder also described how once, while living in the Georgetown neighborhood of Washington, he was running to catch a movie with his cousin when a squad car rolled up and flashed its lights at the pair.",
            "The officer yelled, \"Where are you going? Hold it!\" Holder recalled."
        ],
        [
            "His cousin \"started mouthing off,\" and Holder urged him to be quiet."
        ],
        [
            "\"We negotiate the whole thing, and we walk to our movie.",
            "At the time that he stopped me, I was a federal prosecutor. I wasn't a kid,\" he said."
        ],
        [
            "While in Ferguson, Holder met with federal officials investigating the case, as well as Brown's parents.",
            "He also met with Missouri Highway Patrol Capt. Ron Johnson, who has been in charge of security in Ferguson for nearly a week.",
            "The National Guard is also helping to keep the peace."
        ],
        [
            "On Wednesday night, a diminished number of protesters marched around a single block in Ferguson as a thunderstorm filled the sky with lighting and dumped rain.",
            "Police still stood guard, but many wore regular uniforms rather than riot gear."
        ],
        [
            "Johnson said there were six arrests Wednesday, compared to 47 the previous night.",
            "He called it \"a very good night,\" and said Holder's visit had let people know their voices had been heard."
        ],
        [
            "In nearby Clayton, a grand jury began hearing evidence to determine whether Wilson should be charged in Brown's death.",
            "A spokesman for St. Louis County Prosecutor Bob McCulloch said there was no timeline for the process, but it could take weeks."
        ],
        [
            "Outside the St. Louis County Justice Center, where the grand jury convened, two dozen protesters gathered in a circle for a prayer, chanted and held signs urging McCulloch to step aside."
        ],
        [
            "McCulloch's deep family connections to police have been cited by some black leaders who question his ability to be impartial in the case.",
            "McCulloch's father, mother, brother, uncle and cousin all worked for the St. Louis Police Department, and his father was killed while responding to a call involving a black suspect."
        ],
        [
            "The prosecutor, who is white, has insisted his background will have no bearing on the handling of the Brown case, which has touched off days of nighttime protests during which authorities used tear gas and rubber bullets to clear the streets."
        ],
        [
            "On Wednesday, police said an officer had been suspended for pointing a semi-automatic assault rifle at demonstrators, then cursing and threatening to kill one of them.",
            "A protester captured the exchange on video Tuesday and posted it to YouTube and other websites."
        ]
    ]
}
