{
    "source": "NYT",
    "main-entities": ["Eric Cantor", "David Brat"],
    "main-event": "Eric Cantor defeated by David Brat",
    "title": "Eric Cantor Defeated by David Brat, Tea Party Challenger, in G.O.P. Primary Upset",
    "url": "https://www.nytimes.com/2014/06/11/us/politics/eric-cantor-loses-gop-primary.html",
    "word-count": 1172,
    "date": "2014-06-12",
    "uuid": "415822d3-fde6-4dca-bb9e-dc6e0692eb19",
    "triplet-uuid": "ee05c9b3-529c-4268-ad72-19bd34f7197e",
    "body-paragraphs": [
        [
            "WASHINGTON — In one of the most stunning primary election upsets in congressional history, the House majority leader, Eric Cantor, was soundly defeated on Tuesday by a Tea Party-backed economics professor who had hammered him for being insufficiently conservative."
        ],
        [
            "The result delivered a major jolt to the Republican Party — Mr. Cantor had widely been considered the top candidate to succeed Speaker John A. Boehner — and it has the potential to change both the debate in Washington on immigration and, possibly, the midterm elections."
        ],
        [
            "With just over $200,000, David Brat, a professor at Randolph-Macon College in Ashland, Va., toppled Mr. Cantor, repeatedly criticizing him for being soft on immigration and contending that he supported what critics call amnesty for immigrants in the country illegally."
        ],
        [
            "During a short concession speech late Tuesday, Mr. Cantor did not try to analyze his defeat or cast blame, saying only that he knew he had disappointed his supporters."
        ],
        [
            "In victory, Mr. Brat said that his candidacy had resonated with voters who believed that politics had been dumbed down by partisan infighting."
        ],
        [
            "“The American people want to pay attention to serious ideas again,” Mr. Brat said, speaking on Fox News.",
            "“Our founding was built by people who were political philosophers, and we need to get back to that, away from this kind of cheap political rhetoric of right and left.”",
            "He will face Jack Trammell, a Democrat who is also a professor at Randolph-Macon, this fall in the heavily Republican district."
        ],
        [
            "Republicans were so sure that Mr. Cantor would win that most party leaders had been watching for how broad his victory would be.",
            "His defeat will reverberate in the capital and could have major implications for any chance of an immigration overhaul."
        ],
        [
            "Mr. Cantor, 51, who is in his seventh term, had sought to counter Mr. Brat’s accusations that he was too willing to compromise on immigration.",
            "The majority leader, who had raised $5.4 million for the campaign, blanketed Virginia’s Seventh Congressional District with fliers and television advertisements in which he emphasized that he opposed an “amnesty” policy."
        ],
        [
            "But with significant help from conservative talk radio hosts like Laura Ingraham, Mr. Brat was able to galvanize opposition to Mr. Cantor in one of Virginia’s most conservative congressional districts."
        ],
        [
            "Ms. Ingraham, one of the few high-profile conservatives to put her muscle behind Mr. Brat, said on Fox News on Tuesday night that the primary results were “an absolute repudiation of establishment politics” and that Republican leaders should take note."
        ],
        [
            "“He really just didn’t have very much money, but what he did have was a lot of heart,” she said of Mr. Brat.",
            "“I think there will be a lot of people out there saying this could be the beginning of something really big for the Republican Party.”"
        ],
        [
            "Mr. Cantor’s loss recalled the defeat of former Speaker Thomas S. Foley, a Democrat who lost to a little-known Republican, George Nethercutt, in the 1994 general elections that delivered control of Congress to the Republicans.",
            "It is much rarer for a member of the congressional leadership to lose a primary."
        ],
        [
            "Mr. Brat had little help from national groups that have funded other Tea Party challengers.",
            "Instead, he relied mostly on state and local activists."
        ],
        [
            "Larry Nordvig, executive director of the Richmond Tea Party, said the national groups were not aware of “how much activity was going on underneath the surface down here and how large the ABC — Anybody But Cantor — mentality was.”"
        ],
        [
            "In a February interview, Mr. Brat spoke of the difficulty he had in rounding up conservative support despite meeting with powerful groups and donors to try to convince them that he was worth the investment.",
            "“I met with all of them,” he said. “But it’s tough.",
            "Everybody just wants to see the polls, how much money you’ve raised.",
            "But they do not know what’s going on on the ground.”"
        ],
        [
            "Mr. Cantor had won primaries in his district, which stretches from Richmond to the Washington suburbs, with as much as 79 percent of the vote, and he won the general election race for a seventh term in 2012 with 58 percent."
        ],
        [
            "Within the Republican Party, he was seen as a star, with the ability to tap into the energy of the House’s more conservative members while at the same time not alienating the party’s establishment wing."
        ],
        [
            "In the House, his relationship with Mr. Boehner reflected some of the larger tensions within the party.",
            "Mr. Cantor was strongly opposed, for instance, to the so-called grand bargain negotiations on the budget between the speaker and President Obama."
        ],
        [
            "Mr. Boehner said Tuesday that he and Mr. Cantor had “been through a lot together,” making “tough choices that come with governing.”"
        ],
        [
            "Mr. Cantor received what amounted to a warning shot from local Republicans at a district convention last month in Henrico County, his political home base, when conservatives ousted one of his loyalists as Republican chairman while he looked on."
        ],
        [
            "Yet he seemed to recognize the seriousness of the threat only in the final weeks of the campaign, when he suddenly shifted his advertising and began sending aides from Washington to his district.",
            "At that point, it was too late to stave off defeat."
        ],
        [
            "“There are some very angry people upset with the status quo, and Eric became part of that,” said former Representative Thomas M. Davis III, a Virginia Republican.",
            "“He was the only conduit they have to express their anger right now.",
            "And when Eric Cantor, a conservative and member of the leadership, is too moderate, it sends a chilling effect to other Republicans and makes it that much harder to cross over and work together.”"
        ],
        [
            "As for the prospects of an immigration overhaul now, Mr. Davis said: “How do you get that or anything done now? Eric is too liberal? This was the guy holding Boehner back.”"
        ],
        [
            "Many voters also perceived Mr. Cantor as ignoring district concerns as he sought to raise his national profile.",
            "He kept a home in suburban Richmond and sent his children to school there, but he spent much of his time in recent years traveling across the country to raise money and campaign for Republican candidates."
        ],
        [
            "It was all part of his ambition to become speaker of the House, having begun his career as the driver to his predecessor, Representative Thomas J. Bliley Jr.",
            "Reaching that pinnacle had, of late, seemed as close as ever, with Washington full of speculation that Mr. Boehner would soon retire."
        ],
        [
            "“I’m in shock,” said Representative Patrick T. McHenry, Republican of North Carolina."
        ],
        [
            "Congressional Democrats were ecstatic, and so stunned by Mr. Cantor’s loss that many admitted they did not even know who the Democratic challenger was."
        ],
        [
            "An informal dinner party at the Georgetown apartment of Representative Nancy Pelosi of California, the Democratic leader, turned into a celebration."
        ],
        [
            "“I never thought I’d see the day that Eric Cantor would be losing his primary,” said Representative Louise M. Slaughter of New York, the senior Democrat on the House Rules Committee."
        ],
        [
            "Ms. Pelosi said, “I still can’t even believe it.”"
        ]
    ]
}
