{
    "source": "FOX",
    "main-entities": ["Eric Cantor", "David Brat"],
    "main-event": "Eric Cantor defeated by David Brat",
    "title": "Who is Dave Brat?",
    "url": "http://www.foxnews.com/politics/2014/06/10/who-is-dave-brat-political-novice-who-beat-house-majority-leader-eric-cantor/?intcmp=trending",
    "word-count": 227,
    "date": "2014-06-10",
    "uuid": "e7636bcb-a5fa-465d-8846-e8eccb1f002e",
    "triplet-uuid": "ee05c9b3-529c-4268-ad72-19bd34f7197e",
    "body-paragraphs": [
        [
            "House Majority Leader Eric Cantor was beaten Tuesday night by a political novice who is currently working as an economics professor at a small Virginia college."
        ],
        [
            "So who is Dave Brat, and how did he pull off such a stunning win?"
        ],
        [
            "The 49-year-old teaches at Randolph-Macon College, a small liberal arts school north of Richmond.",
            "He raised just over $200,000 for his campaign, while Cantor spent more than $1 million in April and May alone to try to beat back his challenge."
        ],
        [
            "However, Brat offset the cash disadvantage with endorsements from conservative activists like radio host Laura Ingraham and with help from local Tea Party activists angry at Cantor."
        ],
        [
            "Brat cast the congressman as a Washington insider who isn't conservative enough.",
            "Last month, a feisty crowd of Brat supporters booed Cantor in front of his family at a local party convention."
        ],
        [
            "Brat received his doctorate from American University, his master's from Princeton Theological Seminary and his bachelor's from Hope College.",
            "In addition to teaching, he has served on the state Joint Advisory Board of Economists and served as the president of the Virginia Association of Economists."
        ],
        [
            "He also states on his website that he is active in his local Republican party, and has often served as commentator on economic issues for local media."
        ],
        [
            "Brat is married and has two children, an 11-year-old daughter and a 15-year-old son."
        ]
    ]
}
