{
    "source": "hpo",
    "main-entities": ["Donald Trump", "Barack Obama"],
    "main-event": "Trump holds birther meeting",
    "title": "Donald Trump Signals He Has Investigators Looking Into Obama Citizenship Issue In Hawaii",
    "url": "http://www.huffingtonpost.com/2011/04/07/donald-trump-obama-birth-_1_n_845989.html",
    "word-count": 566,
    "date": "2011-04-07",
    "uuid": "55b70267-66ec-4822-a139-ab582ef6faea",
    "triplet-uuid": "005a2961-0c2e-4575-8eec-770ba52a08e0",
    "body-paragraphs": [
        [
            "WASHINGTON — Real estate tycoon Donald Trump said Thursday he hopes questions surrounding Barack Obama’s U.S. citizenship won’t be the defining issue if he’s chosen as the Republican candidate to challenge the president’s re-election."
        ],
        [
            "Trump told NBC News in an interview that plans to decide by June whether to run.",
            "He said that if he’s nominated, “I’d like to beat him straight up,” not on the basis of the birth issue."
        ],
        [
            "A national NBC/WSJ poll released yesterday shows Trump tied for 2nd with Mike Huckabee in the 2012 GOP primary field at 17 percent (Mitt Romney leads the pack at 21 percent)."
        ],
        [
            "NBC further notes, “Strikingly, Trump . . . finishes first among Tea Party supporters (at 20 percent), followed by Romney (17 percent), Huckabee (14 percent), Palin (12 percent) and Gingrich (9 percent).”"
        ],
        [
            "Trump said he didn't introduce the citizenship issue, but was asked about it during an interview a month ago.",
            "Since then, he said he's looked into it and believes \"there is a big possibility\" Obama may have violated the Constitution."
        ],
        [
            "\"I want to see the birth certificate,\" said Trump in an interview on NBC's \"Today\" show, according to TIME.",
            "\"How come his own family doesn't know which hospital he was born in?",
            "How come-- forget about birth certificates. Let's say there's no birth certificate.",
            "How come in the hospital itself, okay? This is one of the...in the hospital itself, there's no records of his birth.",
            "In other words, it doesn't say how much they paid, where is the doctor, here's your room bill.\""
        ],
        [
            "Officials in Hawaii have certified that Obama was born in that state.",
            "But \"birthers\" have demanded additional proof, asserting he could have been born in Kenya.",
            "\"I'm not convinced that he has one,\" Trump said of the birth certificate issue."
        ],
        [
            "\"Today\" show host Meredith Vieira asked Trump, \"You've been privy to all of this to know this?\"",
            "His response: \"Well, I have people that actually have been studying it and they cannot believe what they're talking.\""
        ],
        [
            "The remarks from the potential presidential candidate prompted Vieira to ask Trump if he had people on the ground in Hawaii searching for proof of the president's citizenship.",
            "He signaled he did, saying, \"And they cannot believe what they're finding. And I'm serious.\""
        ],
        [
            "When asked how genuine his presidential ambition is, Trump said, \"I always take things seriously, but I've never taken it seriously like this.\""
        ],
        [
            "\"I wish I didn't have to do it,\" he said."
        ],
        [
            "\"I wish this was the greatest place in the world,\" Trump said, but he also said jobs are disappearing in the United States and that Obama has given the country \"a terrible presidency.\""
        ],
        [
            "Trump said that if the current fight over budget issues forces a shutdown, \"I think the president will be blamed.\""
        ],
        [
            "He accused Obama of carrying out a confusing policy on the civil war in Libya, saying \"nobody knows what's happening, and now it looks like (Libyan strongman Moammar) Gadhafi is going to beat the United States.\""
        ],
        [
            "\"I'm only interested in Libya if we get the oil,\" Trump said.",
            "He said Obama \"doesn't have a doctrine (on foreign affairs.)",
            "Foreign affairs is, we take care of ourselves first\""
        ],
        [
            "Of Obama, he said, \"I want him to do well. ...",
            "I love this country, but this country is going to hell. ...",
            "The world laughs at us. They won't be laughing if I'm elected president.\""
        ]
    ]
}
