{
    "source": "fox",
    "main-entities": ["Donald Trump", "Barack Obama"],
    "main-event": "Trump holds birther meeting",
    "title": "Trump Sends Investigators to Hawaii, Gains in GOP Presidential Primary Poll",
    "url": "http://www.foxnews.com/politics/2011/04/07/trump-sends-investigators-hawaii-gains-gop-presidential-primary-poll/?test=latestnews",
    "word-count": 666,
    "date": "2011-04-07",
    "uuid": "2114860f-e96f-41dd-b5e2-56f755b0e6f6",
    "triplet-uuid": "005a2961-0c2e-4575-8eec-770ba52a08e0",
    "body-paragraphs": [
        [
            "WASHINGTON -- Real estate tycoon Donald Trump said Thursday he has doubts about whether President Obama was born in the United States and has sent investigators to Hawaii looking for answers."
        ],
        [
            "The \"Celebrity Apprentice\" star has shot up in the polls as a potential GOP nominee, in part because of his questions about whether Obama is constitutionally allowed to be president if he doesn't prove he is a natural-born citizen of the United States."
        ],
        [
            "\"I have people that actually have been studying it and they cannot believe what they're finding,\" Trump told NBC's \"Today\" show on Thursday."
        ],
        [
            "Officials in Hawaii have certified Obama's citizenship, but a segment of society -- labeled \"birthers\" in the vernacular -- have demanded additional proof.",
            "Trump said when he started seriously considering a presidential bid a few weeks back, he thought the president was native-born, but now he's not so sure."
        ],
        [
            "\"His grandmother in Kenya said he was born in Kenya, and she was there and witnessed the birth.",
            "He doesn't have a birth certificate or he hasn't shown it.",
            "He has what's called a certificate of live birth.",
            "That is something that's easy to get,\" Trump said, arguing that Obama has spent $2 million in legal fees \"to get away from this issue.\""
        ],
        [
            "Calling it potentially one of the biggest scams in the history of politics, Trump said he'd like Obama to show his birth certificate."
        ],
        [
            "\"And to be honest with you, I hope he can,\" he told \"Today.\""
        ],
        [
            "Trump, who placed second in an NBC/ Wall Street Journal poll of potential 2012 Republican candidates, said he will decide by June whether to run, and if he is the GOP nominee, \"I'd like to beat him straight up,\" not on the basis of the question of where Obama was born."
        ],
        [
            "In the poll, former Massachusetts Gov. Mitt Romney leads the would-be group of contenders with 21 percent of Republican primary voters surveyed followed by Trump and former Arkansas Gov. Mike Huckabee at 17 percent each.",
            "The Republican primary poll was taken as part of a March 31-April 4 survey of 1,000 adults, but the sample survey of Republican primary voters polled was only 238."
        ],
        [
            "In the poll, former House Speaker Newt Gingrich garnered 11 percent, while former Alaska Gov. Sarah Palin earned 10 percent support.",
            "Former Minnesota Gov. Tim Pawlenty earned 6 percent, Minnesota Congresswoman Michele Bachmann got 5 percent, former Pennsylvania Sen. Rick Santorum won 3 percent and Mississippi Gov. Haley Barbour received 1 percent support."
        ],
        [
            "Asked in the interview how genuine his presidential ambition is, Trump, who would have to hand over the reins of his international empire in order to run the country, said, \"I always take things seriously, but I've never taken it seriously like this.",
            "I wish I didn't have to do it.\""
        ],
        [
            "But speaking on ABC News, New Jersey Republican Gov. Chris Christie, who is insistent he personally is not a candidate for president in 2012, said he wasn't sure his friend Trump would be either."
        ],
        [
            "\"Donald's a really good friend of mine, I don't know that Donald really wants to be president,\" Christie said in an interview that aired Wednesday night.",
            "Christie: I don't know that he wants that in particular.",
            "... We've spoken about it and all I could say to you is, I’ll believe it when I see it.\""
        ],
        [
            "Back on NBC, Trump said he wants Obama to do well, but the presidency is not going that direction."
        ],
        [
            "\"I love this country, but this country is going to hell. ...",
            "The world laughs at us. They won't be laughing if I'm elected president,\" he said."
        ],
        [
            "Trump accused Obama of conducting a confusing policy on the civil war in Libya, saying \"nobody knows what's happening, and now it looks like (Libyan strongman Muammar) al-Qaddafi is going to beat the United States.\""
        ],
        [
            "\"I'm only interested in Libya if we get the oil,\" Trump said.",
            "He said Obama \"doesn't have a doctrine (on foreign affairs.)",
            "Foreign affairs is, we take care of ourselves first.\""
        ]
    ]
}
