{
    "triplet-uuid": "2153fb3e-6b09-410c-bfea-d095c49a54ba",
    "date": "2011-11-02",
    "main-entities": ["Barack Obama", "Senate Republicans"],
    "main-event": "Obama taunts GOP for ignoring jobs bill",
    "body-paragraphs": [
        [
            "The House vote to reaffirm that \"In God We Trust\" is the U.S. motto is \"not putting people back to work,\" President Obama said Wednesday in a speech pushing his jobs bill."
        ],
        [
            "\"I trust in God, but God wants to see us help ourselves by putting people back to work,\" the president said during a speech at Key Bridge in Washington, D.C., where he was highlighting the need for federal funding of infrastructure repairs nationwide."
        ],
        [
            "Asked later in the day whether it was fair to invoke God in the debate over the Congressional schedule, White House Press Secretary Jay Carney said, \"Yeah, I think it's a fair jab if I do say so myself.\""
        ],
        [
            "\"I believe that phrase from the Bible is 'the Lord helps those who help themselves.'",
            "And I think the point the president is making is that, you know, we should -- we have it within our capacity to do the things to help the American people.",
            "And that's why he's working so hard to get Congress to take action on the American Jobs Act and the provisions therein,\" Carney told reporters at his daily briefing.",
            "The phrase quoted by Carney is not in the Bible, though it is often mistaken as a verse."
        ],
        [
            "Later when the official White House briefing transcript was released, there was an asterik, to Carney's statement, \"* This common phrase does not appear in the Bible,\" it read."
        ],
        [
            "Carney said the particular reference by the president to God was made in the context of \"inaction by the House of Representatives, which has spent time on issues like commemorative Hall-of-Fame baseball coins and reaffirming a motto that I don't think anyone doubted, is that ‘In God We Trust' is our motto.",
            "So his point was simply that the House should get busy with matters of great importance to the United States and to the American people.\""
        ],
        [
            "During his remarks, the president also called out House Speaker John Boehner for what the administration has made a drumbeat over the last week -- a do-nothing Congress."
        ],
        [
            "\"What have you guys been debating, John? You've been debating a commemorative coin for baseball?\" Obama said.",
            "The House resolution on the national motto passed Tuesday was introduced by Rep. Randy Forbes, R-Va., and considered under an expedited floor procedure.",
            "It passed in a 396-9 vote."
        ],
        [
            "After the vote, Rep. Bobby Scott, D-Va., one of the nine lawmakers to vote against the resolution, said the nation faces bigger problems, such as the economy, failing public schools and poverty."
        ],
        [
            "\"Instead of facing these challenges and creating jobs to help American people make sure they have a roof over their head and food on their table, we are debating whether or not to affirm and proliferate a motto that was adopted in 1956 and is under no threat of attack,\" he said."
        ],
        [
            "House Republicans have argued that the procedural votes don't take up very much time.",
            "They add that they have brought up 15 bills that they contend will help create jobs but have been ignored in the Democratic-led Senate.",
            "The Senate is preparing to take up a portion of the president's jobs bill - on infrastructure -- after the $447 billion jobs package failed when offered as a whole."
        ],
        [
            "Carney contended that Congress wouldn't be focused at all on jobs if not for the president's power of persuasion."
        ],
        [
            "\"If not for the president's insistence on pushing the American Jobs Act, would we be having a debate about jobs and the economy right now in Washington or would Congress be -- or the Republicans in Congress be so divorced from the reality that Americans are encountering every day that they would be debating matters wholly unrelated to the primary concerns of the American people?",
            "I think that's possible.",
            "I mean, I know that Democrats would be out there pushing this, and certainly the president is,\" he said."
        ]
    ],
    "title": "Obama: ‘In God We Trust' Vote Not Creating Jobs",
    "keywords": "United States,public schools,jobs package,Washington D C,the nation,White House,American Jobs Act,President Obama,jobs bill,Jobs Act,U S,American Jobs",
    "word-count": 656,
    "source": "fox",
    "url": "http://www.foxnews.com/politics/2011/11/02/obama-in-god-trust-vote-not-creating-jobs/",
    "uuid": "8b81b63a-ba3f-4d5e-9a73-079b1828c525"
}
