{
    "triplet-uuid": "2153fb3e-6b09-410c-bfea-d095c49a54ba",
    "date": "2011-11-02",
    "main-entities": ["Barack Obama", "Senate Republicans"],
    "main-event": "Obama taunts GOP for ignoring jobs",
    "source": "nyt",
    "url": "http://thecaucus.blogs.nytimes.com/2011/11/02/obama-taunts-house-for-ignoring-jobs-bill/",
    "uuid": "73e9fe54-0fdd-44ba-b29e-f59572dc47d5",
    "body-paragraphs": [
        [
            "President Obama on Wednesday visited another bridge in need of repair – this one somewhat closer to home, between Washington and Virginia — to promote his job-creation proposals as the Senate began the latest partisan debate over his plans."
        ],
        [
            "But in pressing for approval of $60 billion in infrastructure spending, Mr. Obama took his biggest shot not at the measure’s Republican opponents in the Senate, but at those in the House.",
            "He tweaked House Republicans for passing a resolution on Tuesday reaffirming the national motto, “In God We Trust,” when they should be creating jobs."
        ],
        [
            "“I trust in God,” Mr. Obama said, “but God wants to see us help ourselves by putting people back to work!”"
        ],
        [
            "Invoking patriotism as well as divine intervention – Mr. Obama stood against the backdrop of a giant American flag – he spoke before an audience that included unemployed construction workers, whose industry is among the hardest hit by the housing bust."
        ],
        [
            "“I’m joining many of these workers to say that it makes absolutely no sense when there’s so much work to be done that they’re not doing the work,” Mr. Obama said to their applause.",
            "“Not when there are so many roads and bridges and runways waiting to be repaired and waiting to be rebuilt.”"
        ],
        [
            "The president’s short trip from the White House to the event stage on the Potomac riverfront came more than a month after he began campaigning throughout the country for his jobs plan, building public pressure on Republicans but winning no votes from them.",
            "Mr. Obama singled out the Republican leaders of the House and Senate – Speaker John A. Boehner of Ohio and Senator Mitch McConnell of Kentucky, the minority leader – just as he did in September when he visited an aging bridge over the Ohio River that connects their two states."
        ],
        [
            "Mr. Obama said the two leaders and other Republicans had supported public-works investments in the past.",
            "But Republicans oppose Mr. Obama’s $447 billion job-creation plan, which also includes tax cuts for workers and employers and state aid to avoid layoffs of teachers, police officers and firefighters, because the package would be paid for with higher taxes on those with taxable income of more than $1 million a year."
        ],
        [
            "For the same reason, some leading business groups, including the U.S. Chamber of Commerce and the Associated General Contractors of America, have withdrawn support for the infrastructure spending bill, though Mr. Obama cited the Chamber as a supporter in his remarks."
        ],
        [
            "The House has declined to take up Mr. Obama’s jobs package, while Senate Democrats could not muster the 60 votes needed to block a Republican filibuster against either the full $447 billion package or a $35 billion piece providing state aid, mostly for teachers’ pay.",
            "With White House support, Senate Democrats have broken the measure into its main parts to force Republicans to take a series of tough votes on proposals, each of which has broad public support, according to polls."
        ],
        [
            "“The American people are with me with this,” Mr. Obama said.",
            "“And it’s time for folks running around spending all their time talking about what’s wrong with America to spend some time rolling up their sleeves to help us make it right.",
            "There’s nothing wrong in this country that we can’t fix.”"
        ],
        [
            "The outcome in the Senate on the infrastructure spending provision, however, is not expected to be any different from the previous two votes."
        ],
        [
            "Mr. Obama’s transportation secretary, Ray LaHood, a former Republican congressman from Illinois, appeared with him at the Key Bridge and then went to the Capitol to meet with lawmakers."
        ],
        [
            "In response to Mr. Obama, House Republicans said the Democratic-controlled Senate should take up some 16 House-passed measures; most would attack federal regulations or spending and would have long-term impact, analysts say, but they would not spur job creation in the coming year or two."
        ],
        [
            "Mr. Boehner facetiously said that Mr. Obama, as a former Democratic senator, could help: “I’m sure he has great influence over there in terms of getting them to take up these bills that really will help put the American people back to work.”"
        ]
    ],
    "title": "Obama Taunts G.O.P.  for Ignoring Jobs Bill",
    "keywords": "",
    "word-count": 765
}
