{
    "source": "hpo",
    "main-entities": ["Rick Perry","Barack Obama"],
    "main-event": "Rick Perry pledges to end \"[President Barack] Obama's war on religion\"",
    "title": "Perry Goes After Obama Over Don't Ask Don't Tell",
    "url": "http://www.huffingtonpost.com/2011/12/07/rick-perry-iowa-culture-wars_n_1133754.html",
    "word-count": 269,
    "date": "2011-12-07",
    "uuid": "7003147b-4a87-41d8-8643-c410d2befd61",
    "triplet-uuid": "3db93526-a344-4ea4-8772-3734d0cfdfb1",
    "body-paragraphs": [
        [
            "Republican presidential candidate Rick Perry pledges to end \"[President Barack] Obama's war on religion\" in a new television ad airing in Iowa, railing against open service of gays and lesbians in the military and the prohibition against prayer in public schools."
        ],
        [
            "\"I'm not ashamed to admit I'm a Christian,\" says Perry.",
            "\"But you don't need to be in the pews every Sunday to know that there's something wrong in this country when gays can serve openly in the military but our kids can't openly celebrate Christmas or pray in school.\""
        ],
        [
            "\"As president, I'll end Obama's war on religion and I'll fight against liberal attacks on our religious heritage,\" the Texas governor continues.",
            "\"Faith made America strong. It can make her strong again.\""
        ],
        [
            "Perry has recently stepped up his attacks on Obama for cultural issues.",
            "In a statement released Tuesday, he decried the Obama administration’s decision to use foreign aid to promote rights for gays and lesbians abroad."
        ],
        [
            "\"This is just the most recent example of an administration at war with people of faith in this country,\" he said.",
            "\"Investing tax dollars promoting a lifestyle many Americas of faith find so deeply objectionable is wrong.",
            "President Obama has again mistaken America's tolerance for different lifestyles with an endorsement of those lifestyles.\""
        ],
        [
            "Politico reported Tuesday that Perry bought $1 million in broadcast television time ahead of the Jan. 3 caucuses.",
            "The Dallas Morning Newsrecently reported that his presidential campaign plans to bring \"more than 600 influential Texans\" to Iowa in December.",
            "However, Perry netted just six percent support among likely Republican caucus-goers, according to a Des Moines Register poll released Saturday."
        ]
    ]
}
