{
    "source": "fox",
    "main-entities": ["Rick Perry", "Barack Obama"],
    "main-event": "Rick Perry claims to defend feith in America after calling President Obama is waging a \"War on Religion\"",
    "title": "Perry TV Ad: I Can Defend Faith from Obama’s “War on Religion",
    "url": "http://www.foxnews.com/politics/2011/12/07/perry-tv-ad-can-defend-faith-from-obamas-war-on-religion/?test=latestnews",
    "word-count": 367,
    "date": "2011-12-07",
    "uuid": "ff34e76d-7a30-4136-97ff-3c65d5f963c8",
    "triplet-uuid": "3db93526-a344-4ea4-8772-3734d0cfdfb1",
    "body-paragraphs": [
        [
            "Down in the polls, Texas Gov. Rick Perry is on the attack, claiming in a new TV ad that President Obama is waging a \"War on Religion,\" and he's the GOP candidate that can defend faith in America."
        ],
        [
            "\"I'm not ashamed to admit that I'm a Christian, but you don't need to be in the pew every Sunday to know there's something wrong in this country when gays can serve openly in the military but our kids can't openly celebrate Christmas or pray in school.",
            "As President, I'll end Obama's war on religion.",
            "And I'll fight against liberal attacks on our religious heritage,\" says Perry in the new ad titled \"Strong.\""
        ],
        [
            "The ad is a state-wide buy in Iowa that starts Wednesday."
        ],
        [
            "Perry ties his faith to his conservative stands on social issues, and the campaign has zeroed in on gay marriage and social issues recently, releasing several statements laying out its argument that Obama is attacking the fundamentals social conservative believe in.",
            "The arguments range from President Obama directing the Justice Department to stop arguing for the Defense of Marriage Act, to less substantive examples like Obama leaving God out of his Thanksgiving speech this year."
        ],
        [
            "In one emailed statement, Perry stated, \"just when you thought Barack Obama couldn't get any more out of touch with America's values, AP reports his administration wants to make foreign aid decisions based on gay rights.",
            "This administration's war on traditional American values must stop.",
            "This is just the most recent example of an administration at war with people of faith in this country.",
            "Investing tax dollars promoting a lifestyle many Americas of faith find so deeply objectionable is wrong.",
            "\"Perry is referring to a presidential memorandum released by the White House, in which Obama has directed all agencies working abroad ensure U.S. diplomacy and aid programs \"promote and protect\" the rights of gays and lesbians."
        ],
        [
            "Perry is a Methodist.",
            "He has never shied away from his faith during this campaign, and in earlier appeal to key evangelical voters, he released another ad in Iowa describing himself as a \"man of faith.\""
        ],
        [
            "This latest ad \"Strong\" ends with Perry claiming, \"faith made America strong.",
            "It can make her strong again.\""
        ]
    ]
}
