{
    "source": "fox",
    "main-entities": ["Newsweek", "Michele Bachmann"],
    "main-event": "Newsweek publishes unflattering cover of Michele Bachmann",
    "title": "Bachmann Newsweek Cover Goes for Insult But Gets Criticism in Return",
    "url": "http://www.foxnews.com/politics/2011/08/09/bachmann-newsweek-cover-goes-for-insult-but-gets-criticism-in-return/?icid=maing-grid7%7Cmain5%7Cdl1%7Csec1_lnk3%7C85084",
    "word-count": 467,
    "date": "2011-08-09",
    "uuid": "35501284-f1b2-4c26-bbdd-26bf61952f47",
    "triplet-uuid": "550b80db-bdd5-442b-8f70-c8e9f3203a13",
    "body-paragraphs": [
        [
            "Rep. Michele Bachmann has declined to get into the scrum with Newsweek over its cover story of the presidential candidate called \"The Queen of Rage,\" accompanied by an unflattering photo of the Minnesota Republican, but others are calling the magazine out of bounds in its depiction."
        ],
        [
            "The National Organization for Women President Terry O'Neill said that the cover of the magazine's latest edition is \"sexist\" and referred to a simple test by the group's founder Gloria Steinem to explain how they determined that conclusion -- would the magazine do the same to a man."
        ],
        [
            "\"Who has ever called a man 'The King of Rage?'",
            "Basically what Newsweek magazine -- and this is important, what Newsweek magazine, not a blog, Newsweek magazine -- what they are saying of a woman who is a serious contender for president of the United States of America…",
            "They are basically casting her as a nut job,\" O'Neill said to The Daily Caller and NOW confirmed to FoxNews.com on Tuesday."
        ],
        [
            "\"The 'Queen of Rage' is something you apply to wrestlers or somebody who is crazy.",
            "They didn’t even do this to Howard Dean when he had his famous scream,\" she said."
        ],
        [
            "Newsweek has defended the photo -- an extreme close-up of the crystal blue-eyed Bachmann looking over the camera with a dark blue background -- saying that several of the images taken of her appeared the same way.",
            "The magazine posted other photos of her on its website, and many of them are flattering."
        ],
        [
            "Bachmann was asked about the cover during an appearance in Iowa on Monday, where she is campaigning ahead of Thursday's Fox News/Washington Examiner debate and Saturday's Ames Straw Poll.",
            "She told voters she had not seen the cover."
        ],
        [
            "\"Ah-hah,\" she said when told the story headline.",
            "\"Well, we'll have to take a look at that, won't we?\""
        ],
        [
            "O'Neill said that the main reason her group, which disagrees with Bachmann on almost every issue, would stand up for and defend Bachmann against \"these kind of misogynistic attacks is we want women to run for office.\""
        ],
        [
            "\"Of course my job is to defeat Michele Bachmann and I intend to do so.",
            "But good women will not run for office if Newsweek magazine can do this to such a prominent politician and get away with it,\" O'Neill said."
        ],
        [
            "Brent Bozell, head of the Media Research Center and ForAmerica, said he's not surprised by the magazine cover."
        ],
        [
            "\"Both Time and Newsweek have been doing this to conservatives for years.",
            "It is sheer journalistic dishonesty,\" Bozell told FoxNews.com.",
            "\"But it is precisely because of this journalistic dishonesty that conservatives should steer away from these venues -- or at least demand some form of editorial oversight given that these magazines simply cannot be trusted.\""
        ]
    ]
}
