{
    "source": "nyt",
    "main-entities": ["AARP", "social security", "fiscal conservatives"],
    "main-event": "AARP drops its opposition to Social Security cuts",
    "title": "AARP Open to Social Security Cuts",
    "url": "http://www.nytimes.com/2011/06/18/us/18aarp.html?_r=2&hp",
    "word-count": 879,
    "date": "2011-06-17",
    "uuid": "c5444cb5-e352-40cb-9d83-6735ff7eec64",
    "triplet-uuid": "576116e5-2b18-4d35-be73-36f5863c9468",
    "body-paragraphs": [
        [
            "WASHINGTON — AARP, the powerful lobby for older Americans that has been seen as one of the leading opponents of Social Security benefit cuts, said on Friday that it was open to modest reductions in benefits for future recipients."
        ],
        [
            "The group’s stance, which generated quick reaction from all sides because of its powerful voice on the issue, could provide added ammunition to fiscal conservatives who have sought unsuccessfully to restructure Social Security and chip away at the benefits it promises older Americans."
        ],
        [
            "“Our goal is to limit any changes in benefits,” John Rother, AARP’s policy chief, said in a telephone interview, “but we also want to see the system made solvent.”"
        ],
        [
            "Mr. Rother said the group’s stance on possible cuts, which was first reported in The Wall Street Journal in Friday’s editions, should be seen less as a major change in position than as a reflection of the political and financial realities facing the Social Security system and the country as a whole."
        ],
        [
            "“You have to look at all the tradeoffs,” Mr. Rother said, “and what we’re trying to do is engage the American public in that debate.”"
        ],
        [
            "He made clear that the group’s willingness to discuss cuts comes with conditions: Reductions in benefits should be “minimal,” they should not affect current recipients and instead should be directed “far off in the future,” and they should be offset by increases in tax-generated revenue."
        ],
        [
            "Nonetheless, the group’s openness to the possibility of unspecified cuts was seen as a significant development by people on all sides of the Social Security question because of AARP’s influence on federal policies affecting older Americans, including Medicare, prescription drugs and many more."
        ],
        [
            "Third Way, a moderate Democratic group in Washington that has favored possible reductions in benefits, called AARP’s position “a watershed moment” in the debate over Social Security."
        ],
        [
            "“Now that they have opened the door to reform, it is time for lawmakers to walk through it,” said Jonathan Cowan, president of Third Way."
        ],
        [
            "But other advocacy groups that are pushing to preserve Social Security benefits accused AARP of effectively abandoning its core constituency."
        ],
        [
            "Max Richtman, executive vice president of the National Committee to Preserve Social Security and Medicare, an advocacy group in Washington, said the timing of AARP’s statements was particularly bad because it came in the midst of deliberations between the Obama administration and Congressional Republicans about the debt ceiling and overall deficit reduction."
        ],
        [
            "AARP insisted that the Social Security trust funds should not be raided to reduce the deficit and that the two issues were separate.",
            "But Mr. Richtman said the group’s openness to considering future cuts would no doubt be used by deficit hawks to push for immediate cuts in Social Security benefits as part of the debate over deficit reduction."
        ],
        [
            "“I think it’s tragic that AARP would, wittingly or unwittingly, play into the hands of people who have never really liked Social Security and want to decimate it,” Mr. Richtman said.",
            "“AARP is the 800-pound gorilla, but they do not speak for seniors.”"
        ],
        [
            "Republican leaders, who have led calls for revamping Social Security, had no immediate comments on AARP’s willingness to consider benefit reductions."
        ],
        [
            "An aide to the Republican-led House Ways and Means Committee, who spoke on condition of anonymity under committee protocol, said AARP’s position was a welcome acknowledgment that Social Security would be unable to pay future benefits at the current rate and that it must be restructured."
        ],
        [
            "“The longer we wait,” the aide said, “the more difficult it will be to protect current beneficiaries and those who rely on Social Security the most.”"
        ],
        [
            "The most recent projections from the Social Security Administration, issued last month, indicate that at the current rate, the program’s trust funds will be exhausted by 2036, and that $6.5 trillion in additional money will be needed over a 75-year period to pay all scheduled benefits."
        ],
        [
            "Mr. Rother said AARP expected to hear criticism from some of its members over its position on possible cuts."
        ],
        [
            "“We have such a broad membership, Mr. Rother said.",
            "“I’m sure there will be some who will not be happy, but others will be eager to see the program put on a stronger financial footing for the long term.”"
        ],
        [
            "While AARP has not issued specific recommendations or figures on how benefit reductions might be carried out, the group’s recent discussions with its members signal support for using increased revenue to fill two-thirds of the projected gap, and benefits reductions for one-third, Mr. Rother said."
        ],
        [
            "As word of AARP’s position set off debate in Washington on Friday, the group’s chief executive, Barry Rand, issued a formal statement saying that the group’s position had not changed in any substantive way and refuting what he described as “misleading” media reports."
        ],
        [
            "“Let me be clear — AARP is as committed as we’ve ever been to fighting to protect Social Security for today’s seniors and strengthening it for future generations,” Mr. Rand said."
        ],
        [
            "While he did not directly address the question of possible cuts in benefits in his statement, Mr. Rand said his group would be working to evaluate any proposed changes in Social Security “to determine how each might — individually or in different combinations — impact the lives of current and future retirees.”"
        ]
    ]
}
