{
    "source": "fox",
    "main-entities": ["U.S. Congress","Democratic Lawmakers", "Republican Lawmakers"],
    "main-event": "House Reading of Constitution Is Not Without Issues",
    "title": "Purpose Behind Congressional Reading of Constitution Questioned After Amendments Are Omitted",
    "url": "http://www.foxnews.com/politics/purpose-behind-congressional-reading-of-constitution-questioned-after-amendments-are-omitted",
    "word-count": 1042,
    "date": "2011-01-06",
    "uuid": "4d1963de-dcbe-4c3e-bc73-a520ee40dcf5",
    "triplet-uuid": "a28a0329-0887-42dc-bd3d-3bb4f8926757",
    "body-paragraphs": [
        [
            "Even for a Congress known to battle over every little detail, reading the U.S. Constitution aloud sounded like a simple exercise."
        ],
        [
            "Turned out it wasn't."
        ],
        [
            "Newly sworn members of the House reading aloud the country's founding document on Thursday didn't recite every verse and article of the document because Republicans decided that the obsolete parts can be skipped since they've been superseded by amendment."
        ],
        [
            "For instance, lawmakers did not read the 18th Amendment, which imposed prohibition on liquor in 1919.",
            "However, they did read the 21st Amendment, which repealed prohibition in 1933 and is still in force."
        ],
        [
            "Republicans also left out the part about counting slaves and Native Americans as three-fifths of a person."
        ],
        [
            "Portions of the U.S. Constitution are never deleted, just amended, as has been done 27 times in history.",
            "But all the original decisions remain in the Constitution, including in the copies authorized by Congress' Joint Committee on Printing and used in Thursday's reading."
        ],
        [
            "And that was the point of contention for Democratic lawmakers who complained that exempting parts of the document from the reading undermines the objective of the exercise."
        ],
        [
            "\"This is very emotional for me,\" Rep. Jesse Jackson Jr., D-Ill., said on the floor before the reading began."
        ],
        [
            "\"Given the struggle of African Americans, given the struggle of women, given the struggle of others to create a more perfect document, to hear that those elements of the Constitution that have been dedacted (sic) by amendment are no less serious, no less part of our ongoing struggle to improve the country and our desire to continue to improve the Constitution, many of us don't want that to be lost upon the reading of our sacred document,\" he said."
        ],
        [
            "Rep. Jay Inslee, D-Wash., commented that the original document has been changed through amendment, leaving the the reader to interpret the operative language."
        ],
        [
            "\"I think it would be helpful to the members if you would explain to us how the determinations of what to read has been made or not made so that we all be on the same page as to congressional intent,\" he said to Rep. Bob Goodlatte, R-Va., who presided over the reading."
        ],
        [
            "Rep. Elijah Cummings, D-Md., questioned the reading of the \"amended\" Constitution."
        ],
        [
            "\"To not read the full document, including all the text that was later amended, is to fail to acknowledge the struggle our nation has constantly fought, within and without, to 'keep' our Republic,\" he said in a written statement."
        ],
        [
            "\"It is a failure to show Americans that while we seek a more perfect union, we do so from imperfect beginnings, through an imperfect history, with an imperfect government created by an imperfect document,\" he added.",
            "\"We fail to show the American people that imperfection is not to be feared and that our ability to constantly improve on what the Founders gave us is a blessing, not a reason for divisiveness.\""
        ],
        [
            "Other lawmakers decried the exercise altogether, saying the Constitution is a living document that shouldn't be followed to the letter."
        ],
        [
            "\"They are reading it like a sacred text,\" Rep. Jerrold Nadler, D-N.Y., the former chairman of the House Judiciary subcommittee on the Constitution, Civil Rights and Civil Liberties, told The Washington Post."
        ],
        [
            "Nadler derided what he called the \"ritualistic reading\" as \"total nonsense\" and \"propaganda\" intended to give Republicans claim to the document.",
            "He argued that the Founders were not \"demigods\" and that the document's needs for amendments to abolish slavery and other injustices showed it was \"highly imperfect.\""
        ],
        [
            "\"You are not supposed to worship your Constitution,\" he told the newspaper.",
            "\"You are supposed to govern your government by it.\""
        ],
        [
            "But for all those who described the exercise as political waste -- including Vanity Fair magazine, which estimated it as costing more than $1 million -- supporters noted that it was an historic moment -- the first time the U.S. Constitution had been read on the U.S. House floor."
        ],
        [
            "\"I think that this is a very symbolic showing to the American people and reminder to the members of congress that we are a government of laws not of men and that this Constitution is the foundation for all of our laws,\" Goodlatte said."
        ],
        [
            "And backers said that it wouldn't hurt to try to live by the aspirations of the Founding Fathers."
        ],
        [
            "\"I don't think the Constitution is propaganda.",
            "I think it's a valuable exercise and an important moment in this Congress for us to read the Constitution,\" said Rep. Steve Israel, D-N.Y.",
            "\"But I do think that you can't just read it like a speech and then leave skid marks on it in your legislative record.\""
        ],
        [
            "Historian Alan Brinkley of Columbia University told Fox News the reading may be \"a bit of theater,\" but it is \"not insignificant given that many Republicans have decided -- implausibly, in my opinion -- that the Constitution is the vehicle that can reduce the size of government.\""
        ],
        [
            "But Roger Pilon of the Cato Institute said Congress needs to re-read the Constitution to be reminded how out of control government has become."
        ],
        [
            "\"Today the Congress regulates our lives and redistributes our wealth in ways that would shock the Founders,\" he said.",
            "\"The Constitution, they wrote that to ensure limited government and they meant for most of us to live our lives free from government, in the private sector, planning and living our own lives, not as dependents on government goods and services.\""
        ],
        [
            "Pilon added that the Founders never intended for the Constitution to be viewed as fluid advice."
        ],
        [
            "\"When liberals tell today that the Constitution is essentially a blank slate to be filled by transient majorities, nothing could be further from the truth.",
            "If that were so, it would never have been ratified in the first place,\" he said."
        ],
        [
            "As the Constitution was being read inside the lower chamber, Nadler and others gathered outside the Capitol to push for passage of the Equal Rights Amendment, a perennial effort to update the document with a statement on women."
        ],
        [
            "\"John Boehner and his cronies are holding up the U.S. Constitution as a sacred, perfect document.",
            "But we know the Constitution is far from perfect because it does not guarantee women's equality,\" NOW President Terry O'Neill said in a statement."
        ]
    ]
}
