{
    "source": "hpo",
    "main-entities": ["Anthony Weiner"],
    "main-event": "Weiner Denies Sending Photo",
    "title": "Anthony Weiner Twitter Photo Scandal: Congressman Breaks His Silence",
    "url": "https://www.huffingtonpost.com/2011/06/01/anthony-weiner-twitter-photo_n_869769.html",
    "word-count": 546,
    "date": "2011-06-01",
    "uuid": "af996942-a8ed-489c-b641-c16a5f8f804b",
    "triplet-uuid": "c21cb217-3e2c-49bd-884d-5c74a165ef10",
    "body-paragraphs": [
        [
            "A day after telling reporters that he's \"not going to talk about this anymore,\" Congressman Anthony Weiner (D-N.Y.) broke his silence Wednesday about the controversy surrounding a lewd photo sent from his Twitter account."
        ],
        [
            "\"This was a circumstance where someone committed a prank on the internet,\" he told MSNBC's Luke Russert.",
            "\"I didn't send [that] picture out\" the congressman said, though he does not know who did.",
            "Is the photo of him? I can't say with certitude\" he told Russert."
        ],
        [
            "\"It was a prank,\" Weiner reiterated.",
            "\"This is not a national security matter.",
            "We're not making a federal case out of this.\""
        ],
        [
            "\"I'm not sure it rises -- no pun intended -- to that level,\" he continued."
        ],
        [
            "Weiner said he has hired a private security company to investigate how his account has been hacked."
        ],
        [
            "Last weekend, a lewd photo of a man's bulging underpants was sent to a 21-year-old female college student in Seattle from Weiner's Twitter account.",
            "It was quickly deleted, but a frenzy of coverage and comment ensued on blogs, cable news outlets and other media.",
            "Weiner's spokesman said that the congressman's Twitter account had been hacked and dismissed the episode as a prank, but this week the congressman hired a lawyer, prompting additional rumors to swirl."
        ],
        [
            "Earlier this week, the colorful and sometimes combative congressman who represents parts of Brooklyn and Queens was characteristically sharp tongued, refusing to answer reporters' questions about it, and even calling one a \"jackass\" for interrupting him.",
            "He insisted that he wanted to move on from the incident, which was distracting from his work on Capitol Hill.",
            "But there was no sign the story, or the speculation about who may have been responsible for tweeting the photo, was fading."
        ],
        [
            "Weiner failed in a 2005 bid for the Democratic nomination for mayor of New York City, but he is still is widely considered a future contender for the office."
        ],
        [
            "\"I'm not going to talk about this anymore,\" Weiner told reporters on Capitol Hill.",
            "\"I think that if I was giving a speech to 45,000 people and someone stood up and heckled in the back, I wouldn't spend three days talking to him.",
            "I'm going to get back to the conversation I care about.\""
        ],
        [
            "Weiner declined to answer reporters' questions about the photo or why he was hiring a lawyer for the case instead of having law enforcement officials pursue the matter.",
            "Weiner was a Twitter follower of the female college student who received the photo."
        ],
        [
            "The tweet of the lewd photo first was reported Saturday by BigGovernment.com, a website run by conservative commentator Andrew Breitbart."
        ],
        [
            "The site said the photo was tweeted to a female college student in Seattle.",
            "The woman told the New York Daily News that she had never met Weiner, and that there had \"never been any inappropriate exchanges\" between her and the congressman."
        ],
        [
            "Weiner, 46, is married to Huma Abedin, an aide to Secretary of State Hillary Clinton."
        ],
        [
            "The congressman over the weekend joked about the incident on Twitter, asking whether his kitchen blender would be next to \"attack\" him."
        ],
        [
            "On Tuesday as the House was preparing to vote on the nation's debt limit, Weiner was back tweeting about the vote with his usual partisan edge."
        ]
    ]
}
