{
    "source": "fox",
    "main-entities": ["Anthony Weiner"],
    "main-event": "Weiner Denies Sending Photo",
    "title": "Rep. Weiner Denies Sending Lewd Photo, Can't Say Whether Image Is Him",
    "url": "http://www.foxnews.com/politics/2011/06/01/rep-weiner-knocks-questions-lewd-photo-says-wont-distracted",
    "word-count": 710,
    "date": "2011-06-01",
    "uuid": "fe4844ec-8707-45df-aee5-6964add1c47f",
    "triplet-uuid": "c21cb217-3e2c-49bd-884d-5c74a165ef10",
    "body-paragraphs": [
        [
            "Rep. Anthony Weiner, in an interview with Fox News, said Wednesday he's certain he did not send a lewd photo of somebody's bulging underwear to a college student via Twitter.",
            "But the congressman repeatedly declined to say whether the picture was an image of him."
        ],
        [
            "The congressman, who described the incident as \"mischief,\" continued to allege that he was the victim of a computer hacker.",
            "He said he's asked an Internet security firm and a law firm to take a \"hard look\" at the incident and find out what happened, though he suggested he doesn't want to make a federal case out of it.",
            "He said somebody is just trying to distract him."
        ],
        [
            "\"I know for a fact that my account was hacked,\" Weiner told Fox News.",
            "\"I can definitively say that I did not send this.\""
        ],
        [
            "He also said he \"certainly\" does not know the college student the image was sent to -- though, when asked repeatedly, Weiner declined to say whether he was shown in the image."
        ],
        [
            "The New York Democrat, who is known for his combative style in interviews and on the House floor, granted a series of TV interviews after getting testy with reporters late Tuesday."
        ],
        [
            "At the time, he repeatedly said he would not allow the incident to distract him from his job, as he likened what he described as a \"prank\" to somebody shouting out an insult or throwing a pie during a speech."
        ],
        [
            "Asked point-blank, \"Is that picture you?\" Weiner replied, \"You know I'm not going to talk about this anymore.\""
        ],
        [
            "\"This is the tactic.",
            "The guy in the back of the room who's throwing the pie or yelling out the insult wants that to be the conversation,\" Weiner told reporters.",
            "\"But I am not going to allow this thing to dominate what I talk about.\""
        ],
        [
            "As reporters continued to ask him for several minutes whether he sent the image, the exchange became heated.",
            "At one point, Weiner referred to a reporter in the scrum as a \"jackass.\""
        ],
        [
            "Weiner referred to prior statements his office had put out, indicating he was through talking about the matter."
        ],
        [
            "Though Weiner's office had earlier responded to media inquiries, a few details appear to be keeping the story alive."
        ],
        [
            "Weiner's office initially said the congressman's account was \"obviously hacked,\" but the representative has since taken to calling the incident a \"prank\" -- he used both terms Wednesday."
        ],
        [
            "The U.S. Capitol Police so far have not opened an investigation into the matter."
        ],
        [
            "A former Justice Department computer crimes prosecutor said it would not cost much to request an investigation from the FBI.",
            "The former official said if Weiner had called the FBI when the story broke, the public would already know where the Tweet originated.",
            "Though Weiner said the incident did not constitute a federal crime, the former official said multiple federal crimes would have been committed if somebody did hack into his account -- and it could lead to years behind bars."
        ],
        [
            "Amid the controversy, a Twitter official emailed security tips to members of Congress regarding their accounts."
        ],
        [
            "\"While we won't comment on individual accounts, news reports of the past few days are a good reminder of the importance of actively protecting your account credentials,\" Twitter's Adam Sharp wrote."
        ],
        [
            "He urged offices to use a \"strong password\" of at least 10 characters including numbers and symbols, be on the lookout for \"suspicious links,\" and refrain from giving out passwords to \"untrusted third-parties.\""
        ],
        [
            "The photo in question showed a close-up shot of a man's bulging underwear.",
            "It was deleted within minutes of being sent.",
            "Breitbart's BigGovernment.com first reported that it was tweeted to a Seattle woman, later identified as Gennette Cordova."
        ],
        [
            "Cordova is just one of 198 people that Weiner follows on Twitter, though he has nearly 50,000 followers.",
            "Porn star Ginger Lee tweeted last month that she received a direct message from Weiner, and several other attractive women say they've been surprised to get a \"follow\" or a message from the prominent Democrat.",
            "Those claims are all circumstantial, but it doesn't help his case should there ever actually be one."
        ],
        [
            "Weiner, 46, is married to Huma Abedin, an aide to Secretary of State Hillary Clinton."
        ]
    ]
}
