{
    "source": "nyt",
    "main-entities": ["Anthony Weiner"],
    "main-event": "Weiner Denies Sending Photo",
    "title": "Weiner Denies Sending Photo but Is Less Sure About Its Origin",
    "url": "http://www.nytimes.com/2011/06/02/nyregion/weiner-denies-sending-photo-over-twitter-but-is-less-sure-of-its-origin.html?hp&_r=0",
    "word-count": 699,
    "date": "2011-06-01",
    "uuid": "4ed618f7-7991-4588-aba4-eb4f8da647c0",
    "triplet-uuid": "c21cb217-3e2c-49bd-884d-5c74a165ef10",
    "body-paragraphs": [
        [
            "WASHINGTON — Representative Anthony D. Weiner, trying to put to rest a bizarre episode that is overshadowing his role as liberal pugilist and threatening his dream of becoming New York’s mayor, emphatically denied on Wednesday that he had sent a suggestive photograph to a woman in Washington State but said he could not be sure that he is not the person in the image."
        ],
        [
            "“This was essentially a hacked account that had a gag photo sent out on it,” Mr. Weiner, a Democrat, said during an interview in his office here.",
            "“I can’t say with certainty very much about where the photograph came from.”"
        ],
        [
            "On Tuesday, Mr. Weiner presided over two testy news briefings at which he had dodged a variety of questions.",
            "On Wednesday, he adopted a strikingly different approach, sitting patiently for a series of interviews at which he insisted he had done nothing wrong and marveled at what he said on MSNBC was the “Alice in Wonderland world” in which a wayward Twitter message had become the talk of the town."
        ],
        [
            "Mr. Weiner, one of Congress’s most enthusiastic users of social media to engage with constituents and supporters, said he believed his Twitter account, or a related photo-sharing site, had been infiltrated by a hacker or a prankster, who had then sent the offending photo out late Friday."
        ],
        [
            "He said that he had hired an Internet security company and a lawyer to look into the matter, but that he did not believe the episode merited investigation by federal law enforcement.",
            "He did not rule out the possibility that the photo was of him, but said he did not know who could have sent it."
        ],
        [
            "He said he did not know the woman who received the photo, Gennette Cordova, a student at Whatcom Community College in Bellingham, Wash.; she followed him on Twitter.",
            "He said he regretted that Ms. Cordova was caught in the middle of the controversy.",
            "She issued a statement over the weekend saying she had never met him, and she has not spoken out since."
        ],
        [
            "“I just feel terrible for her,” Mr. Weiner said, adding that he had never corresponded with her.",
            "“She has committed no crime except to follow me on Twitter.”"
        ],
        [
            "The congressman also expressed concern about the toll the episode was taking on his wife, Huma Abedin, a longtime aide to Secretary of State Hillary Rodham Clinton.",
            "“I’m protecting my wife, who every day is waking up to these insane stories that are getting so far from reality,” he told CNN.",
            "“You know, we’ve been married less than a year.”"
        ],
        [
            "Asked on CNN whether he still wished to be mayor, he said, “Put it this way: It’s the only better job than the one I have.”"
        ],
        [
            "Jack Levin, the chief executive of yFrog, the Twitter-affiliated image and video service that was used to upload the photo, said in an interview on Wednesday that his company did not have reason to believe that its user passwords were exposed or stolen.",
            "He said it was possible that the photo could have been sent from Mr. Weiner’s yFrog account through his Twitter password or through a yFrog password."
        ],
        [
            "Mr. Levin said neither Mr. Weiner’s office nor any law enforcement authorities had contacted him or his company to inquire about the photo."
        ],
        [
            "Twitter, which does not comment on individual user accounts for privacy reasons, has declined to say whether Mr. Weiner’s account was hacked."
        ],
        [
            "Despite the swirl of events that has buffeted him for several days, Mr. Weiner has not abandoned his sharp humor.",
            "Suggesting that the photo might have been altered, he alluded to a “Daily Show” sketch on Tuesday in which the comedian Jon Stewart, a longtime friend, had joked that the photo could not have been of the congressman."
        ],
        [
            "“I don’t have memory of this photograph,” Mr. Weiner said in the interview in his office.",
            "“But I also ... you know, Jon Stewart might have had it right last night: that there were elements of this photograph that might have been doctored.”"
        ],
        [
            "He paused, then added: “But I don’t know that.",
            "And I don’t want that to be the headline.”"
        ]
    ]
}
