{
    "uuid": "cdaba747-9514-4a92-b1a9-262da1be54ab",
    "main-event": "Trump continues government shutdown for border wall",
    "main-entities": [
        "Donald Trump"
    ],
    "title": "Trump warns shutdown could last 'years,' says he may declare 'national emergency' to build border wall",
    "triplet-uuid": "0d10341a-9dba-4374-a524-814c300d1611",
    "body-paragraphs": [
        [
            "President Trump stood firm Friday on his demands for a border wall after the second White House meeting with congressional leaders this week broke up with no apparent deal, warning Democrats the partial government shutdown could last \"years\" and saying he could even declare a \"national emergency\" to bypass Congress if necessary."
        ],
        [
            "“We can call a national emergency [to build a border wall] because of the security of our country,” Trump told reporters in the Rose Garden, during a lengthy and impromptu press conference."
        ],
        [
            "“I may do it,” he said, before adding, “If we can do it through a negotiated process, we’re giving it a shot.”"
        ],
        [
            "The press conference underscored how far apart both sides are, even as Trump called the meeting \"productive\" and suggested the standoff could end soon -- or not. ",
            "He indicated he was not shifting on his demand for more than $5 billion for funding for a wall on the southern border, saying it was necessary as the border is a \"dangerous, horrible disaster.\""
        ],
        [
            "\"This is national security we’re talking about, we’re not talking about games,\" he told reporters. ",
            "“We're not playing games, we have to do it.\""
        ],
        [
            "Despite Trump saying conversations had \"come a long way,\" Democrats were more dour in their assessment. ",
            "Senate Minority Leader Chuck Schumer exited saying Trump told them \"he’d keep the government closed for a very long period of time, months or even years.”"
        ],
        [
            "Trump later confirmed in the Rose Garden, \"Absolutely I said that,\" while clarifying he hopes the partial shutdown doesn't last more than a few more days. ",
            "He said it could be opened \"very quickly\" if they come to an agreement on the wall. ",
            "He offered some flexibility only on what the wall would be made of, saying it could be concrete or steel."
        ],
        [
            "\"Steel is more expensive than the concrete, but I feel like we’re talking about steel because the other side feels better about it,\" he said."
        ],
        [
            "Yet House Speaker Nancy Pelosi said the Democrats' view is that they cannot resolve the funding dispute until the government fully opens. ",
            "She said there had been progress only in the sense of a \"better understanding\" of each other."
        ],
        [
            "Looking for an elusive resolution, Senate Majority Leader Mitch McConnell, R-Ky., said Trump agreed to designate staff to engage in negotiations with congressional leadership aides this weekend. ",
            "Trump later said the group would \"determine what we're going to do about the border.\" ",
            "That group would include Vice President Pence and advisor Jared Kushner."
        ],
        [
            "The meeting came on the 14th day of the shutdown, which was triggered by disagreements over the funding of Trump’s promised wall, after Democrats formally took control of the House of Representatives. ",
            "Trump has said that $5 billion in funding for the wall is non-negotiable, while Democrats have said they will fund more general border security -- but not the wall."
        ],
        [
            "Trump met with Democratic and Republican leaders of both chambers. ",
            "Ahead of the meeting Trump sent a letter to members of Congress congratulating Pelosi on her election as speaker and calling on Congress to re-open the government."
        ],
        [
            "“As we begin this new Congress, our first task should be to reopen the Government and to deliver on our highest duty as elected officials: the security of the Nation and its borders,\" he said. ",
            "“It is the sovereign right of every nation to establish an immigration program in its national interest—lawfully admitting those who have followed the rules, while denying entry to those who break the rules or fail to meet the requirements established in law.\""
        ],
        [
            "As part of his strategy, he made available to every member a presentation on border security that he said those present at a meeting Wednesday did not want to hear."
        ],
        [
            "“Americans have endured decades of broken promises on illegal immigration. ",
            "Now, is the time for both parties to rise above the partisan discord, to set aside political convenience, and to put the national interest first,” he wrote."
        ],
        [
            "Democrats, meanwhile, passed legislation in the House that would fund the whole government, but not the wall.  ",
            "Pelosi accused Republicans of holding government workers hostage for the separate demand of a wall."
        ],
        [
            "\"The wall and the government shutdown really have nothing to do with each other,\" Pelosi said at an MSNBC Town Hall."
        ],
        [
            "\"There is no reason to have workers pay a price with their paycheck,\" she said"
        ],
        [
            "The legislation was immediately dismissed by Republican leadership. ",
            "McConnell, R-Ky., called the bills “a time-wasting act of political posturing” and said that “a resolution will have to be palatable to House Democrats and Senate Republicans alike.”"
        ],
        [
            "“We need to make policy rather than simply making political theatre,” he told reporters."
        ],
        [
            "White House Press Secretary Sarah Sanders said on \"Fox & Friends\" earlier Friday that it would be up to Pelosi to get her party behind her, including the left flank pushing for impeachment."
        ],
        [
            "“We think we're hopeful because the people that elected Nancy Pelosi didn't elect her to come up here and do nothing and didn't elect her to play political games,” she said. ",
            "“They elected her to find real solutions and actually work with the president and work with all members of Congress to get things done.”"
        ],
        [
            "On Thursday night, Pence said on Fox News' “Tucker Carlson Tonight” that the terms of the negotiations were clear: \"Bottom line, if there's no wall, there's no deal.\""
        ]
    ],
    "source": "fox",
    "url": "https://www.foxnews.com/politics/congressional-leaders-meet-at-white-house-as-shutdown-stances-harden",
    "date": "2019-01-04"
}
