{
    "uuid": "55477e16-1726-4ded-b815-ecb8aa8f9952",
    "main-event": "Trump and Democrats Dig In After Talks to Reopen Government Go Nowhere",
    "main-entities": [
        "Donald Trump", 
        "Democratic Lawmakers"
    ],
    "title": "Trump says he could keep shutdown going for months or years",
    "triplet-uuid": "0d10341a-9dba-4374-a524-814c300d1611",
    "body-paragraphs": [
        [
            "WASHINGTON — President Trump and Democratic congressional leaders dug in Wednesday for a lengthy partial shutdown in a newly divided government after a White House meeting — the first in 22 days — could not break an impasse over Mr. Trump’s demands for billions of dollars for a border wall."
        ],
        [
            "During the contentious meeting in the Situation Room, Mr. Trump made his case for a wall on the southwestern border and rejected Democrats’ proposals for reopening the government while the two sides ironed out their differences."
        ],
        [
            "“I would look foolish if I did that,” Mr. Trump responded after Senator Chuck Schumer of New York, the Democratic leader, posed the question to him directly, according to three officials familiar with the meeting who described it on the condition of anonymity.",
            "He said that the wall was why he was elected, one of the officials said."
        ],
        [
            "Democrats were equally adamant, according to another official who was present for the discussion.",
            "Pressed by Vice President Mike Pence and Representative Kevin McCarthy of California, the incoming minority leader, they refused to budge from their offer to devote $1.3 billion to border security.",
            "The official also insisted on anonymity to describe the private conversation."
        ],
        [
            "Senator Mitch McConnell of Kentucky, the majority leader, said after the meeting that he had no intention of putting Democratic bills to reopen the government to a vote if Mr. Trump would not sign them."
        ],
        [
            "“We’re hopeful that, somehow, in the coming days and weeks, we’ll be able to reach an agreement,” Mr. McConnell told reporters at the Capitol, offering an ominous timeline."
        ],
        [
            "The events underscored the personal and political crosscurrents standing in the way of any compromise between a president unwilling to lose face with his core supporters on his signature campaign promise and newly empowered Democrats — poised to assume control of the House on Thursday — who refuse to give ground on an issue that has come to symbolize Mr. Trump’s immigration policies."
        ],
        [
            "With the partial government funding lapse dragging into its 12th day and affecting 800,000 federal employees, the confrontation in the Situation Room only served to highlight the depth of the divide."
        ],
        [
            "“Could be a long time, or it could be quickly,” Mr. Trump said of resolving the shutdown.",
            "“It’s too important a subject to walk away from.”"
        ],
        [
            "Representative Nancy Pelosi of California, who is in line to be elected speaker on Thursday, said: “We are asking the president to open up government. Why would he not do it?”"
        ],
        [
            "“He could not give a good answer,” Mr. Schumer said."
        ],
        [
            "Mr. Trump tried creative ways to persuade the Democrats that they should support his wall.",
            "At one point, he said Ms. Pelosi should back it because she was “a good Catholic” and Vatican City is surrounded by a wall, according to one of the officials familiar with the discussion."
        ],
        [
            "In her first legislative act as speaker, Ms. Pelosi plans on Thursday to bring up two bills to reopen the government.",
            "One would fund the Department of Homeland Security through Feb. 8, providing a month to break the impasse over border security funding, and a second would provide money for the remaining shuttered agencies and departments through September.",
            "The homeland security measure would devote $1.3 billion to border security measures, such as enhanced surveillance and fortified fencing, but not the wall."
        ],
        [
            "Mr. Trump’s rejection of those measures left the prospects of a resolution at their dimmest since the shutdown began on Dec. 22.",
            "It also highlighted the difficulty of the current situation, in which Democrats, Republicans and even some White House staff members have found themselves trying to anticipate what Mr. Trump will accept."
        ],
        [
            "The president asked the congressional leaders to return to the White House on Friday to continue the talks, after Democrats had completed their leadership elections, according to an official who attended the meeting.",
            "A second official who attended said Mr. Trump’s team believed it would be easier for Ms. Pelosi to negotiate once she was officially installed as speaker.",
            "Both insisted on anonymity to describe the private gathering."
        ],
        [
            "In a pair of evening tweets, Mr. Trump seemed to hold out hope of an agreement, writing: “I remain ready and willing to work with Democrats to pass a bill that secures our borders, supports the agents and officers on the ground, and keeps America Safe.",
            "Let’s get it done!”"
        ],
        [
            "But the path to such a deal is murky at best."
        ],
        [
            "Before he met congressional leaders on Wednesday, Mr. Trump publicly rejected a compromise that Mr. Pence floated privately with Democrats last month to stave off the government funding lapse, saying $2.5 billion in border security spending was insufficient.",
            "In the hours before a midnight deadline to avert a shutdown before Christmas, the vice president had broached that number, which his team has quietly continued to push in the days after parts of the government ran out of money."
        ],
        [
            "“No, not $2.5 billion, no — we’re asking for $5.6” billion, Mr. Trump said during a cabinet meeting, hours before the Situation Room briefing."
        ],
        [
            "His rejection of the figure seemed to confirm the concerns of Democratic leaders who had questioned whether they could trust senior White House officials to broker any compromise that could then be rejected by a president who has often shifted his position at the last moment, especially when it comes to immigration."
        ],
        [
            "The larger figure referred to the amount Mr. Trump has demanded for the wall, which the House endorsed in a vote last month, but which failed to garner even majority support in the Senate, where it would need 60 votes to prevail."
        ],
        [
            "But inside the Situation Room later on Wednesday, the proposal resurfaced and Mr. Trump appeared open to it, according to one of the officials present, as Mr. Pence and Mr. McCarthy pressed Democrats to meet in the middle.",
            "Ms. Pelosi and Mr. Schumer said $1.3 billion was their highest bid."
        ],
        [
            "Wednesday’s gathering in the Situation Room, a secure chamber in the basement of the White House where military operations are tracked and other sensitive discussions unfold, was a conscious effort by Mr. Trump and his aides to infuse a sense of national-security crisis into the immigration discussion.",
            "It was the president’s first face-to-face meeting with Democratic leaders since a combative session last month when he said he would insist that any government spending bill include money for a border wall — and would proudly own the consequences if that meant a shutdown."
        ],
        [
            "But it quickly turned tense as Mr. Trump argued for his wall and called on Kirstjen Nielsen, the homeland security secretary, who appeared via teleconference from the border in San Diego to stress the need for it, according to two of the officials who were at the meeting."
        ],
        [
            "Mr. Schumer interjected, calling on Ms. Pelosi, who disputed Ms. Nielsen’s statistics, two of the officials said.",
            "Ms. Pelosi then laid out the legislative proposals she planned to bring up on Thursday, detailing how the spending measures had all received broad bipartisan support either in committees or on the floor in the Republican-controlled Congress."
        ],
        [
            "The back and forth drew an angry response from the Department of Homeland Security."
        ],
        [
            "“Democrats in the room either don’t care that there is a humanitarian crisis on the border or just prefer ignorance,” Katie Waldman, a spokeswoman for the department, said in a statement on Wednesday night.",
            "“It was incredibly disheartening that they don’t want to know the facts when making policy.”"
        ],
        [
            "Yet hours before the meeting began, what was billed as a somber security briefing had already taken on the sharp tone of a political showdown, as Mr. Trump charged that Democrats were sacrificing border security for a partisan advantage in the 2020 elections."
        ],
        [
            "“The United States needs a physical barrier,” the president said during the cabinet meeting, comparing the southern border to “a sieve” that allows criminals and drugs to enter the country and facilitates human trafficking."
        ],
        [
            "“Walls work,” he added, claiming inaccurately that former President Barack Obama has one “around his compound” in Washington.",
            "(Parts of Mr. Obama’s home in the northwest section of the city are bordered by a low brick retaining wall, and others have iron or chain-link fencing.)"
        ],
        [
            "Mr. Trump repeated his false claims about the border wall, including that Mexico was already paying for it, as he promised during his campaign, and that much of its construction had already been completed."
        ],
        [
            "Outside the White House, the search for a way out is getting more urgent.",
            "Some lawmakers have grown anxious about the shutdown’s impact on their constituents, including federal workers who are not receiving pay while their agencies are denied funding."
        ],
        [
            "Senator Lamar Alexander, Republican of Tennessee, wrote an opinion article in The Washington Post suggesting three ways out: Grant the president the $1.6 billion for border security that he requested, without wall funding, plus an additional $1 billion for security at ports of entry; approve a bipartisan bill linking wall funding with protection for young immigrants brought illegally to the country as children; or resurrect the 2013 comprehensive immigration overhaul that included huge increases in border security measures, sweeping changes to immigration law and a pathway to citizenship for the nation’s 11 million undocumented immigrants."
        ],
        [
            "Incoming lawmakers vented new concerns about the shutdown’s effect.",
            "“This morning I requested that my pay be withheld until the shutdown is over,” Representative-elect Mikie Sherrill, Democrat of New Jersey, said Wednesday on Twitter, where she posted a letter to the chief administrative officer of the House making her request official."
        ],
        [
            "She noted that thousands of federal workers in her state were not receiving paychecks.",
            "“I came here to govern, not engage in partisan politics at the expense of hardworking Americans,” she said."
        ]
    ],
    "source": "nyt",
    "url": "https://www.nytimes.com/2019/01/02/us/politics/trump-congress-shutdown.html",
    "date": "2019-01-02"
}
