{
    "uuid": "ddf67ae7-db39-4c44-a3ee-35a9220aa485",
    "main-event": "Donald Trump announces end to government shutdown",
    "main-entities": [
        "Donald Trump"
    ],
    "title": "Trump Signs Bill Reopening Government for 3 Weeks in Surprise Retreat From Wall",
    "triplet-uuid": "1e41e98b-9ac1-441d-b2c2-19d8f730c74a",
    "body-paragraphs": [
        [
            "WASHINGTON — President Trump agreed on Friday to reopen the federal government for three weeks while negotiations continued over how to secure the nation’s southwestern border, backing down after a monthlong standoff failed to force Democrats to give him billions of dollars for his long-promised wall."
        ],
        [
            "The president’s concession paved the way for the House and the Senate to both pass a stopgap spending bill by voice vote.",
            "Mr. Trump signed it on Friday night, restoring normal operations at a series of federal agencies until Feb. 15 and opening the way to paying the 800,000 federal workers who have been furloughed or forced to work without pay for 35 days."
        ],
        [
            "The plan includes none of the money for the wall that Mr. Trump had demanded and was essentially the same approach that he rejected at the end of December and that Democrats have advocated since, meaning he won nothing concrete during the impasse."
        ],
        [
            "Mr. Trump presented the agreement with congressional leaders as a victory anyway, and indicated in a speech in the Rose Garden that his cease-fire may only be temporary: If Republicans and Democrats cannot reach agreement on wall money by the February deadline, he said that he was ready to renew the confrontation or declare a national emergency to bypass Congress altogether."
        ],
        [
            "“We really have no choice but to build a powerful wall or steel barrier,” Mr. Trump said.",
            "“If we don’t get a fair deal from Congress, the government will either shut down on Feb. 15, or I will use the powers afforded to me under the laws and Constitution of the United States to address this emergency.”"
        ],
        [
            "But Mr. Trump has already adopted some of the language that his Democratic adversaries have used during the longest shutdown in history.",
            "He conceded that “we do not need 2,000 miles of concrete wall from sea to shining sea — we never did” and invoked the utility of “smart walls” that substitute some physical barriers for drones and other sensors.",
            "The semantic evolution provides both the president and Democrats with a face-saving way forward if they want it."
        ],
        [
            "The surprise announcement was a remarkable surrender for a president who made the wall his nonnegotiable condition for reopening the government and a centerpiece of his political platform.",
            "Some immigration hard-liners that make up a key part of his political base were incensed by the capitulation."
        ],
        [
            "“Good news for George Herbert Walker Bush: As of today, he is no longer the biggest wimp ever to serve as President of the United States,” the commentator Ann Coulter, who has aggressively pushed Mr. Trump to keep his campaign promise on the wall, wrote on Twitter."
        ],
        [
            "On Capitol Hill, though, jittery lawmakers from both parties greeted the news with relief.",
            "Mr. Trump relented as the effects of the shutdown were rippling with ever greater force across the economy, with fallout far beyond paychecks.",
            "On Friday, air traffic controllers calling in sick slowed air traffic across the Northeast; hundreds of workers at the Internal Revenue Service also did not show up; and the F.B.I. director said he was as angry as he had ever been over his agents not being paid."
        ],
        [
            "“None of us are willing to go through this again,” said Senator Lisa Murkowski of Alaska, referring to a half-dozen Republicans who voted on Thursday for a Democratic measure to reopen the government for two weeks.",
            "“And it’s not just a few of us. There are a great many in our conference that feel pretty strongly.”"
        ],
        [
            "Democrats, who declined to revel in their clear victory, said they would work in good faith to strike a deal on border security.",
            "They have raised their offer on border security funding considerably and toughened their rhetoric on stopping illegal immigration."
        ],
        [
            "But Speaker Nancy Pelosi stated plainly that any compromise would not include money for a new border wall, which Democrats view as ineffective and overly costly even though many have supported border fencing in the past."
        ],
        [
            "“Have I not been clear on a wall?” Ms. Pelosi said at a news conference with Senator Chuck Schumer of New York, the Democratic leader.",
            "The two have repeatedly said they would support allocating additional money for technology and increased patrols along the border, like the ones Mr. Trump referenced on Friday."
        ],
        [
            "The cease-fire should pave the way for Mr. Trump to deliver his State of the Union address to Congress after all, but Ms. Pelosi said it would not be held this Tuesday, as originally scheduled.",
            "She had rescinded her invitation this week to come to the House chamber until the government was reopened, and on Friday, she said she would work with Mr. Trump to find a new date."
        ],
        [
            "“The State of the Union is not planned now,” Ms. Pelosi said.",
            "“When government is open we will discuss a mutually agreeable date.”"
        ],
        [
            "As he announced the deal, Mr. Trump paid tribute to the federal workers who have endured five weeks without pay, expressing sympathy for them in a way he had not until now.",
            "“You are fantastic people,” he said."
        ],
        [
            "He promised to ensure that workers would be compensated for the paychecks they have missed since the shutdown began in late December “very quickly or as soon as possible.”",
            "To that effect, the Office of Management and Budget circulated a letter to affected agencies and departments on Friday afternoon instructing management to prepare for an “orderly reopening” and to prioritize pay and benefits for workers."
        ],
        [
            "But other costs will be more permanent.",
            "Many federal contractors do not expect to be repaid for their work during the shutdown.",
            "Its compounding effects will ultimately cost the federal government more money than if it was open.",
            "And though the long-term economic damage caused by the shutdown remains to be seen, it appears that at the very least the short-term pain was more costly than a down payment on the border wall."
        ],
        [
            "According to an analysis from Standard & Poor’s, the ratings agency, the United States economy lost at least $6 billion in the five weeks the government was partly shuttered — more than the $5.7 billion that Mr. Trump had requested to build a steel or concrete barrier at the border."
        ],
        [
            "Mr. Trump offered no explanation for his surrender, nor did he acknowledge that it was one.",
            "On Twitter on Friday night, he said: “This was in no way a concession.",
            "It was taking care of millions of people who were getting badly hurt by the Shutdown with the understanding that in 21 days, if no deal is done, it’s off to the races!”"
        ],
        [
            "During the president’s speech earlier in the day, cabinet officials and White House aides lined the sides of the Rose Garden and applauded him.",
            "Mr. Trump began his remarks as if he had actually emerged victorious, saying that he was “very proud to announce” what he called “a deal to end the shutdown and reopen the federal government.”"
        ],
        [
            "Few lawmakers even in the president’s own party saw it that way."
        ],
        [
            "“I hail from a state that is very supportive of the president and border security with barriers, so that is a consideration for me, but there are a lot of other strategies we could employ that would work better” than a shutdown, said Senator Shelley Moore Capito, Republican of West Virginia."
        ],
        [
            "With polls showing the president enduring most of the blame by the public, Republicans led by Senator Mitch McConnell of Kentucky, the majority leader, pressured Mr. Trump to agree to the temporary truce.",
            "Over the next three weeks, a House-Senate conference committee representing both parties will negotiate a border security plan, but if it fails to reach a consensus, government agencies could close again."
        ],
        [
            "The president’s concession came a day after two competing measures to reopen the government failed on the Senate floor.",
            "A Democratic bill, which would have reopened the government with no strings attached, received more votes than the bill backed by Mr. Trump, which included temporary protections for some undocumented immigrants in exchange for $5.7 billion for his proposed border wall."
        ],
        [
            "Mr. McConnell and Mr. Schumer huddled on Thursday night after the failed votes to discuss a path forward.",
            "Mr. Schumer rejected the idea of offering a down payment for the wall to reopen the government and pitched Mr. McConnell on what ultimately became the agreement with Mr. Trump, according to a senior Democratic aide."
        ],
        [
            "Mr. McConnell, who viewed the shutdown as unnecessary from the start, found Mr. Trump eager to end the impasse, and in a series of calls, they ironed out the details.",
            "To the Republican leader, it was a way to ease much of the pressure on federal workers and get the Senate back to work."
        ],
        [
            "As late as early Friday morning, Mr. Trump appeared intent on declaring a national emergency at the border alongside the agreement to reopen the government, but Mr. McConnell and White House officials encouraged him to drop the idea, according to people familiar with the discussions who were not authorized to discuss them."
        ],
        [
            "Republican leaders tried to rally their members during a closed policy luncheon before Thursday’s votes.",
            "But even as Republicans prepared to support Mr. Trump’s plan, the signs of mounting frustration after weeks of inaction were evident."
        ],
        [
            "Republican senators rose one by one to voice concerns about the effect on federal workers and the lack of forward momentum in an impasse that felt unbearable.",
            "They swore they would never stand by another government shutdown."
        ],
        [
            "“We’ve already lost,” lamented Senator Johnny Isakson, Republican of Georgia, according to people familiar with the remarks.",
            "“It’s a matter of the extent we want to keep losing.”"
        ],
        [
            "At another point, during an exchange first reported by The Washington Post, Senator Ron Johnson, Republican of Wisconsin, vented at Mr. McConnell for putting Republicans in the position of having to vote on two competing approaches to reopen the government — one Republican and one Democratic — without consulting them first."
        ],
        [
            "“You put us in this position,” Mr. Johnson said, according to one of his aides."
        ],
        [
            "Mr. McConnell, who had largely been absent from negotiations to reopen the government until late last week, responded, “Are you suggesting I’m enjoying this?”"
        ]
    ],
    "source": "nyt",
    "url": "https://www.nytimes.com/2019/01/25/us/politics/trump-shutdown-deal.html",
    "date": "2019-01-25"
}
