{
    "source": "hpo",
    "main-entities": ["House Democrats","House Republicans"],
    "main-event": "Democrats pass campaign finance and voting rights reform bill",
    "title": "House Democrats Pass Landmark Campaign Finance And Voting Rights Reform Bill",
    "url": "https://www.huffpost.com/entry/house-democrats-for-the-people-act_n_5c81d1dae4b0d936162633bf",
    "word-count": 646,
    "date": "2019-03-08",
    "uuid": "7acc7281-bc7e-4792-b692-0d4d8dfebc63",
    "triplet-uuid": "2f3e86b6-8443-47bd-9cd3-491c90a59fe9",
    "body-paragraphs": [
        [
            "Democrats’ landmark campaign finance, voting rights and ethics reform bill passed the House of Representatives on Friday."
        ],
        [
            "The For The People Act, which passed 234-193, was Democrats’ top priority upon winning control of the House in the 2018 elections.",
            "It would dramatically expand voting access, create publicly funded House elections, enhance the transparency of money in politics, restore voting rights to millions of ex-felons, strengthen executive branch ethics law and end partisan gerrymandering."
        ],
        [
            "“This is a historic day, a pivotal day, a day that will make a difference,” House Speaker Nancy Pelosi (D-Calif.) said."
        ],
        [
            "The bill aims to answer rising attacks on voting rights from courts and politicians across the country, and also to stem the increasing inequality of campaign funding by empowering small donors with matching contributions from public funds, among many other things."
        ],
        [
            "The For The People Act “takes power from the elites, special interests and the 1 percent and gives it to the American people,” Rep. Zoe Lofgren (D-Calif.) said."
        ],
        [
            "“This vote is an opportunity to be on the right side of history,” Rep. John Lewis (D-Ga.) said.",
            "“If not us, then who? If not now, then when?”"
        ],
        [
            "House passage of the legislation is the result of a long collaborative process by the Democratic Party to prioritize campaign finance and voting rights reforms.",
            "The party’s Democracy Reform Task Force, endorsed by Pelosi and led by Rep. John Sarbanes (D-Md.), worked with lawmakers both old and new to bring together legislative ideas and craft them into a coherent package."
        ],
        [
            "Much of this work was begun while Democrats languished in the House minority.",
            "As a possible victory in the 2018 elections loomed, they made it clear that the reforms would be their No. 1 priority.",
            "This mission was driven not just by party leaders, but also by the candidates who would ultimately deliver Democrats their first majority in the House in eight years."
        ],
        [
            "One-hundred candidates, including those who won their 2018 races, signed a letter to Pelosi and other congressional leaders demanding the reforms be the first order of business.",
            "Many cited the endemic corruption of money in politics as a top complaint they heard on the campaign trail from constituents."
        ],
        [
            "The vote broke down on party lines, with Republicans in hardened opposition.",
            "During multiple committee hearings and floor debate, GOP representatives castigated the bill as a federal power grab designed to help Democrats win elections by allowing increased voting access and nonpartisan gerrymandering.",
            "They said the campaign finance disclosures and the public funding of elections assaulted free speech rights, the ethics laws were too broad and unnecessary, and the creation of a federal election day holiday was an unnecessary benefit for lazy workers."
        ],
        [
            "The Senate will not take up the bill, according to Majority Leader Mitch McConnell (R-Ky.)."
        ],
        [
            "McConnell is perhaps the nation’s biggest opponent of campaign finance reforms, and the Republican Party has enacted measures across the country in the last decade to restrict voter access.",
            "Those restrictions would be overturned by the For The People Act."
        ],
        [
            "Still, Sen. Tom Udall (D-N.M.) announced the outlines of a Senate companion bill on Wednesday.",
            "President Donald Trump has been advised to veto the legislation if it reaches his desk."
        ],
        [
            "Democrats believe that the reform package is popular and plan to vote on individual pieces of it to keep the issues of corruption and voting rights front and center.",
            "They are already pursuing a reauthorization of the Voting Rights Act in a separate bill.",
            "And Senate Minority Leader Chuck Schumer (D-N.Y.) said on Thursday that he would like to mandate automatic voter registration across the country."
        ],
        [
            "The House bill “is just the first step in our efforts to change politics in this country ― to change politics in this town,” freshman Rep. Max Rose (D-N.Y.) said on Thursday ahead of the vote."
        ],
        [
            "“This is a fight that will not end until we win it,” Pelosi said."
        ]
    ]
}
