{
    "uuid": "ca081b60-a731-44ac-9253-4be6576567c1",
    "main-event": "Lawmakers react to Trump's immigration proposal",
    "main-entities": [
        "Donald Trump",
        "Democratic lawmakers",
        "Republican lawmakers"
    ],
    "title": "Trump’s immigration offer brings sharp reactions from Dems and GOP",
    "triplet-uuid": "70c75d68-bf65-46a6-a822-15c23d77a275",
    "body-paragraphs": [
        [
            "President Trump’s immigration compromise package to end the partial government shutdown drew sharp reactions from Democratic and Republican lawmakers alike."
        ],
        [
            "In a televised White House address on Saturday afternoon, Trump offered Democrats a three-year extension of protections for 700,000 Deferred Action for Childhood Arrivals (DACA) recipients, in exchange for the $5.7 billion he has been seeking for a barrier along the nation's southern border with Mexico."
        ],
        [
            "“Our immigration system should be a source of pride ... not a source of shame as it is all over the world,” Trump said in his plea."
        ],
        [
            "The president’s proposal was met with disdain from an array of top Democratic lawmakers.",
            "Many used the same language in their critiques, accusing Trump of holding the government and federal workers \"hostage.\""
        ],
        [
            "House Speaker Nancy Pelosi, D-Calif., tweeted, “What we didn’t hear from the President was any sympathy for the federal workers who face so much uncertainty because of the chaos of the #TrumpShutdown.”"
        ],
        [
            "Before Trump made his announcement, Pelosi had called his anticipated proposal “a non-starter.”"
        ],
        [
            "“For one thing, this proposal does not include the permanent solution for the Dreamers and TPS recipients that our country needs and supports.”"
        ],
        [
            "For his part, Chuck Schumer, the Senate minority leader, called Trump's proposal \"one-sided and ineffective.\""
        ],
        [
            "\"It's clear the President realizes that by closing the government and hurting so many American workers and their families, he has put himself and the country in an untenable position.",
            "Unfortunately, he keeps putting forward one-sided and ineffective remedies.",
            "There's only one way out: open the government, Mr. President, and then Democrats and Republicans can have a civil discussion and come up with bipartisan solutions.\""
        ],
        [
            "Schumer, D-N.Y., concluded, \"It was the President who single-handedly took away DACA and TPS protections in the first place – offering some protections back in exchange for the wall is not a compromise but more hostage taking.\""
        ],
        [
            "House Majority Leader Steny Hoyer shared a similar sentiment, urging Trump and Sen. Mitch McConnell to \"stop holding government hostage and end the shutdown\" immediately."
        ],
        [
            "“The president must stop holding government hostage and end the shutdown so federal employees can get back to work serving the American people.",
            "There is no reason for Americans to be shut out of work and without a paycheck while negotiations take place on the best way to secure our borders,” he said."
        ],
        [
            "Hoyer said negotiation can progress after the government reopens."
        ],
        [
            "“With the government open, we can negotiate an agreement to strengthen border security that both sides can support and that is in the best interests of the American people.”"
        ],
        [
            "Another leading Dem, Sen. Kristen Gillibrand of New York, who announced her White House bid on Jan. 15 in an episode of \"The Late Show with Stephen Colbert,\" said Trump's offer was a \"bad deal.\""
        ],
        [
            "Gillibrand tweeted: \"Trump ordered the end of DACA and TPS.",
            "Then he shut down the government.",
            "Now he's holding federal workers hostage, saying he'll temporarily give back what he took away -- only if we give him a pointless, ineffective wall he falsely promised Mexico would pay for.",
            "This is a bad deal.\""
        ],
        [
            "Then there was New Jersey Sen. Bob Menendez's response. He bluntly accused Trump of forcing \"a pointless shutdown\" to pay for the border wall."
        ],
        [
            "\"This is about more than 800,000 Americans who are being held hostage by a President who has forced a pointless shutdown to pay for an expensive, ineffective wall.",
            "This is not about immigration.",
            "Dreamers and TPS recipients are not bargaining chips.",
            "It's unacceptable that after taking away DACA protections, eliminating the TPS program for thousands of immigrants and creating a humanitarian crisis at the border, President Trump is offering temporary solutions in exchange for a permanent wall.\""
        ],
        [
            "The Democratic senator also said \"a legitimate negotiation\" can proceed after the government is reopened."
        ],
        [
            "Fellow Democratic Sen. Chris Coons of Delaware slammed McConnell for refusing \"to meaningfully negotiate with Senate Democrats,\" but also called Trump's offer \"a first step toward comprehensive immigration reform.\""
        ],
        [
            "\"This senseless government shutdown is hurting millions of Americans, and its impacts are only getting worse. The President should re-open the government so that Republicans and Democrats in Congress can work with the White House to find a sensible solution on border security and immigration.",
            "I am confident that a reasonable compromise can be reached, but not while President Trump continues to keep significant parts of the government shut down and Leader McConnell refuses to meaningfully negotiate with Senate Democrats,\" he said."
        ],
        [
            "\"Some relief for Dreamers and an extension of Temporary Protected Status represent a first step toward comprehensive immigration reform, but more ideas from members of both parties should be taken up and debated.",
            "Republicans and Democrats stand ready to work toward a solution, but the fact remains that there is no reason to have large parts of the federal government shut down while we debate appropriate border security and immigration policies.\""
        ],
        [
            "Republican lawmakers, at the opposite end of the reaction spectrum, praised the president for his willingness to negotiate."
        ],
        [
            "Senate Majority Leader McConnell, for instance, commended the president \"for taking bipartisan steps toward addressing current immigration issues.\""
        ],
        [
            "In his statement, he said; “Compromise in divided government means that everyone can’t get everything they want every time.",
            "The president’s proposal reflects that.",
            "It strikes a fair compromise by incorporating priorities from both sides of the aisle.\""
        ],
        [
            "“This bill takes a bipartisan approach to re-opening the closed portions of the federal government.",
            "It pairs the border security investment that our nation needs with additional immigration measures that both Democrat and Republican members of Congress believe are necessary.",
            "Unlike the bills that have come from the House over the past few weeks, this proposal could actually resolve this impasse.",
            "It has the full support of the President and could be signed into law to quickly reopen the government.\""
        ],
        [
            "Republican Whip Steve Scalise called on Democrats to match Trump's willingness to negotiate."
        ],
        [
            "\"The time for political games has long passed.",
            "Democrats must put their personal dislike of the president aside, end their obstruction, and finally come to the negotiating table.",
            "It's time Democrats do what is right for the functioning and security of our nation and agree to a deal that opens our government, and includes funding for a border wall and other measures to solve this serious immigration crisis at our southern border,\" he said in a statement."
        ],
        [
            "Also on the Republican side, Sen. Susan Collins of Maine said she was \"hopeful\" for a \"constructive debate\" with Democrats."
        ],
        [
            "“Compromise is not a sign of weakness — it’s a sign of strength, particularly when hundreds of thousands of families are being harmed.",
            "The Administration, Senate Republicans, and Democrats must now resolve this stalemate before 800,000 federal workers and their families miss yet another paycheck, and our economy is further damaged,” she said."
        ],
        [
            "Sen. Mitt Romney, R-Utah, whose views on the president and his policies have fluctuated, said Trump \"put forth a reasonable, good faith proposal that will reopen the government and help secure the border.\""
        ],
        [
            "He tweeted, \"I look forward to voting for it and will work to encourage my Republican and Democratic colleagues to do the same."
        ],
        [
            "Earlier, while speaking in Ogden, Utah, Romney said he did not understand Pelosi's position on border security."
        ],
        [
            "\"You (Pelosi) and your fellow Democrats have voted for over 600 miles of border fence in the past, why won't you vote for another few miles now? I don't understand their position, I really don't,\" the Republican senator said."
        ],
        [
            "Florida Sen. Marco Rubio took a positive view of Trump's proposed deal, like his fellow Republicans.",
            "He said Trump made \"a very reasonable offer\" and urged Democrats to work with him."
        ],
        [
            "“The way to end this shutdown is for both sides to make mutual concessions in order to reach an agreement.",
            "The president has made a very reasonable offer to extend DACA and TPS protections in exchange for the border security measures he supports.",
            "I hope that instead of choosing the road of endless obstruction, Democrats will decide to work with him to reach an agreement and end the shutdown,” he said."
        ],
        [
            "Likewise, House Republican Leader Kevin McCarthy called the president's immigration offer \"reasonable.\""
        ],
        [
            "McCarthy tweeted: \"President Trump has put forward a serious and reasonable offer to reform parts of our broken immigration system and reopen government.",
            "The moment now turns to Nancy Pelosi and Chuck Schumer. The country is watching.\"",
            ""
        ]
    ],
    "source": "fox",
    "url": "https://www.foxnews.com/politics/trumps-immigration-offer-brings-polarized-reactions-from-dems-and-gop.print",
    "date": "2019-01-20"
}
