{
    "uuid": "5c1f90fd-8a1e-49a6-b9e0-0ae395ec6db6",
    "main-event": "Lawmakers react to Trump's immigration proposal",
    "main-entities": [
        "Donald Trump",
        "Democratic lawmakers",
        "Republican lawmakers"
    ],
    "title": "Trump Offers Temporary Protections for ‘Dreamers’ in Exchange for Wall Funding",
    "triplet-uuid": "70c75d68-bf65-46a6-a822-15c23d77a275",
    "body-paragraphs": [
        [
            "WASHINGTON — President Trump, facing a growing public backlash over the partial government shutdown, shifted course on Saturday and offered Democrats a deal: temporary protections for roughly 700,000 young undocumented immigrants in exchange for $5.7 billion in funding for a wall along the southern border."
        ],
        [
            "But the proposal, which Mr. Trump unveiled in a 13-minute address from the White House, appeared dead on arrival in the Capitol.",
            "Speaker Nancy Pelosi rejected it even before Mr. Trump spoke, and Senator Chuck Schumer, the Democratic leader, denounced the offer as “not a compromise but more hostage taking.”"
        ],
        [
            "With the shutdown entering its fifth week and polls showing a majority of the public blaming Mr. Trump, the president’s advisers have been searching for an exit strategy.",
            "Saturday’s speech grew out of talks that Vice President Mike Pence and the president’s son-in-law and senior adviser, Jared Kushner, have had in recent days with lawmakers including Senator Mitch McConnell, the majority leader."
        ],
        [
            "The proposal was Mr. Trump’s first public offer to Democrats since the partial shutdown began nearly a month ago.",
            "It came after an acrimonious week of tit-for-tat politics, in which Ms. Pelosi told the president he could not deliver his State of the Union address in the Capitol until the shutdown was over, and the president retaliated by grounding a plane that was supposed to take Ms. Pelosi on a fact-finding mission to Afghanistan."
        ],
        [
            "In casting the plan as a compromise, the president sought to shift pressure to Democrats — who have repeatedly refused to give Mr. Trump any money for his border wall — to end the shutdown.",
            "But Democrats continued to insist they will not negotiate with Mr. Trump over border security until the government reopens."
        ],
        [
            "Over the course of his administration, Mr. Trump has repeatedly sought to curb both legal and illegal immigration.",
            "He has revoked Temporary Protected Status, or T.P.S., which offers crucial protections for immigrants, for people from some Latin American and African countries.",
            "And he has moved to rescind Deferred Action for Childhood Arrivals, or DACA, an Obama-era program that shielded the young undocumented immigrants known as Dreamers from deportation."
        ],
        [
            "In the deal he outlined on Saturday, Mr. Trump offered to restore T.P.S. protection for 300,000 people, and said he would allow 700,000 Dreamers to keep their protections for three more years in exchange for $5.7 billion for a border barrier."
        ],
        [
            "“That is our plan,” Mr. Trump said.",
            "“Border security, DACA, T.P.S. Many other things.",
            "Straightforward, fair, reasonable and common sense with lots of compromise.”",
            "The proposal, Mr. Trump added, was intended to “break the logjam and provide Congress with a path forward.”"
        ],
        [
            "The speech was the second time during the shutdown that the president addressed the nation about the immigration crisis.",
            "But unlike his first address, a prime-time broadcast from the Oval Office that leaned heavily on dark messaging about the dangers of crime and illegal drugs flowing across the border, Mr. Trump seemed on Saturday to soften his tone."
        ],
        [
            "He paired the address with his first naturalization ceremony at the White House, a move intended to underscore the idea that he supports legal immigration.",
            "And his language was markedly different; instead of insisting on the “big beautiful wall” he promised during his 2016 campaign, Mr. Trump took care to use the word “barrier” as well — and seemed to pare back his vision for it."
        ],
        [
            "Calling the wall “a powerful and beautifully designed see-through steel barrier on our southern border,” Mr. Trump said: “This is not a 2,000-mile concrete structure from sea to sea.",
            "These are steel barriers in high priority locations.",
            "Much of the border is already protected by natural barriers such as mountains and water.”"
        ],
        [
            "Mr. Trump noted that he had adopted some Democratic proposals on border security.",
            "The president proposed $800 million for humanitarian assistance and $805 million for drug detection technology, in addition to funding for 2,750 more border agents and law enforcement officials and 75 new immigration judge teams."
        ],
        [
            "In her talking points, issued to Democrats, Ms. Pelosi said her party favored “new drug, weapons and contraband scanning technology at official ports of entry,” and “filling the more than 3,000 vacancies for customs officers.”",
            "Ms. Pelosi also intends to bring up legislation in the coming days that includes an additional $1 billion for border security, including $563 million for 75 new immigration judges and support staff."
        ],
        [
            "Even so, Democrats roundly criticized the president’s plan.",
            "They were particularly incensed that Mr. Trump’s offer extended protections to Dreamers and T.P.S. recipients that he himself revoked.",
            "And they said the deal was a nonstarter because it did not offer any permanent protections for Dreamers."
        ],
        [
            "“I think it’s simply more fake promises raising false hopes,” Senator Richard Blumenthal, Democrat of Connecticut, said.",
            "“It will fool few Americans because it’s neither serious nor credible as a real remedy for Dreamers.”"
        ],
        [
            "Some on the right also pushed back, describing the proposal as amnesty.",
            "James Carafano, a national security expert at the Heritage Foundation who worked on Mr. Trump’s transition, was among the critics.",
            "“Amnesty encourages further illegal immigration, incentivizes the tragedy of human trafficking and undermines our citizens’ confidence in the rule of law,” he said."
        ],
        [
            "Mr. Pence, briefing reporters after Mr. Trump’s remarks, said the speech reflected a painstaking process of listening to lawmakers, including rank-and-file Democrats who made it clear they believed that protections for DACA and T.P.S. recipients must be included in a border security deal."
        ],
        [
            "And he pushed back forcefully against critics like Mr. Carafano who said the measure amounted to an unacceptable amnesty for undocumented immigrants."
        ],
        [
            "“There is no pathway to citizenship in this proposal,” Mr. Pence said."
        ],
        [
            "But that was one reason many Democrats considered it unacceptable.",
            "Other senior administration officials made it clear that part of Mr. Trump’s strategy was to try to drive a wedge within the party between those who want to hold out for a much more generous solution and those who may feel enough political pressure to end the shutdown that they will feel obliged to support it."
        ],
        [
            "Noting that Tuesday is the deadline for the government to reopen in time to prevent federal employees from going a second consecutive pay period without a check, Mick Mulvaney, the acting chief of staff, said Senate Democrats had a tricky decision to make.",
            "He also noted that the president’s ability to declare a national emergency was “absolutely” still a tool available to Mr. Trump to find funds to build the wall if a legislative agreement could not be reached."
        ],
        [
            "Now it will be up to Mr. McConnell to put legislation incorporating Mr. Trump’s proposal on the Senate floor."
        ],
        [
            "Mr. McConnell — who has insisted he will not put any legislation on the floor unless the president will sign it — spoke to Mr. Trump, Mr. Kushner and Mr. Pence on Thursday night about finding a way forward."
        ],
        [
            "Mr. McConnell told the president that before he could bring up legislation on the Senate floor, he needed a “public reassurance” that Mr. Trump would sign it, one person close to the talks said, speaking on the condition of anonymity to describe sensitive discussions."
        ],
        [
            "The president’s proposal “strikes a fair compromise by incorporating priorities from both sides of the aisle,” Mr. McConnell said in a statement after Mr. Trump’s speech."
        ],
        [
            "If Mr. McConnell does indeed put a bill on the floor, as the president said he would, Senate Democrats will have to decide whether to block it or let it come up for a vote.",
            "Despite Democrats’ vow to reject the measure, it could create an opening for negotiations between the two sides."
        ],
        [
            "The shutdown stalemate is creating increasing nervousness on Capitol Hill, especially among Republicans seeking re-election in Democratic-leaning states.",
            "One of them, Senator Susan Collins of Maine, is among only a handful of Republicans who have broken with the president and called for the government to reopen without a border security deal."
        ],
        [
            "On Saturday, she praised the president, saying she hoped that Mr. Trump’s offer would “lead to constructive debate that will end this impasse.”"
        ],
        [
            "White House aides and allies of Mr. Trump said Saturday that Mr. Trump succeeded in ratcheting up the political pressure on Ms. Pelosi, especially if the Senate succeeded in passing a bill."
        ],
        [
            "“The Democrats’ talking points have been that the president is solely responsible for shutting down the government,” Marc Short, the former White House legislative director, said.",
            "“This puts more onus on them to come back and say why this proposal is insufficient.”"
        ],
        [
            "But one reason Democrats are so leery of the deal is that they have been down this road with the president before.",
            "Last year, Mr. Trump and Mr. Schumer negotiated $25 billion in wall money for a pathway to citizenship for the Dreamers.",
            "But that deal fell apart when hard-line White House advisers persuaded the president to back away."
        ],
        [
            "The standoff over the shutdown, some former aides noted, was the first time Mr. Trump has had to engage in meaningful, high-stakes negotiations.",
            "But even that has come as a last resort, in what some have likened to negotiating out of desperation after failing to score political points."
        ]
    ],
    "source": "nyt",
    "url": "https://www.nytimes.com/2019/01/19/us/politics/trump-proposal-daca-wall.html",
    "date": "2019-01-19"
}
