{
    "uuid": "7f44175f-2ed4-4e74-8677-f5db8fb0cd02",
    "main-event": "Rep. Ocasio-Cortez defends Rep. Tlaib's profane impeachment remarks",
    "main-entities": [
        "Alexandria Ocasio-Cortez",
        "Rashida Tlaib"
    ],
    "title": "Ocasio-Cortez defends Tlaib after impeachment remarks: ‘I got your back’",
    "triplet-uuid": "86e6e27d-1440-4879-8b13-0dd2d89f7281",
    "body-paragraphs": [
        [
            "Rep. Alexandria Ocasio-Cortez took a stand for fellow House freshman Rep. Rashida Tlaib on Saturday after the latter’s expletive-laced comments in favor of impeaching President Trump."
        ],
        [
            "Ocasio-Cortez, the Democratic socialist lawmaker from New York, went on Twitter to weigh in, accusing the GOP of a having a double standard."
        ],
        [
            "“Republican hypocrisy at its finest: saying that Trump admitting to sexual assault on tape is just ‘locker room talk,’ but scandalizing themselves into faux-outrage when my sis says a curse word in a bar,” Ocasio-Cortez tweeted. ",
            "“GOP lost entitlement to policing women’s behavior a long time ago. Next.”"
        ],
        [
            "The lawmaker was apparently referring to a 2005 video that came to light ahead of the 2016 presidential election, in which Trump – talking to Billy Bush – made lewd comments about women."
        ],
        [
            "Trump issued an apology at the time and described the contents of the \"Access Hollywood\" recording as “locker room banter.” ",
            "He later released a followup video apology, insisting the remarks didn't \"reflect who I am.”"
        ],
        [
            "“I said it, I was wrong, and I apologize,\" Trump said."
        ],
        [
            "On Saturday, Ocasio-Cortez tweeted a vow to support Tlaib, D-Mich."
        ],
        [
            "“I got your back @RashidaTlaib - the Bronx and Detroit ride together,” she tweeted."
        ],
        [
            "Tlaib, who was sworn in as a new member of the 116th Congress on Thursday, was videotaped that night vowing to impeach the president -- shortly after she penned an op-ed for The Detroit Free Press outlining the case for impeachment."
        ],
        [
            "“People love you and you win,” the video showed Tlaib telling supporters. ",
            "“And when your son looks at you and says: ‘Momma, look you won. Bullies don’t win.’ ",
            "And I said, ‘Baby, they don’t, because we’re gonna go in there and we’re gonna impeach the motherf***er.’”"
        ],
        [
            "House Republicans fumed over the comments on Friday, with House Minority Leader Kevin McCarthy, R-Calif., prodding Speaker Nancy Pelosi to act."
        ],
        [
            "Yet Pelosi, D-Calif., downplayed Tlaib’s remarks, expressing distaste for the language but suggesting that Trump’s own language had started the heated rhetoric in Washington."
        ],
        [
            "“I probably have a generational reaction to it,” Pelosi said at an MSNBC town hall. ",
            "“But in any event, I’m not in the censorship business. ",
            "I don’t like that language, I wouldn’t use that language. ",
            "I don’t….establish any language standards for my colleagues, but I don’t think it’s anything worse than what the president has said.”"
        ],
        [
            "In the Rose Garden on Friday, Trump said he found Tlaib’s comments “disgraceful” and thought she “dishonored herself” as well as “her family.”"
        ],
        [
            "Tlaib, doubling down on her comments, tweeted on Friday that she “will always speak truth to power. #unapologeticallyMe.”"
        ],
        [
            "“This is not just about Donald Trump. This is about all of us. In the face of this constitutional crisis, we must rise,” she tweeted."
        ]
    ],
    "source": "fox",
    "url": "https://www.foxnews.com/politics/ocasio-cortez-defends-tlaib-after-impeachment-remarks-i-got-your-back.print",
    "date": "2019-01-05"
}
