{
    "uuid": "3d65b2c4-6832-4bb0-812b-11025a6041f0",
    "main-event": "Democrats react to Rashida Tlaib's comments",
    "main-entities": [
        "Rashida Tlaib",
        "Donald Trump",
        "Nancy Pelosi",
        "Republican Lawmakers",
        "Democratic Lawmakers"
    ],
    "title": "Rashida Tlaib's Expletive-Laden Cry to Impeach Trump Upends Democrats' Talking Points",
    "triplet-uuid": "86e6e27d-1440-4879-8b13-0dd2d89f7281",
    "body-paragraphs": [
        [
            "WASHINGTON — Impeachment was always going to hang heavily over a divided Washington.",
            "But it took little more than 24 hours this week for a freshman House Democrat’s exuberant, expletive-laden impeachment promise to upend the bonhomie of a new Congress and prompt President Trump, by his own telling, to ask the newly elected speaker if Democrats planned to impeach him."
        ],
        [
            "The episode began Thursday night, just hours after the 116th Congress was sworn in, when a camera captured Representative Rashida Tlaib of Michigan promising profanely to impeach Mr. Trump as she drew cheers from liberal activists at a celebration at a bar near the Capitol.",
            "By the time Mr. Trump discussed the matter directly in a news conference in the Rose Garden on Friday afternoon, weeks of speculation about his potential peril had burst into the open."
        ],
        [
            "Republicans, eager to portray Democrats as out to destroy Mr. Trump’s presidency, piled on criticism of Ms. Tlaib — some of it racially tinged.",
            "(Ms. Tlaib, who is Palestinian-American, is one of the first Muslims in Congress.",
            "The Christian Broadcasting Network referred to her as a “foul-mouthed Islamic congresswoman.”)",
            "Democratic leaders, who view discussion of impeachment as politically dangerous and premature, offered worried words meant to tamp down speculation about their intentions."
        ],
        [
            "Perhaps out of a belief that an impeachment fight would help him politically — as it did President Bill Clinton in the 1990s — or outright fear that newly empowered Democrats actually might threaten his presidency, Mr. Trump dived into the conversation head first."
        ],
        [
            "“We even talked about that today,” he told reporters in the Rose Garden, referring to an exchange with Speaker Nancy Pelosi during a meeting earlier Friday to try to negotiate an end to the shutdown of the government, which Mr. Trump threatened to keep closed for years if he did not get money from Congress for a wall on the southern border.",
            "“I said, Why don’t you use this for impeachment?",
            "And Nancy said, We’re not looking to impeach you.”"
        ],
        [
            "Senior aides to Ms. Pelosi and other Democrats in the room disputed that characterization.",
            "The president had indeed invoked Ms. Tlaib and other House Democrats who want to impeach him, they said, but Ms. Pelosi tried to shift the meeting back to its intended topic and did not offer the president reassurances."
        ],
        [
            "“In his opening comments at the meeting, President Trump brought up impeachment,” Ms. Pelosi’s spokesman, Drew Hammill, wrote on Twitter.",
            "“Speaker Pelosi made clear that today’s meeting was about re-opening government, not impeachment.”"
        ],
        [
            "Regardless, Mr. Trump’s frank embrace of the issue was another astonishing development: a president of the United States talking openly about his potential impeachment at a White House news conference."
        ],
        [
            "Earlier in the day, Mr. Trump had asked on Twitter, “How do you impeach a president who has won perhaps the greatest election of all time?",
            "” He continued the theme at his news conference by asserting that “you can’t impeach somebody who is doing a great job.”"
        ],
        [
            "Ms. Pelosi and senior Democrats said they were determined not to take the bait for now and risk generating a backlash from Mr. Trump’s supporters, who would most likely see impeachment as the overreaction of out-of-control Democrats.",
            "But the words of Ms. Tlaib, who stood by her comments on Friday, made evident the pressure already mounting from the left, where public opinion polls suggest a majority of liberals want the president removed from office."
        ],
        [
            "“People love you and you win,” Ms. Tlaib told the crowd Thursday night.",
            "“And when your son looks at you and says: ’Momma, look, you won. Bullies don’t win.’",
            "And I said, ’Baby, they don’t.’ Because we’re going to go in there, and we’re going to impeach the motherfucker.”"
        ],
        [
            "She made no apologies for the remark on Friday, proclaiming that “I will always speak truth to power” and fashioning her own hashtag, #unapologeticallyme.",
            "She told a Detroit television station that “it’s probably exactly how my grandmother, if she was alive, would say it.”"
        ],
        [
            "Her outburst ran counter to all Democratic talking points.",
            "Ms. Pelosi and her deputies have repeatedly made the case that it is too early to consider impeachment.",
            "Even as Mr. Trump’s legal perils have deepened — and federal prosecutors in New York appear to have gathered evidence implicating him in a campaign finance crime — Democrats have said they want to wait to see the findings of an investigation by the special counsel, Robert S. Mueller III, of the president, his campaign and Russia’s attempts to interfere in the 2016 election."
        ],
        [
            "“I don’t really like that kind of language,” Representative Jerrold Nadler, Democrat of New York and the chairman of the House Judiciary Committee — where any impeachment inquiry must begin — said on CNN.",
            "“But more to the point, I disagree with what she said.",
            "It is too early to talk about that intelligently.",
            "We have to follow the facts.”"
        ],
        [
            "Ms. Pelosi defended Ms. Tlaib on Friday at a town hall hosted by MSNBC at the speaker’s alma mater in Washington, Trinity University.",
            "“I’m not in the censorship business,” Ms. Pelosi said."
        ],
        [
            "The Constitution grants the House the power to impeach executive branch officials for “treason, bribery or other high crimes and misdemeanors,” but what constitutes such crimes has traditionally been defined by the majority party of the House.",
            "A vote to impeach takes a simple majority in the House, but a two-thirds vote is needed in the Senate to convict and remove an official from office."
        ],
        [
            "Mr. Nadler, Ms. Pelosi and other party elders believe Mr. Trump is threatening the country’s democratic institutions.",
            "Privately, many harbor suspicions that he obstructed justice, collaborated with the Russians in 2016 or both.",
            "But they also argue that an impeachment that does not have a reasonable shot of winning a conviction in the Senate will backfire and strengthen Mr. Trump in the 2020 campaign.",
            "In the meantime, they are planning to open multiple investigations into accusations of wrongdoing around the president, his campaign and his administration."
        ],
        [
            "“We shouldn’t be impeaching for a political reason, and we shouldn’t avoid impeachment for a political reason,” Ms. Pelosi said.",
            "“So we’ll just have to see how it comes.”"
        ],
        [
            "Republicans ignored the distinction."
        ],
        [
            "“Is this the behavior that we are going to find with this new majority party in Congress?” Representative Kevin McCarthy of California, the Republican leader, asked at a news conference.",
            "He repeatedly singled out Ms. Pelosi, asking why she had not censured Ms. Tlaib."
        ],
        [
            "Mr. Trump was similarly critical of Ms. Tlaib."
        ],
        [
            "“I thought her comments were disgraceful,” Mr. Trump said at the news conference.",
            "“I think she dishonored herself, and I think she dishonored her family.”",
            "He added that her comments were “disrespectful to the United States of America.”"
        ],
        [
            "Ms. Tlaib is far from alone among House Democrats.",
            "Representatives Brad Sherman of California and Al Green of Texas formally introduced an article of impeachment on Thursday, charging that Mr. Trump had obstructed justice in firing James B. Comey, the F.B.I. director.",
            "Others are expected to follow."
        ],
        [
            "“I continue to believe that obstruction of justice is the clearest, simplest and most provable high crime and misdemeanor committed by Donald J. Trump,” Mr. Sherman said in a statement.",
            "“I hope that the articles of impeachment are the subject of hearings before the Judiciary Committee early in 2019.”"
        ],
        [
            "Many of Ms. Tlaib’s new colleagues expressed sympathy for her sentiments, even as they said the House should proceed differently."
        ],
        [
            "“Donald Trump is going to be impeached whether it is by the ballot box or Congress,” said Representative Eric Swalwell, Democrat of California and a member of the Intelligence Committee.",
            "“It will just be a matter of which one comes first.”"
        ],
        [
            "But, Mr. Swalwell added, Democrats need to avoid making “a martyr” out of Mr. Trump by affording him “a fairer investigation than he deserves.”"
        ]
    ],
    "source": "nyt",
    "url": "https://www.nytimes.com/2019/01/04/us/politics/tlaib-impeach-trump.html",
    "date": "2019-01-04"
}
