{
    "uuid": "bb209267-b337-41f2-8691-e2080f91da9e",
    "main-event": "Roger Stone has been indicted by Mueller",
    "main-entities": [
        "Roger Stone",
        "Robert Mueller",
        "Donald Trump"
    ],
    "title": "FBI's show of force in Roger Stone arrest spurs criticism of Mueller tactics",
    "triplet-uuid": "aab91277-8d56-4844-a581-45630f873f49",
    "body-paragraphs": [
        [
            "The FBI's pre-dawn arrest of President Trump's ex-adviser Roger Stone at his Florida home prompted critics to once again question the tactics of Special Counsel Robert Mueller, after more than a dozen special agents clad in tactical gear raided Stone's property Friday."
        ],
        [
            "Stone, 66, was taken into custody early Friday after being indicted by a federal grand jury a day earlier as part of Mueller’s investigation into Russian meddling and potential collusion with Trump campaign associates during the 2016 presidential election. "
        ],
        [
            "CNN, which conveniently happened to be staking out Stone's Fort Lauderdale home, posted video of the arrest that showed a team of FBI agents with guns banging on Stone’s door and demanding that he come outside."
        ],
        [
            "“At the crack of dawn, 29 FBI agents arrived at my home with 17 vehicles, with lights flashing, when they could have contacted my lawyer,” Stone explained after a court appearance Friday. "
        ],
        [
            "“But the FBI agents were extraordinarily courteous.”"
        ],
        [
            "Stone will appear on Fox News Channel's \"Tucker Carlson Tonight\" on Friday at 8 p.m. ET."
        ],
        [
            "Stone’s attorney added that the arrest was a “spectacle.”"
        ],
        [
            "“A SWAT team, searching the house, scaring his wife, scaring his dogs—it was completely unnecessary,” Stone’s attorney said. "
        ],
        [
            "“A telephone call would have done the job, and he would have appeared. "
        ],
        [
            "Mr. Stone has nothing to hide.”"
        ],
        [
            "The arrest operation drew scrutiny on social media—even from President Trump, who said “Border Coyotes, Drug Dealers and Human Traffickers are treated better,” and questioned “who alerted CNN to be there?”"
        ],
        [
            "One federal law enforcement source told Fox News on Friday that the operation was “standard” for a home arrest. "
        ],
        [
            "The source told Fox News that home arrests typically take place early in the morning with a team of FBI agents in protective gear, adding that Stone’s situation was “nothing out of the ordinary.”"
        ],
        [
            "A former senior Justice Department official, now-white collar criminal attorney with Ifrah Law, James Trusty, told Fox News that while common procedure in white collar cases would involve a federal prosecutor contacting the defendant’s attorney, Stone’s charges could have sparked a different approach."
        ],
        [
            "“It shows that there is either a fundamental distrust of Mr. Stone, possibly due to the witness tampering charge, or that there was a real breakdown with his attorney,” Trusty said Friday. "
        ],
        [
            "“The wild card here is that in charging Stone with a form of obstruction of justice, the Mueller team may view it differently than typical white-collar investigations.”"
        ],
        [
            "He added: “If the FBI and the Mueller team believe Stone has engaged in witness tampering, then there is a palpable distrust, which would make them err on the side of surprise, rather than a courtesy phone call.”"
        ],
        [
            "The 24-page indictment released early Friday alleges that Stone worked to obstruct the House Intelligence Committee’s investigation into Russian interference in the 2016 election by making false statements to the committee, denying he had records sought by the committee and persuading a witness to provide false testimony."
        ],
        [
            "The indictment does not charge Stone with conspiring with WikiLeaks, the anti-secrecy website that published the emails, or with the Russian officers Mueller says hacked them. "
        ],
        [
            "Instead, it accuses him of witness tampering, obstruction and false statements about his interactions related to WikiLeaks' release."
        ],
        [
            "But former U.S. attorney for the District of Columbia Joseph diGenova blasted the tactic as “outrageous.”"
        ],
        [
            "“I am appalled that the U.S. Department of Justice and the FBI have permitted a vindictive use of arrest in a non-violent case with a defendant who was willing to surrender,” diGenova, who has informally been an adviser to the president throughout the Russia investigation, told Fox News. "
        ],
        [
            "“This is an abuse of power and it underscores the vindictive nature of it by the fact that CNN was alerted ahead of time.”"
        ],
        [
            "He added: “For those of us who have been prosecutors and have prosecuted mob figures, drug dealers and terrorists—those are the people for whom these aggressive tactics are reserved. "
        ],
        [
            "Not a Roger Stone.”"
        ],
        [
            "“Make no mistake,” he said. "
        ],
        [
            "“This was designed to be vindictive and intimidating.”"
        ],
        [
            "DiGenova likened the FBI arrest of Stone to the bureau’s early morning raid last summer of the home of former Trump campaign chairman Paul Manafort."
        ],
        [
            "Stone on Friday said he would plead not guilty to the charges leveled against him by the special counsel’s team, and said he “looks forward to being fully and completely vindicated.”"
        ],
        [
            "“I believe this is a politically motivated investigation,” Stone said Friday. "
        ],
        [
            "“There is no circumstance whatsoever under which I will bear false witness against the president, nor will I make up lies.”"
        ],
        [
            "Stone served as an adviser to Trump for years before Trump ran for president. "
        ],
        [
            "He left Trump’s campaign in August 2015, but maintained regular contact with and publicly supported the Trump campaign throughout the 2016 presidential election."
        ],
        [
            "Mueller’s investigation, which was initially ordered to look into the 2016 election, has gone on for more than a year and half. "
        ],
        [
            "It has expanded to probe financial crimes of Trump associates before the election, conversations Trump’s national security adviser had with the Russians during the transition and whether Trump obstructed justice with his comments and actions related to the probe."
        ],
        [
            "Twenty-six Russian nationals and three Russian companies have been charged with interfering in the 2016 presidential election. "
        ],
        [
            "But none of the Trump associates connected to Trump have been charged with crimes related to collusion."
        ],
        [
            "Other convictions include former national security adviser Michael Flynn and former campaign adviser George Papadopoulos, who both pleaded guilty to making false statements in 2017. "
        ],
        [
            "Former campaign adviser Rick Gates in 2018 pleaded guilty and former campaign chairman Paul Manafort was convicted and later pleaded guilty in a separate financial crimes case dating back before the 2016 election."
        ],
        [
            "Former Trump lawyer Michael Cohen pleaded guilty to making false statements in a case brought by Mueller in November. "
        ],
        [
            "Alex van der Zwaan, a London-based lawyer, pleaded guilty to making false statements this year, and Richard Pinedo, a California man, pleaded guilty to identity fraud in 2018."
        ]
    ],
    "source": "fox",
    "url": "https://www.foxnews.com/politics/roger-stones-predawn-fbi-arrest-operation-sparks-controversy",
    "date": "2019-01-25"
}
