{
    "source": "hpo",
    "main-entities": [
        "Roger Stone",
        "Robert Mueller",
        "Donald Trump"
    ],
    "main-event": "Roger Stone has been indicted by Mueller",
    "title": "Trump Associate Roger Stone Indicted In Mueller Investigation",
    "url": "https://www.huffingtonpost.com/entry/roger-stone-indicted-mueller-investigation_us_5b928d30e4b0cf7b003f3321",
    "word-count": 575,
    "date": "2019-01-25",
    "uuid": "77d6cf0e-fc7d-4aa3-9f2b-e3f8ecb3dea5",
    "triplet-uuid": "aab91277-8d56-4844-a581-45630f873f49",
    "body-paragraphs": [
        [
            "Roger Stone, an eccentric longtime Republican strategist with a tattoo of Richard Nixon’s face on his back, was arrested early Friday on criminal charges that include obstruction of an official proceeding, false statements and witness tampering."
        ],
        [
            "A federal grand jury impaneled by special counsel Robert Mueller charged Stone in a seven-count indictment.",
            "FBI agents arrested him at his home in Fort Lauderdale, Florida, and he appeared in court later Friday."
        ],
        [
            "CNN shared footage of FBI agents arriving at the property:"
        ],
        [
            "Kristin Davis, the former Manhattan madam, reportedly told The Washington Post’s Manuel Roig-Franzia that FBI agents also executed a search warrant at the New York City apartment she shared with Stone."
        ],
        [
            "Stone ― who worked on presidential campaigns for Nixon, Ronald Reagan, Bob Dole and others ― took credit for Donald Trump’s presidential run and served as an informal adviser after he left Trump’s campaign in August 2015."
        ],
        [
            "He repeatedly has said it was “a possibility” that he would be indicted in Mueller’s investigation into Russian interference in the 2016 presidential election and possible Trump campaign collusion."
        ],
        [
            "Stone has previously admitted to being in contact with Julian Assange of WikiLeaks during the Trump campaign."
        ],
        [
            "The indictment alleges he spoke “to senior Trump Campaign officials” about WikiLeaks and “information it might have had that would be damaging” to the campaign of Trump’s Democratic rival, Hillary Clinton, in the summer before the election."
        ],
        [
            "Stone was “contacted by senior Trump Campaign officials to inquire about future releases” by WikiLeaks, according to the indictment, which refers to WikiLeaks as “Organization 1.”"
        ],
        [
            "Stone’s attorney, Grant Smith, said in a statement that “there was no Russian collusion” and that the charges were “a clear attempt at silencing Roger.”"
        ],
        [
            "After appearing in court on Friday, Stone said he plans to plead not guilty to the charges, saying he was “falsely accused” and calling the investigation “politically motivated.”"
        ],
        [
            "“I look forward to being fully and completely vindicated,” he said, while onlookers booed."
        ],
        [
            "He also affirmed that he does not plan to testify against Trump, but would not say if he seeks a pardon from the president."
        ],
        [
            "The July 2018 indictment of 12 Russian intelligence officers in connection with the hack of a Democratic National Committee server during the 2016 election referred to Stone as “a person who was in regular contact with senior members of the presidential campaign of Donald J. Trump.”"
        ],
        [
            "Stone has described his contact with the Russians ― who used the handle “Guccifer 2.0” ― as “benign.”",
            "He told The Washington Post that he met with a Russian national who wanted to sell Trump damaging information on Hillary Clinton for a sum of $2 million.",
            "The man had previously worked as an informant for the FBI, but told the Post that he was not working on the FBI’s behalf when he met with Stone in May 2016."
        ],
        [
            "Stone’s indictment came after his associate Randy Credico, a radio show host, testified before the grand jury."
        ],
        [
            "Stone, according to the indictment, “on multiple occasions” around Dec. 1, 2017, told Credico (“Person 2”) that he should “do a ‘Frank Pentangeli’” in his testimony before the House Permanent Select Committee on Intelligence “to avoid contradicting Stone’s testimony.”"
        ],
        [
            "It was a reference to the “Frankie Five Angels” character from “The Godather: Part II,” whom the indictment alleges Stone and Credico had previously discussed.",
            "In the film, the character testifies and “claims not to know critical information that he does in fact know,” the indictment recounts."
        ]
    ]
}
