{
    "uuid": "c730327d-4b62-4454-b0b0-18698dd25a35",
    "main-event": "Roger Stone has been indicted by Mueller",
    "main-entities": [
        "Roger Stone",
        "Robert Mueller",
        "Donald Trump"
    ],
    "title": "Indicting Roger Stone, Mueller Shows Link Between Trump Campaign and WikiLeaks",
    "triplet-uuid": "aab91277-8d56-4844-a581-45630f873f49",
    "body-paragraphs": [
        [
            "WASHINGTON — The special counsel, Robert S. Mueller III, revealed on Friday the most direct link yet between parallel efforts by the Trump campaign and WikiLeaks to damage Hillary Clinton during the 2016 election using Democratic Party material stolen by Russians."
        ],
        [
            "A top Trump campaign official dispatched Roger J. Stone Jr., a longtime adviser to President Trump, to get information from WikiLeaks about the thousands of hacked Democratic emails, according to an indictment.",
            "The effort began weeks after Democratic officials publicly accused Russian intelligence operatives of the theft, which was part of Moscow’s broad campaign to sabotage the 2016 presidential race."
        ],
        [
            "The indictment made no mention of whether Mr. Trump played a role in the coordination, though Mr. Mueller did leave a curious clue about how high in the campaign the effort reached: A senior campaign official “was directed” by an unnamed person to contact Mr. Stone about additional WikiLeaks releases that might damage the Clinton campaign, according to the court document."
        ],
        [
            "In an indictment filled with colorful details about clandestine meetings, angry texts — even a reference to “The Godfather: Part II” — Mr. Stone was charged with seven counts, including obstruction, making false statements and witness tampering.",
            "Mr. Mueller did not say that Mr. Stone’s interactions with WikiLeaks were illegal, nor that the Trump campaign engaged in a criminal conspiracy with the organization."
        ],
        [
            "F.B.I. agents arrested Mr. Stone before dawn, appearing at his Fort Lauderdale, Fla., home with ballistic vests and guns drawn.",
            "Agents typically use those tactics as a precaution to secure possible evidence and protect themselves in case a suspect fights arrest.",
            "Prosecutors sealed details of the case because they feared that public disclosure would increase the risk of Mr. Stone fleeing or destroying or tampering with evidence, according to court documents."
        ],
        [
            "F.B.I. agents were also seen carting hard drives and other evidence from Mr. Stone’s apartment in Harlem, and his recording studio in South Florida was also raided."
        ],
        [
            "Mr. Stone appeared briefly on Friday morning in Federal District Court in Fort Lauderdale, his ankles and waist shackled in front of a packed courtroom.",
            "A man known for his dapper wardrobe was dressed simply in a navy blue cotton polo shirt, bluejeans and his trademark round, black-rimmed glasses."
        ],
        [
            "Afterward, in a theatrical appearance outside the courthouse, Mr. Stone vowed to beat what he called politically motivated charges.",
            "“There is no circumstance whatsoever under which I will bear false witness against the president, nor will I make up lies to ease the pressure on myself,” he said."
        ],
        [
            "“I look forward to being fully and completely vindicated,” he added, then flashed twin V-for-victory hand signs reminiscent of his political hero, former President Richard M. Nixon.",
            "In a brief interview later, Mr. Stone said he will plead not guilty, and people close to him have predicted that Mr. Trump could pardon Mr. Stone should he be convicted of any of the charges."
        ],
        [
            "The indictment is the first in months by Mr. Mueller, who is investigating Russia’s interference in the 2016 election and possible coordination with Trump associates.",
            "Citing details in emails and other forms of communications, the indictment suggested that Mr. Trump’s campaign knew about additional stolen emails before they were released and asked Mr. Stone to find out about them."
        ],
        [
            "According to the indictment, between June and July 2016, Mr. Stone told “senior Trump campaign officials” about the stolen emails in WikiLeaks’ possession that could be damaging to Mrs. Clinton.",
            "On July 22 that year, WikiLeaks released its first batch of Democratic emails.",
            "After that, according to the indictment, the Trump campaign sought more."
        ],
        [
            "“A senior Trump campaign official was directed to contact Stone about any additional releases and what other damaging information Organization 1 had regarding the Clinton campaign,” the indictment said, referring to WikiLeaks."
        ],
        [
            "The White House press secretary, Sarah Huckabee Sanders, sought to broadly distance Mr. Trump from the charges.",
            "“The charges brought against Mr. Stone have nothing to do with the president,” she told CNN. Asked whether he directed a campaign aide to contact Mr. Stone about the WikiLeaks emails, she repeated that the charges did not involve Mr. Trump."
        ],
        [
            "A self-described dirty trickster, Mr. Stone began his career as a Nixon campaign aide and has a tattoo of Nixon on his back.",
            "He has spent decades plying the political dark arts — including scandal-mongering — to help influence American election campaigns, and has long maintained that he had no connection to Russia’s attempts to disrupt the 2016 presidential election."
        ],
        [
            "He sometimes seemed to taunt American law enforcement agencies, daring them to find hard evidence to link him to Moscow’s interference; it is illegal for a political campaign to accept foreign aid.",
            "His brash behavior made him less of a subject of news media scrutiny than other current and former aides to President Trump — like the character in a whodunit whom readers immediately dismiss as too obvious to have committed the crime."
        ],
        [
            "The indictment does not mention whether Mr. Stone or any other Trump associate knew about the Russian operatives’ plans before they hacked the Democrats."
        ],
        [
            "In social media posts and interviews during the 2016 presidential race, Mr. Stone indicated that he had advance knowledge that a trove of information damaging to Mrs. Clinton’s campaign might be about to spill into public view, and even suggested that he had personally spoken to the WikiLeaks founder, Julian Assange."
        ],
        [
            "Mr. Stone has changed his story as investigators closed in, saying that he was not actually speaking to Mr. Assange and that he had no direct knowledge that Russians were responsible for the Democratic hacking.",
            "Still, it was revealed last year that, in the weeks before the election, Mr. Stone was messaging on Twitter with Guccifer 2.0, a pseudonym used by one or more operatives in the Russian intelligence scheme to steal the emails and funnel them to WikiLeaks."
        ],
        [
            "Three senior Trump campaign officials told Mr. Mueller’s team that Mr. Stone created the impression that he was a conduit for inside information from WikiLeaks, according to people familiar with their witness interviews.",
            "One of them told investigators that Mr. Stone not only seemed to predict WikiLeaks’ actions, but also that he took credit afterward for the timing of its disclosures that damaged Mrs. Clinton’s candidacy."
        ],
        [
            "In October 2016, Mr. Stone exchanged emails with Stephen K. Bannon, then the chief executive of Mr. Trump’s campaign.",
            "In one exchange, Mr. Stone wrote that more WikiLeaks disclosures were forthcoming, “a load every week going forward,” according to the indictment.",
            "Mr. Bannon appears to be the official described in the court document as “the high-ranking Trump Campaign official,” based on previous disclosures about the email exchange."
        ],
        [
            "A day before Mr. Stone and Mr. Bannon emailed about WikiLeaks, Donald Trump Jr. exchanged messages on Twitter with the WikiLeaks account and asked, “What’s behind this Wednesday leak I keep reading about.”"
        ],
        [
            "At the end of that week, on Oct. 7, WikiLeaks released more than 6,000 emails related to John D. Podesta, the chairman of the Clinton campaign.",
            "The release, 30 minutes after The Washington Post published a recording of Mr. Trump bragging about assaulting women, appeared aimed at redirecting negative attention from Mr. Trump to the Clinton campaign."
        ],
        [
            "The special counsel’s investigators spent months encircling Mr. Stone, and the indictment unsealed on Friday detailed how he relied on several longtime associates to get information about the timing and content of WikiLeaks’ document releases in the months before the election."
        ],
        [
            "They pored over his testimony to the House Intelligence Committee, which is conducting its own investigation into Russian interference in the 2016 election.",
            "The indictment documented numerous lies to lawmakers about his efforts to set up a back channel to WikiLeaks, and about his efforts to pressure other witnesses to lie."
        ],
        [
            "He exchanged heated texts with Randy Credico, a New York radio host with his own contacts with WikiLeaks, pressuring Mr. Credico to lie to the Intelligence Committee so that his story would line up with Mr. Stone’s."
        ],
        [
            "Mr. Stone told Mr. Credico he should “do a ‘Frank Pentangeli’” before the House committee, the indictment said, a reference to a “Godfather” character who lies to Congress about his interactions with the Mafia."
        ],
        [
            "The tumultuous relationship between Mr. Stone and Mr. Trump goes back decades, with Mr. Stone serving as an informal adviser as Mr. Trump considered running for president several times."
        ],
        [
            "When Mr. Trump formally announced during the spring of 2015 that he was running for president, Mr. Stone was one of the first to join his campaign.",
            "Within months, however, the two had a public dispute and Mr. Stone left the team.",
            "But they have remained close, speaking often by telephone."
        ],
        [
            "On Friday, the day that Mr. Stone stood on the steps of a courthouse and pledged his enduring loyalty to the president, Mr. Trump bashed the investigation that had led armed federal agents to his friend’s house in the morning darkness."
        ],
        [
            "“Greatest Witch Hunt in the History of our Country!” he wrote on Twitter. “NO COLLUSION!”"
        ]
    ],
    "source": "nyt",
    "url": "https://www.nytimes.com/2019/01/25/us/politics/roger-stone-trump-mueller.html",
    "date": "2019-01-25"
}
