{
    "source": "nyt",
    "main-entities": ["Adam Schiff", "GOP committee members", "Donald Trump"],
    "main-event": "House Intelligence Committee demand Adam Schiff's resignation",
    "title": "Demands for Adam Schiff's Head Highlight Chasm That Only Widened With Mueller's Conclusion",
    "url": "https://www.nytimes.com/2019/03/28/us/politics/adam-schiff-resign.html",
    "word-count": 1235,
    "date": "2019-03-28",
    "uuid": "3db72c86-1db7-48d7-9f89-307e54185b99",
    "triplet-uuid": "b7021938-ff8d-42ea-adec-5704c0b65237",
    "body-paragraphs": [
        [
            "WASHINGTON — The House Intelligence Committee’s first hearing since Robert S. Mueller III completed his report had barely begun when the panel’s Republicans moved en masse to demand the resignation of the committee’s chairman."
        ],
        [
            "It went downhill from there."
        ],
        [
            "The acrimony on display Thursday as the intelligence committee tried to resume its work on Russia’s intervention in the 2016 presidential election laid bare the bitter divide that persists in Congress even after Mr. Mueller, the special counsel, completed his 22-month investigation of the subject.",
            "The Republican demand and the barbed response of the committee’s chairman, Representative Adam B. Schiff, echoed well outside the wood-paneled House hearing room."
        ],
        [
            "Representative Kevin McCarthy, the House Republican leader, spent much of his weekly news conference comparing Mr. Schiff, a fellow Californian, to Senator Joseph R. McCarthy, who fueled fears in the 1950s that Communist spies had infiltrated the American government.",
            "Representative Michael R. Turner, Republican of Ohio, played the same card in the hearing room, fuming that Mr. Schiff would not accept Attorney General William P. Barr’s word that Mr. Mueller had not found the Trump campaign to have taken part in a conspiracy to undermine the election."
        ],
        [
            "“With McCarthyism,” a senator was “chasing after Russian Communists,” Mr. Turner, an Intelligence Committee member, said.",
            "“Now we have Schiff chasing after Russian collusion.”"
        ],
        [
            "Undaunted, Mr. Schiff made clear he was not about to step down, nor was he about to absolve President Trump or his campaign from nefarious conduct with Moscow — especially without seeing Mr. Mueller’s report first.",
            "The Justice Department revealed on Thursday that the report came in at more than 300 pages, raising more questions about what information was behind the four-page summary released by Mr. Barr."
        ],
        [
            "Mr. Schiff had many questions of his own."
        ],
        [
            "“You might think that it’s O.K. that the president’s son-in-law sought to establish a secret back channel of communications with the Russians through a Russian diplomatic facility.",
            "I don’t think that’s O.K. You might think it’s O.K. that an associate of the president made direct contact with the G.R.U. through Guccifer 2.0 and WikiLeaks; that is considered a hostile intelligence agency,” Mr. Schiff said, referring to Russian military intelligence and a Russian intelligence hacker."
        ],
        [
            "He continued: “You might think that it’s O.K. that the national security-designate secretly conferred with the Russian ambassador about undermining U.S. sanctions.",
            "And you might think it’s O.K. he lied about it to the F.B.I. You might say that’s all O.K.",
            "You might say that’s just what you need to do to win.",
            "But I don’t think it’s O.K. I think it’s immoral. I think it’s unethical. I think it’s unpatriotic. And yes, I think it’s corrupt.”"
        ],
        [
            "Democrats who now control the House say that they will accept Mr. Mueller’s findings, but as Mr. Schiff’s monologue indicated they are increasingly determined not to let go of what they see as a deeply troubling pattern of wrongdoing by Mr. Trump, his businesses and his administration."
        ],
        [
            "That has in turn enraged Republicans, who have happily embraced what they call Mr. Mueller’s absolution of Mr. Trump.",
            "They say Democrats will stop at nothing to ruin his presidency, and bristle at Democrats accusing them of turning a blind eye to the Russian threat.",
            "And at the center of their wrath is Mr. Schiff, whose doughy-faced demeanor hardly evokes an attack dog."
        ],
        [
            "“The findings of the special counsel conclusively refute your past and present assertions and have exposed you as having abused your position to knowingly promote false information, having damaged the integrity of this committee, and undermined faith in U.S. government institutions,” Representative K. Michael Conaway, Republican of Texas, said to Mr. Schiff."
        ],
        [
            "Reading from a letter signed by every Republican member of the committee, Mr. Conaway added, “Your actions both past and present are incompatible with your duties as chairman of this committee.”"
        ],
        [
            "Mr. Trump intervened as well, accusing Mr. Schiff of “knowingly and unlawfully lying and leaking.”",
            "He “should be forced to resign from Congress!” the president wrote on Twitter."
        ],
        [
            "Mr. Schiff, clearly prepared for the ambush, argued that there was a difference between prosecutors proving a criminal conspiracy and the committee investigating evidence of foreign compromise.",
            "The committee’s own investigative work would go on, he signaled, though outside the hearing room he has indicated that work may well need to shift course once Mr. Mueller’s findings are fully understood."
        ],
        [
            "Democrats backed him.",
            "“History will clarify what has happened,” said Representative Jim Himes, Democrat of Connecticut."
        ],
        [
            "Speaker Nancy Pelosi of California praised Mr. Schiff as “calm, professional, patriotic,” and said his work as the chairman of the committee has been “in stark contrast to the irresponsible and almost criminal behavior of the previous chair of the committee,” Representative Devin Nunes, Republican of California."
        ],
        [
            "“What is the president afraid of — that he would go after a chairman of the committee?” she said.",
            "“I think they’re just scaredy-cats.",
            "They just don’t know what to do.”"
        ],
        [
            "The party gave Mr. Schiff a more formal nod of confidence this week as well.",
            "On Wednesday, the Democratic Congressional Campaign Committee, House Democrats’ campaign arm, announced that Mr. Schiff would serve as a key fund-raiser for the caucus’s most vulnerable members to help put together a firewall to project the House majority."
        ],
        [
            "Out of the glare of the television cameras, Democrats are somewhat more circumspect."
        ],
        [
            "“In the heat of the political moment just as the Republicans wanted to try to convict Hillary Clinton in the public sphere, Democrats probably contributed to the expectations that the outcome would be worse for the president than it was,” Mr. Himes said in an interview a day ahead of the hearing."
        ],
        [
            "Notably sitting out the fight was Mr. Nunes, whom Democrats have accused of many of the same abuses that Republicans accused Mr. Schiff of on Thursday and whose resignation they asked for last year.",
            "Mr. Nunes’s sustained work last term to scrutinize the origins of the Russia investigation and accuse federal law enforcement officials of acting out of anti-Trump political bias sent convulsions through what in quieter times is one of Congress’s more bipartisan bodies."
        ],
        [
            "“We should not be used as a platform to spread false information and bizarre conspiracies,” Mr. Nunes said on Thursday in brief remarks before deferring to Mr. Conaway."
        ],
        [
            "Thursday’s showdown came, ironically enough, during a hearing with four subject experts on “Putin’s Playbook: The Kremlin’s Use of Oligarchs, Money and Intelligence in 2016 and Beyond.”",
            "Down the line, the witnesses warned that Vladimir V. Putin’s Russia would only grow bolder in its efforts to destabilize western democracies, including the United States."
        ],
        [
            "“The bad news is that there is a new ideological fight between Putinism and the West, and it has only just begun,” said Michael McFaul, an ambassador to Moscow under former President Barack Obama.",
            "“In my estimation, we as a country are underestimating it.”"
        ],
        [
            "The whole episode offered a sharp contrast to the Senate Intelligence Committee, which with a yawning pace and no-leaks team has continued apace with its own Russia investigation.",
            "The committee’s chairman, Senator Richard M. Burr of North Carolina, said this week that he aimed to finish witness interviews in the coming weeks and issue the last in a series of reports on the panel’s findings in the coming months."
        ],
        [
            "On Thursday, as Democrats and Republicans in the House traded recriminations, the Senate panel quietly called back for another interview with Jared Kushner, Mr. Trump’s son-in-law and senior adviser."
        ]
    ]
}
