{
    "source": "hpo",
    "main-entities": [
        "BuzzFeed",
        "Robert Mueller",
        "Donald Trump",
        "Michael Cohen"
    ],
    "main-event": "Mueller’s office disputes BuzzFeed report",
    "title": "Mueller Disputes BuzzFeed Report That Trump Told Michael Cohen To Lie To Congress",
    "url": "https://www.huffingtonpost.com/entry/mueller-denial-buzzfeed-trump-cohen_us_5c427385e4b027c3bbc1d076",
    "word-count": 584,
    "date": "2019-01-18",
    "uuid": "1de08e6e-55b4-4b5b-892b-69a8ff5aa881",
    "triplet-uuid": "c9e4d35f-aeae-462b-a8bf-e08d09a93b6e",
    "body-paragraphs": [
        [
            "In a rare statement issued Friday night, special counsel Robert Mueller’s team disputed BuzzFeed’s explosive report Thursday that said President Donald Trump directed attorney Michael Cohen to lie to Congress."
        ],
        [
            "Peter Carr, a spokesman for the special counsel, told BuzzFeed that its “description” of statements to Mueller’s office, as well as the “characterization” of documents and testimony the office obtained, was inaccurate."
        ],
        [
            "“BuzzFeed’s description of specific statements to the Special Counsel’s Office, and characterization of documents and testimony obtained by this office, regarding Michael Cohen’s Congressional testimony are not accurate,” Carr told BuzzFeed."
        ],
        [
            "The special counsel’s statement adds more confusion over what Mueller’s team knows in its ongoing investigation into President Donald Trump’s ties to Russia."
        ],
        [
            "Citing two federal law enforcement officials involved in the investigation, BuzzFeed’s Thursday night report claimed that Trump directed Cohen to lie about negotiations over a Trump Tower in Moscow."
        ],
        [
            "Mueller’s office, the report said, learned of Trump’s orders to Cohen “through interviews with multiple witnesses from the Trump Organization and internal company emails, text messages, and a cache of other documents.”"
        ],
        [
            "According to BuzzFeed, “Cohen then acknowledged those instructions during his interviews with that office.”"
        ],
        [
            "Responding to the statement from Mueller’s office on their report, BuzzFeed Editor-in-Chief Ben Smith said it stands by its reporting and asked the special counsel’s office to clarify its statement."
        ],
        [
            "“We stand by our reporting and the sources who informed it, and we urge the Special Counsel to make clear what he’s disputing,” Smith tweeted."
        ],
        [
            "In a follow-up statement on Saturday, a BuzzFeed spokesman told The New York Times that the news site had “re-confirmed” its reporting and seen “no indication that any specific aspect of our story is inaccurate.”"
        ],
        [
            "The special counsel’s statement Friday homed in on the statements, documents and testimony that was obtained by Mueller, but it did not directly dispute that Trump had directed Cohen to lie to Congress, nor did it make mention of the Trump Tower deal in Moscow."
        ],
        [
            "BuzzFeed’s original reporting sent Democrats on Capitol Hill into a furor as it suggested that Trump may have obstructed justice, thus providing grounds for impeachment or criminal charges.",
            "Some top Democrats called on Mueller to release what his team knows about Trump’s Moscow deal as a matter of public duty."
        ],
        [
            "In a strong statement issued Friday night, Sen. Dianne Feinstein joined a chorus of her Democratic colleagues in threatening serious action, including impeachment, against Trump if the allegations proved true.",
            "Feinstein is a ranking member of the Senate Judiciary Committee."
        ],
        [
            "“We’ve previously known about attempts to develop Trump Tower Moscow and the misrepresentations surrounding those efforts,” Feinstein said."
        ],
        [
            "“Now, media reports say President Trump directed Michael Cohen to lie to Congress about that business deal,” Feinstein continued.",
            "“If true, the president committed a crime and must be held accountable.”"
        ],
        [
            "Earlier Friday, chairman of the House Intelligence Committee Rep. Adam Schiff (D-Calif.) revealed that his committee had already begun searching for witnesses and documents to confirm BuzzFeed’s report. "
        ],
        [
            "“Our committee is already working to secure additional witness testimony and documents related to the Trump Tower Moscow deal and other investigative matters,” Schiff said."
        ],
        [
            "“As a counterintelligence concern of the greatest magnitude, and given that these alleged efforts were intended to interfere with our investigation, our Committee is determined to get to the bottom of this and follow the evidence wherever it may lead,” he added."
        ],
        [
            "Trump has maintained he is innocent and on Friday accused Cohen of lying to the special counsel in order to reduce his jail time."
        ]
    ]
}
