{
    "uuid": "fbbbf6a4-9ed3-4f46-8547-c6fc3dfaf697",
    "main-event": "Mueller’s office disputes BuzzFeed report",
    "main-entities": [
        "BuzzFeed",
        "Robert Mueller",
        "Donald Trump",
        "Michael Cohen"
    ],
    "title": "Mueller Statement Disputes Report That Trump Directed Cohen to Lie",
    "triplet-uuid": "c9e4d35f-aeae-462b-a8bf-e08d09a93b6e",
    "body-paragraphs": [
        [
            "WASHINGTON — The special counsel investigating Russian interference in the 2016 election disputed on Friday a report that said President Trump had directed Michael D. Cohen, his longtime lawyer and fixer, to lie to Congress about his role in negotiations to build a skyscraper in Moscow."
        ],
        [
            "The rare public statement by a spokesman for the special counsel, Robert S. Mueller III, challenged the facts of an article published by BuzzFeed News on Thursday saying that Mr. Cohen had told prosecutors about being pressured by the president before his congressional testimony."
        ],
        [
            "“BuzzFeed’s description of specific statements to the special counsel’s office, and characterization of documents and testimony obtained by this office, regarding Michael Cohen’s congressional testimony are not accurate,” said the spokesman, Peter Carr."
        ],
        [
            "Before Mr. Carr’s statement, the BuzzFeed report led to a flurry of reactions by senior members of Congress who said that the allegations, if true, could be grounds for initiating impeachment proceedings against Mr. Trump."
        ],
        [
            "The president himself responded on Twitter late Friday, calling the special counsel’s statement “a very sad day for journalism, but a great day for our Country!”"
        ],
        [
            "A proven effort by Mr. Trump to pressure a witness to commit perjury would be one of the most damning revelations so far in the investigation into Russia’s attempts to sabotage the 2016 presidential election and could be the cornerstone of a case that the president obstructed justice to keep investigators at bay."
        ],
        [
            "Both the White House and lawyers for Mr. Trump vigorously denied the BuzzFeed report even before the special counsel’s office weighed in."
        ],
        [
            "“Two words sum it up better than anything anybody else can say, and that is ’categorically false,’” the White House press secretary, Sarah Huckabee Sanders, told reporters on Friday."
        ],
        [
            "BuzzFeed News maintained that its report was accurate, its editor, Ben Smith, said after Mr. Mueller’s office disputed the account.",
            "“We stand by our reporting and the sources who informed it, and we urge the Special Counsel to make clear what he’s disputing,” Mr. Smith said on Twitter."
        ],
        [
            "The statement by Mr. Carr, the special counsel’s spokesman, was unusual because it appeared to be the first time he had publicly challenged the facts of a news media account that had generated significant attention for its revelations about the president."
        ],
        [
            "The New York Times has not independently confirmed the BuzzFeed report.",
            "One person familiar with Mr. Cohen’s testimony to the special counsel’s prosecutors said that Mr. Cohen did not state that the president had pressured him to lie to Congress."
        ],
        [
            "Representative Adam B. Schiff, Democrat of California and chairman of the House Intelligence Committee, said that his panel would investigate the BuzzFeed report and was “already working to secure additional witness testimony and documents related to the Trump Tower Moscow deal and other investigative matters.”"
        ],
        [
            "If true, Mr. Schiff said, the allegations “would constitute both the subornation of perjury as well as obstruction of justice.”"
        ],
        [
            "Representative Joaquin Castro of Texas, another Democratic member of the House Intelligence Committee, wrote in a tweet that “if the @BuzzFeed story is true, President Trump must resign or be impeached.”"
        ],
        [
            "Senator Mark Warner of Virginia, the top Democrat on the Senate Intelligence Committee, told reporters on Friday that the panel expected Mr. Cohen to be back to testify privately in early February."
        ],
        [
            "The report added another jolt to a chaotic week for the White House, which has had to fend off questions about recent revelations that F.B.I. counterintelligence agents began investigating Mr. Trump in 2017 and that Mr. Trump has tried to conceal the details from senior administration officials about his interactions with President Vladimir V. Putin of Russia."
        ],
        [
            "In a December court filing, prosecutors working for Mr. Mueller described how Mr. Cohen had repeatedly lied to Congress both about the length of negotiations over the Trump Tower Moscow deal and about Mr. Trump’s involvement in the project."
        ],
        [
            "Mr. Cohen had told lawmakers that the negotiations ended in January 2016 — before the first presidential primaries — and were never discussed extensively among executives of the Trump Organization.",
            "In fact, according to prosecutors, the discussions continued as late as June 2016, after Mr. Trump was the presumptive Republican presidential nominee."
        ],
        [
            "They also said Mr. Cohen discussed the progress of the Moscow project with Mr. Trump more frequently than he had told the committee and had briefed members of Mr. Trump’s family about the negotiations."
        ],
        [
            "When he appeared in court to plead guilty to lying to Congress, Mr. Cohen said he had concealed his interactions with Russian officials and the fact that he asked Mr. Trump to travel to Russia to promote the deal because he wanted to support Mr. Trump’s “political messaging.”"
        ],
        [
            "That day, Mr. Trump defended his role in the Trump Tower Moscow discussions, brushing aside concerns that he was advancing his business interests at the time he was hoping to become president.",
            "“There was a good chance that I wouldn’t have won, in which case I would have gotten back into the business, and why should I lose lots of opportunities?” he told reporters."
        ],
        [
            "Mr. Cohen drafted his statement to Congress in August 2017 along with Steven Ryan, his lawyer at the time, according to people familiar with how the testimony was put together.",
            "Mr. Ryan was working with lawyers for the Trump family as part of a joint defense agreement."
        ],
        [
            "At least one of Mr. Trump’s personal lawyers saw Mr. Cohen’s congressional testimony before he delivered it in August and October 2017, according to people with knowledge of the discussions."
        ],
        [
            "Mr. Cohen initially repeated his false statements about the Moscow tower to prosecutors working for Mr. Mueller after he pleaded guilty in August to campaign finance violations and financial crimes.",
            "But he corrected himself during subsequent interviews and proved credible, the special counsel’s office said in a December sentencing memo."
        ],
        [
            "Mr. Cohen said he initially lied because he did not want to contradict his congressional testimony, prosecutors said.",
            "Subsequently, he took care “not to overstate his knowledge or the role of others in the conduct under investigation” and provided “useful information” about his contacts with “persons connected to the White House” in 2017 and 2018, the special counsel’s filing said."
        ],
        [
            "That truthfulness was a departure from Mr. Cohen’s pattern of deception throughout his professional life, according to a separate sentencing memo by federal prosecutors in New York, filed at the same time as Mr. Mueller’s.",
            "Driven by greed, they said, he “repeatedly used his power and influence for deceptive ends.”"
        ],
        [
            "Mr. Cohen was sentenced in December to three years in prison for lying to Congress, campaign finance violations and financial crimes.",
            "He said he took full responsibility for his crimes, but said he acted out of blind loyalty to Mr. Trump, who he said “led me to choose a path of darkness over light.”"
        ],
        [
            "During his nomination hearing this week to become attorney general, William P. Barr was asked if the president would have committed a crime if he had coached a witness to testify falsely — or not to testify at all."
        ],
        [
            "“Yes,” Mr. Barr said. “Under an obstruction statute, yes.”"
        ]
    ],
    "source": "nyt",
    "url": "https://www.nytimes.com/2019/01/18/us/politics/buzzfeed-cohen-russia-tower.html",
    "date": "2019-01-18"
}
