{
    "uuid": "f8e82008-129b-4631-928e-3f7869b1fe71",
    "main-event": "Mueller’s office disputes BuzzFeed report",
    "main-entities": [
        "BuzzFeed",
        "Robert Mueller",
        "Donald Trump",
        "Michael Cohen"
    ],
    "title": "Trump says he appreciates Mueller’s statement disputing BuzzFeed report",
    "triplet-uuid": "c9e4d35f-aeae-462b-a8bf-e08d09a93b6e",
    "body-paragraphs": [
        [
            "President Trump on Saturday said he appreciates FBI special counsel Robert Mueller releasing a statement disputing parts of a BuzzFeed news report claiming Trump directed Michael Cohen to lie to Congress about the timing of discussions over a proposed Trump Tower project in Moscow."
        ],
        [
            "“I thought that the BuzzFeed piece -- and maybe equally as bad the coverage of the BuzzFeed phony story -- it was a total phony story, and I appreciate the special counsel coming out with a statement last night, I think it was appropriate that they did so, I appreciate that,” he told reporters."
        ],
        [
            "\"I think that the BuzzFeed piece was a disgrace to our country, it was a disgrace to journalism and I think also that the coverage by the mainstream media was disgraceful and I think it's going to take a longtime for the mainstream media to recover its credibility,\" he went on to say. "
        ],
        [
            "\"It's lost tremendous credibility.\""
        ],
        [
            "BuzzFeed published the story on Thursday, citing two law enforcement officials who said Cohen -- Trump’s former longtime attorney -- acknowledged to Mueller’s office that he was told to lie to Congress about the potential real-estate deal in Moscow, telling Congress that the negotiations ended months before they did so as to conceal Trump’s involvement."
        ],
        [
            "The article said that Cohen’s testimony “marks a significant new frontier: It is the first known example of Trump explicitly telling a subordinate to lie directly about his own dealings with Russia.”"
        ],
        [
            "BuzzFeed also reported that Trump backed a plan, set up by Cohen, to visit Russia during the presidential campaign, meet Russian President Vladimir Putin in person and begin the negotiations."
        ],
        [
            "Mueller’s team is investigating alleged Russian interference in the 2016 election and rarely issues statements about the state of the investigation or disputing reports in the press."
        ],
        [
            "But on Friday, after Democrats had called for investigations and hinted at impeachment proceedings, the special counsel’s office took the extraordinary step of releasing a statement disputing the article."
        ],
        [
            "“BuzzFeed’s description of specific statements to the special counsel’s office, and characterization of documents and testimony obtained by this office, regarding Michael Cohen’s Congressional testimony are not accurate,” Peter Carr, a spokesman for Mueller’s office, said. "
        ],
        [
            "It did not offer further details about what it disputed."
        ],
        [
            "BuzzFeed’s editor in chief, Ben Smith, later tweeted that “we stand by our reporting and the sources who informed it, and we urge the Special Counsel to make clear what he’s disputing.”"
        ],
        [
            "Trump’s team had also denied the claims in the article. "
        ],
        [
            "Trump himself said Friday evening that the controversy was “a very sad day for journalism, but a great day for our country.”"
        ],
        [
            "Trump lawyer Rudy Giuliani on Friday also praised Mueller’s office for “correcting the Buzzfeed false story” and asked the press to take heed that their hysterical desire to destroy this President has gone too far.”"
        ],
        [
            "In a statement Saturday aftternoon, BuzzFeed spokesman Matt Mittenthal doubled down on the organization's defense of its reporting."
        ],
        [
            "“As we’ve re-confirmed our reporting, we’ve seen no indication that any specific aspect of our story is inaccurate. "
        ],
        [
            "We remain confident in what we’ve reported, and will share more as we are able,\" he said."
        ],
        [
            ""
        ]
    ],
    "source": "fox",
    "url": "https://www.foxnews.com/politics/trump-says-he-appreciates-muellers-statement-disputing-buzzfeed-report",
    "date": "2019-01-19"
}
