{
    "source": "fox",
    "main-entities": ["William Barr", "House Democrats", "Donald Trump"],
    "main-event": "Democrats demand release of full Mueller report",
    "title": "As Mueller findings released, 2020 Dems demand to see 'whole damn report'",
    "url": "https://www.foxnews.com/politics/as-mueller-findings-released-2020-dems-demand-whole-report",
    "word-count": 704,
    "date": "2019-03-25",
    "uuid": "a675738a-1b71-41cf-8954-a6c7dbc5e333",
    "triplet-uuid": "e71d149d-0426-43f0-87e8-8c611dad7205",
    "body-paragraphs": [
        [
            "The 2020 Democratic presidential candidates may have faced a setback after Special Counsel Robert Mueller's investigation found no evidence of Trump-Russia collusion, but made clear that they're not giving up the hunt for incriminating details against the president."
        ],
        [
            "Sen. Bernie Sanders of Vermont, campaigning in San Francisco on Sunday, told the large crowd that, “I don't want a summary of the report!",
            "I want the whole damn report because nobody, especially this president, is above the law.”"
        ],
        [
            "And on Saturday, one day before Attorney General William Barr released a short summary of Mueller’s findings, former Texas Rep. Beto O’Rourke charged on the campaign trail in South Carolina that you “have a president, who in my opinion beyond the shadow of a doubt, sought to, however ham-handedly, collude with the Russian government ― a foreign power ― to undermine and influence our elections.”"
        ],
        [
            "He did not comment at length on Sunday, but did say at a campaign stop in Las Vegas that Trump is “one of the most racist and uncivil presidents we have ever had.”"
        ],
        [
            "Mueller’s nearly two-year-long investigation did not establish that members of Trump’s 2016 presidential campaign conspired or coordinated with the Russian government to interfere in the election in favor of Trump and at the expense of Democratic nominee Hillary Clinton."
        ],
        [
            "Mueller’s long-awaited findings also did not take a clear position on whether Trump obstructed justice, with no conclusions that the president committed a crime but also not exonerating Trump.",
            "Barr and Deputy Attorney General Rod Rosenstein on Sunday concluded, though, that Mueller’s report did not contain sufficient evidence to establish that Trump committed obstruction of justice."
        ],
        [
            "America Rising, a pro-Republican opposition research group, took aim at O’Rourke, saying on Sunday after Barr’s announcement that the candidate made “brazen and incorrect claims on the campaign trail.”"
        ],
        [
            "Barr is expected to make public more of the report, but 2020 Democrats are demanding the full report be released."
        ],
        [
            "“The Mueller report needs to be made public, the underlying investigative materials should be handed over to Congress, and Barr must testify.",
            "That is what transparency looks like.",
            "A short letter from Trump's hand-picked Attorney General is not sufficient,” Sen. Kamala Harris of California wrote on Twitter Sunday."
        ],
        [
            "Rourke demanded Barr “release the full Mueller report to the American people and their representatives.\""
        ],
        [
            "Sen. Elizabeth Warren of Massachusetts pointed to a recent unanimous vote by Democrats and Republicans in the House of Representatives to urge the release of the report."
        ],
        [
            "“Congress didn’t ask for a 'summary,' Attorney General Barr.",
            "Members of the House voted 420-0 to release the report.",
            "The American people deserve to see the full report. #ReleaseTheFullReport,” she wrote on Twitter."
        ],
        [
            "Sen. Cory Booker of New Jersey wrote that the “American public deserves the full report and findings from the Mueller investigation immediately—not just the in-house summary from a Trump Administration official.”"
        ],
        [
            "It was a similar call from Sen. Amy Klobuchar of Minnesota, who tweeted that “AG Barr's summary 4-pg letter of Special Counsel Mueller's investigation underscores that the ENTIRE report & documentation-including all information re Russia’s attempts to influence our election-need to be made public.",
            "The public deserves answers now-our democracy depends on it.\""
        ],
        [
            "And Sen. Kirsten Gillibrand of New York also chimed in, demanding that the “Mueller report must be made public.",
            "Not just a letter from someone appointed by Trump to protect himself—all of it.",
            "The President works for the people, and he is not above the law.”"
        ],
        [
            "South Bend, Ind., Mayor Pete Buttigieg, who’s seen his campaign surge in recent days, also called for the entire report to be released.",
            "And in an interview on MSNBC, he pointed to the 2020 presidential election as the best way to oust Trump from the White House, saying, “I think this is further evidence that it would be a mistake for Democrats to think that the way for the Trump presidency to end is by way of investigation.”"
        ],
        [
            "Former Rep. John Delaney of Maryland called for the report to be made public, but also urged that it was time to move on.",
            "He told Fox News Sunday night that “whether you're a Democrat, Republican or independent, you should want to see this report, and we should want to move on from this.\""
        ]
    ]
}
