{
    "source": "hpo",
    "main-entities": ["William Barr", "House Democrats", "Donald Trump"],
    "main-event": "Democrats demand release of full Mueller report",
    "title": "Democrats Demand Immediate Release Of Mueller Report",
    "url": "https://www.huffpost.com/entry/democrats-immediate-release-mueller-report_n_5c95524ee4b01ebeef0f3b74",
    "word-count": 514,
    "date": "2019-03-22",
    "uuid": "8de59e52-5a1d-4a68-b65b-003b2b60d2b0",
    "triplet-uuid": "e71d149d-0426-43f0-87e8-8c611dad7205",
    "body-paragraphs": [
        [
            "Democrats want access to special counsel Robert Mueller’s investigation into Russian interference in the 2016 presidential election before President Donald Trump has a chance to interfere."
        ],
        [
            "In a joint letter from the chairs of six committees in the U.S. House of Representatives, Democrats wrote they expect Attorney General William Barr to make Mueller’s report public immediately."
        ],
        [
            "“After nearly two years of investigation — accompanied by two years of unprecedented attacks on the integrity of the investigation by President Trump — the public and Congress are entitled to know what the Special Counsel has found,” the letter urged."
        ],
        [
            "Its signatories include House Judiciary Committee Chairman Jerrold Nadler (D-N.Y.), oversight committee Chairman Elijah Cummings (D-Md.), intelligence committee Chairman Adam Schiff (D-Calif.), Financial Services Committee Chairwoman Maxine Waters (D-Calif.), Ways and Means Committee Chairman Richard Neal (D-Mass.) and Foreign Affairs Committee Chairman Eliot Engel (D-N.Y.)"
        ],
        [
            "Earlier, Sen. Mark Warner (D-Va.) released a statement immediately after the Mueller report was revealed to be complete, demanding that Barr quickly put together a redacted, releasable version for Congress to access."
        ],
        [
            "Warner said in a statement: “Congress and the American people deserve to judge the facts for themselves.",
            "The Special Counsel’s report must be provided to Congress immediately, and the Attorney General should swiftly prepare a declassified version of the report for the public.",
            "Nothing short of that will suffice."
        ],
        [
            "It is also critical that all documents related to the Special Counsel’s investigation be preserved and made available to the appropriate Congressional committees.",
            "Any attempt by the Trump Administration to cover up the results of this investigation into Russia’s attack on our democracy would be unacceptable.”"
        ],
        [
            "He joined a number of other Democrats, including several 2020 presidential candidates, who either had statements prepared or tweeted about a prompt release."
        ],
        [
            "“The American people deserve to know the full truth about Russia’s interference in our democracy,” tweeted former Housing and Urban Development Secretary Julián Castro."
        ],
        [
            "Sen. Kirsten Gillibrand (D-N.Y.) said that the report should be released “without delay,” and House Speaker Nancy Pelosi (D-Calif.) and Senate Minority Leader Chuck Schumer (D-N.Y.) released a joint statement in agreement."
        ],
        [
            "They, like Warner, didn’t want Trump to throw a wrench in Congress’ spokes by getting early access to the documents."
        ],
        [
            "“Attorney General Barr must not give President Trump, his lawyers or his staff any ‘sneak preview’ of Special Counsel Mueller’s findings or evidence, and the White House must not be allowed to interfere in decisions about what parts of those findings or evidence are made public,” the joint statement said."
        ],
        [
            "Sen. Bernie Sanders (I-Vt.), who is running for the Democratic presidential nomination, echoed Trump’s own earlier call to release the report."
        ],
        [
            "Meanwhile, CNN reports that the “principal conclusion” of the report, which the attorney general will soon give to Congress, is expected to be made public."
        ],
        [
            "Trump’s camp wasn’t champing at the bit."
        ],
        [
            "“We’re pleased that the Office of Special Counsel has delivered its report to the Attorney General pursuant to the regulations.",
            "Attorney General Barr will determine the appropriate next steps,” said the president’s personal attorneys Rudy Giuliani and Jay Sekulow in a joint statement."
        ]
    ]
}
