{
    "source": "fox",
    "main-entities": ["Mitt Romney", "Todd Akin"],
    "main-event": "Romney urges Akin to drop out of Senate race",
    "title": "Romney calls on Rep. Akin to drop Senate bid over 'rape' comments",
    "url": "http://www.foxnews.com/politics/2012/08/21/rep-akin-appeals-for-forgiveness-in-new-ad-as-pressure-over-rape-comment-builds/",
    "word-count": 704,
    "date": "2012-08-21",
    "uuid": "4f4dc5fb-84a8-4cd9-bd3a-451bda7a7b70",
    "triplet-uuid": "08bb9bee-c167-4c17-9c6d-4a1259231eb7",
    "body-paragraphs": [
        [
            "Mitt Romney joined several other Republicans Tuesday in calling on Missouri Rep. Todd Akin to give up his bid for Senate over his controversial comments on rape, as the Republican congressman continued to hold his ground and vowed to stay in the race."
        ],
        [
            "Romney added his voice after five past and present Missouri Republican senators urged Akin to step aside.",
            "In a statement released Tuesday afternoon, they said his presence does not serve \"the national interest.\""
        ],
        [
            "\"The issues at stake are too big, and this election is simply too important.",
            "The right decision is to step aside,\" they said.",
            "The statement came from Missouri Sen. Roy Blunt, and former Sens. John Ashcroft, Kit Bond, John Danforth and Jim Talent"
        ],
        [
            "Romney released a statement late Tuesday saying: \"As I said yesterday, Todd Akin's comments were offensive and wrong and he should very seriously consider what course would be in the best interest of our country.",
            "Today, his fellow Missourians urged him to step aside, and I think he should accept their counsel and exit the Senate race.\""
        ],
        [
            "Akin, though, told Fox News host Mike Huckabee on his radio show Tuesday afternoon that he's staying in."
        ],
        [
            "\"I believe that we can win this,\" Akin said, citing a \"tremendous outpouring of support\" from individual donors even as party heavyweights freeze him out."
        ],
        [
            "The Republican congressman is facing a 5 p.m. deadline to withdraw -- after that, he would need a court order to have his name removed from the ballot."
        ],
        [
            "But Akin rebuffed calls late Monday to step aside and let another Republican candidate take his place.",
            "Instead, his campaign released a new ad in which Akin looks into the camera and addresses the controversy surrounding his remarks."
        ],
        [
            "\"Rape is an evil act.",
            "I used the wrong words in the wrong way and for that I apologize,\" he said in the ad.",
            "\"As the father of two daughters, I want tough justice for predators.",
            "I have a compassionate heart for the victims of sexual assault. And I pray for them.",
            "The fact is, rape can lead to pregnancy.",
            "The truth is, rape has many victims."
        ],
        [
            "\"The mistake I made was in the words I said, not in the heart I hold.",
            "I ask for your forgiveness,\" he said.",
            "The video was released after Akin canceled a scheduled television interview Monday night."
        ],
        [
            "Akin's ad, and claims Monday that he's \"going to stay in,\" defied Republican Party leaders who are nervous the controversy could imperil their chances of taking control of the Senate after the November elections.",
            "Akin is challenging Democratic Missouri Sen. Claire McCaskill in a race considered key to a GOP Senate majority come 2013."
        ],
        [
            "A source within the National Republican Senatorial Committee told Fox News that Sen. John Cornyn, head of the Senate GOP campaign arm, already has told Akin that if he stays in the race, the $5 million set aside for the Missouri race will be withdrawn.",
            "Cornyn, according to the source, told him the party is concerned his presence in the race could hurt Republicans' chances of winning the Senate majority."
        ],
        [
            "Akin made the remarks in an interview with Fox affiliate KTVI.",
            "He claimed a woman's body can typically fend off pregnancy during a \"legitimate rape,\" as he argued against allowing abortions in cases of rape, claiming such pregnancies are uncommon in the first place."
        ],
        [
            "\"It seems to me first of all, from what I understand from doctors, that's really rare,\" Akin told KTVI.",
            "\"If it's a legitimate rape, the female body has ways to try to shut that whole thing down.\""
        ],
        [
            "Top Senate leaders including Senate Republican Leader Mitch McConnell have condemned Akin's comments."
        ],
        [
            "\"What he said is just flat wrong in addition to being wildly offensive to any victim of sexual abuse,\" McConnell said.",
            "\"Although Rep. Akin has apologized, I believe he should take time with his family to consider whether this statement will prevent him from effectively representing our party in this critical election.\""
        ],
        [
            "Republican Sen. Scott Brown, who's in a tough race against Democrat Elizabeth Warren in Massachusetts, was the first Republican senator to call on Akin to withdraw from the race."
        ],
        [
            "Akin apologized for his remarks Monday.",
            "He tweeted Monday afternoon: \"I am in this race to win.\""
        ]
    ]
}
