{
    "source": "nyt",
    "main-entities": ["Mitt Romney", "Todd Akin"],
    "main-event": "Romney urges Akin to drop out of Senate race",
    "title": "With Abortion in the Spotlight, a Challenge for Romney",
    "url": "http://thecaucus.blogs.nytimes.com/2012/08/21/with-abortion-in-the-spotlight-a-challenge-for-romney/?ref=global-home",
    "word-count": 685,
    "date": "2012-08-21",
    "uuid": "1f4cce14-4cf2-42d6-9ac4-9123926ef54e",
    "triplet-uuid": "08bb9bee-c167-4c17-9c6d-4a1259231eb7",
    "body-paragraphs": [
        [
            "HOUSTON — The decision by Republican convention delegates to oppose abortion without explicit exceptions for rape and incest poses a tricky political challenge for Mitt Romney as he prepares to accept the presidential nomination in Tampa, Fla., next week."
        ],
        [
            "The vote puts the Republican Party at odds with Mr. Romney, who supports rape and incest exceptions, at a time that controversial comments by Representative Todd Akin, the Republican Senate candidate in Missouri, have increased national scrutiny on the divisive social issue."
        ],
        [
            "Mr. Akin said over the weekend that women’s bodies will resist getting pregnant from a “legitimate rape,” comments that have been widely condemned, including by Mr. Romney who called for Mr. Akin to withdraw from the race."
        ],
        [
            "“Today, his fellow Missourians urged him to step aside, and I think he should accept their counsel and exit the Senate race,” Mr. Romney said in a statement, citing former Missouri senators like John Ashcroft, Kit Bond, John Danforth and Jim Talent."
        ],
        [
            "But Mr. Akin on Tuesday refused to step down from his race despite loud calls from his party’s leaders to abandon his bid."
        ],
        [
            "Aides to Mr. Romney declined to say on Tuesday whether he would call on the convention delegates to reconsider their position on abortion.",
            "Calls and e-mails to a half-dozen advisers on the subject were not returned on Tuesday."
        ],
        [
            "Reince Priebus, the chairman of the Republican National Committee, tried to deflect questions on behalf of Mr. Romney, saying on Fox News that “this is the platform of the Republican Party, it is not the platform of Mitt Romney.”"
        ],
        [
            "The reluctance to talk about the platform reflects the delicate position that Mr. Romney is in when it comes to abortion policy."
        ],
        [
            "A supporter of abortion rights early in his political career, Mr. Romney later switched his position.",
            "This year, he captured the nomination of a party whose hard-core activists remained suspicious of Mr. Romney’s late-in-life conversion to their cause."
        ],
        [
            "But as he prepares to accept that nomination next week in Tampa, Mr. Romney is once again being forced to carefully navigate between the uncompromising antiabortion positions of his party’s base and the more moderate politics of the swing voters he needs to win over."
        ],
        [
            "The vote on the platform is an important part of the Republican Party’s outreach to its conservative base.",
            "Mr. Romney and his aides have worked hard to ensure that social conservatives at the convention — and the voters they represent — do not feel left out."
        ],
        [
            "The party platform — and the positions taken on abortion, same-sex marriage and other social issues — are a key part of that effort."
        ],
        [
            "If Mr. Romney were to reject the party’s tough abortion plank, it would send a politically difficult message to conservatives about how Mr. Romney might govern once he got into the White House."
        ],
        [
            "There could also be a flurry of conservative outrage at the convention, which could distract from the carefully choreographed event Mr. Romney’s strategists are planning."
        ],
        [
            "But Mr. Romney’s campaign is also trying hard to make sure that the convention projects an image that swing voters in battleground states will find appealing.",
            "Aides did not expect to be focusing heavily on the party’s abortion positions this week."
        ],
        [
            "The campaign has already chosen in the last several weeks to move off its core message about jobs and the economy.",
            "The convention is intended to return the campaign’s message to one of how Mr. Romney will get the nation’s economy back on track."
        ],
        [
            "In the current political environment involving Mr. Akin’s comments, a decision by Mr. Romney to accept the party’s abortion plank will open his campaign to attacks from his rivals that he is out of step with moderate, independent voters."
        ],
        [
            "Democrats have already pounced.",
            "Officials with the Democratic National Committee quickly called the Republican abortion position the “Akin plank” and scheduled a news conference to denounce it."
        ],
        [
            "“American women know that Mitt Romney, Paul Ryan and the party they lead are the wrong choice for women and their families,” a statement from the Democratic committee said.",
            "“Mitt Romney should do the right thing and denounce this dangerous language.”"
        ]
    ]
}
