{
    "source": "hpo",
    "main-entities": ["Paul Ryan", "Catholics"],
    "main-event": "Georgetown Catholics challenge Paul Ryan",
    "title": "Paul Ryan Challenged On Budget By Georgetown Faculty",
    "url": "https://www.huffingtonpost.com/2012/04/24/paul-ryan-challenged-by-georgetown-faculty_n_1449437.html",
    "word-count": 482,
    "date": "2012-04-24",
    "uuid": "8a97c97e-f3b4-416a-a1d2-a749a2bc7ecf",
    "triplet-uuid": "29ffd053-7684-469b-a600-97000579bd01",
    "body-paragraphs": [
        [
            "WASHINGTON—Joining a chorus of Catholic bishops , theologians, priests, and social justice leaders, nearly 90 Georgetown University faculty and administrators have called Representative Paul Ryan (R-Wisc.) to task for his misuse of Catholic social teaching in defending his budget, which hurts the poor.",
            "The group sent a letter to Rep. Ryan in advance of his appearance on the Catholic campus on Thursday morning to give the Whittington Lecture."
        ],
        [
            "In their letter to Ryan, the scholars make clear they are not objecting to his speaking on campus, but rather his recent comments defending his budget on Christian grounds."
        ],
        [
            "“Our problem with Representative Ryan is that he claims his budget is based on Catholic social teaching,” said Jesuit Father Thomas J. Reese , one of the organizers of the letter.",
            "“This is nonsense.",
            "As scholars, we want to join the Catholic bishops in pointing out that his budget has a devastating impact on programs for the poor.”",
            "Reese is a senior fellow at the Woodstock Theological Center at Georgetown University."
        ],
        [
            "The letter quotes the U.S. Conference of Catholic Bishops, which wrote several letters to Congress saying “a just framework for future budgets cannot rely on disproportionate cuts in essential services to poor persons.”",
            "The bishops noted that “the House-passed budget resolution fails to meet these moral criteria.”",
            "Last week, Rep. Ryan dismissed the bishops’ critique, erroneously claiming the letters didn’t represent “all the bishops,” a point the USCCB media office denied."
        ],
        [
            "“I am afraid that Chairman Ryan’s budget reflects the values of his favorite philosopher Ayn Rand rather than the gospel of Jesus Christ,” said Father Reese.",
            "“Survival of the fittest may be okay for Social Darwinists but not for followers of the gospel of compassion and love.”"
        ],
        [
            "The Georgetown scholars pointed to the devastating impact of cuts in food programs that keep the poor from starvation.",
            "From personal experience, they also “know how cuts in Pell Grants will make it difficult for low-income students to pursue their educations at colleges across the nation, including Georgetown.”"
        ],
        [
            "The scholars corrected Mr. Ryan on his use of the Catholic concept of “subsidiarity” as “a rationale gutting government programs.”",
            "The scholars say that it is true that “It calls for solutions to be enacted as close to the level of local communities as possible.",
            "But it also demands that higher levels of government provide help—‘subsidium’—when communities and local governments face problems beyond their means to address such as economic crises, high unemployment, endemic poverty and hunger.”"
        ],
        [
            "The scholars also gave the Representative a reading assignment: “The Compendium of the Social Doctrine of the Church,” which was commissioned by John Paul II and published by the Vatican."
        ],
        [
            "Signing the letter were over a dozen Georgetown Jesuit priests, numerous members of the Theology and other departments including History, Government, Philosophy, School of Foreign Service and School of Nursing & Health Studies."
        ]
    ]
}
