{
    "source": "fox",
    "main-entities": ["Romney campaign", "Obama campaign", "Paul Ryan"],
    "main-event": "Obama and Romney campaigns argue on Medicare",
    "title": "Ryan goes on offense over Medicare, accuses Obama of treating program like 'piggy bank'",
    "url": "http://www.foxnews.com/politics/2012/08/14/ryan-defends-gop-record-on-medicare-says-party-has-plan-to-save-program/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+foxnews%2Fpolitics+%28Internal+-+Politics+-+Text%29",
    "word-count": 1024,
    "date": "2012-08-15",
    "uuid": "f2b98b6f-651d-4747-8242-adbf8317d2d7",
    "triplet-uuid": "2ec04201-2016-4227-baf7-ba8289058203",
    "body-paragraphs": [
        [
            "Paul Ryan went on offense Tuesday in response to criticism over his Medicare plan, using an interview with Fox News coupled with a new TV ad to claim President Obama’s health care plan treats the treasured entitlement like a “piggy bank,” while the “Romney-Ryan” plan preserves it."
        ],
        [
            "Ryan, in his first one-on-one interview since being named Saturday as Mitt Romney’s running mate, told Fox News on Tuesday he thinks Medicare can be a winning issue for their campaign."
        ],
        [
            "\"We're the ones who are offering a plan to save Medicare, to protect Medicare, to strengthen Medicare,\" Ryan said.",
            "\"We're the ones who are not raiding Medicare to pay for ObamaCare.",
            "… We're the ones continuing the guarantee of Medicare for people in or near retirement.\""
        ],
        [
            "He added: “President Obama is actually damaging Medicare for current seniors.",
            "It's irrefutable and that's why I think this is a debate we want to have, and that's the debate we're going to win.”"
        ],
        [
            "The comments signal Ryan and Romney are prepared to dig in and fight back, as Democrats lob charges that Ryan stands for “ending Medicare as we know it.”"
        ],
        [
            "The Obama campaign used that line Monday in a Web video timed for Romney’s arrival in Florida, with its large senior population.",
            "The video pointed to Ryan’s budget proposals, which include significant changes to Medicare."
        ],
        [
            "The Romney campaign retorted with an ad of its own Tuesday.",
            "The ad says: “You paid in to Medicare for years … now when you need it, Obama has cut $716 billion from Medicare.",
            "Why? To pay for ObamaCare.”"
        ],
        [
            "Ryan told Fox News the campaign is trying to show the “clear contrast” between what Republicans propose and what Obama’s health care law does.",
            "Ryan wants to make changes to Medicare for those retiring a decade from now but leave benefits for current retirees and those retiring soon in place."
        ],
        [
            "“They turned Medicare into a piggy bank to finance ObamaCare,” Ryan said.",
            "“And we want to point that out.",
            "And we want to … restore those cuts to prevent that raid.",
            "… And so we propose no changes to anybody in or near retirement so that the guarantee of Medicare is for them.",
            "That's a clear contrast with President Obama's plan.”"
        ],
        [
            "The Obama campaign is disputing that argument.",
            "Obama campaign spokeswoman Lis Smith described the new Romney-Ryan ad on the subject as “dishonest and hypocritical,” considering Ryan’s own proposals for Medicare."
        ],
        [
            "“The savings his ad attacks do not cut a single guaranteed Medicare benefit, and Mitt Romney embraced the very same savings when he promised he’d sign Paul Ryan’s budget,” Smith said.",
            "“Because the president is eliminating subsidies to insurance companies and cutting waste and fraud, we’ve extended the life of Medicare by eight years.",
            "The truth is that the Romney-Ryan budget would end Medicare as we know it: people with Medicare would be left with nothing but a voucher in place of the guaranteed benefits they rely on today.”"
        ],
        [
            "Both sides are being selective in how they describe each other’s plans."
        ],
        [
            "The Ryan proposal, submitted again in the House earlier this year, would a decade from now give seniors government payments to purchase private plans or stay within the current system.",
            "Ryan says this is to preserve Medicare, not “end” it, as Obama’s campaign claims."
        ],
        [
            "But while Ryan slams the health care overhaul for cutting Medicare, even he acknowledged that his own plan achieves “savings” for Medicare in the long run.",
            "Though he doesn’t use the word “cuts,” the plan would slow the rate of benefit growth for seniors according to the Congressional Budget Office."
        ],
        [
            "And the ObamaCare cuts he referenced would likely come in the form of lower payments to providers.",
            "A Romney campaign aide, though, said “that’s a distinction without a difference” since the “provider passes that reduction along to” patients."
        ],
        [
            "In his interview with Fox News, Ryan also hammered Obama for what he called his “utter failure when it comes to creating jobs.”",
            "Amplifying the Romney campaign message, he said Obama’s heavy borrowing is dragging down economic growth – he also claimed the “hope and change campaign of '08 has become the blame and attack campaign of 2012.”"
        ],
        [
            "Ryan offered new insight as well on how Romney and Ryan came to bond in the months before he was announced as running mate."
        ],
        [
            "He recalled when he was campaigning with Romney earlier this year ahead of the Wisconsin primary."
        ],
        [
            "“We spent about five days on the road, five working hour or so days,” he said.",
            "“And in between all of those stops, driving from, you know, Appleton to Green Bay to Janesville to Milwaukee, we got to know each other.",
            "We conversed on policy issues, on where to take the country.",
            "And sooner or later, we basically started sharing the microphones at these town hall meetings and we just kind of developed a chemistry with one another and a mutual understanding with each other.”"
        ],
        [
            "Ryan said he doesn’t know whether he had a “special place” but it was “very clear we thought the same on these issues.”"
        ],
        [
            "“When he asked me to join the ticket, he basically said to me, 'You share my values and you have the kind of experience that could be a complement to my experience to getting this country back on track, to creating jobs, to getting people back to work, to saving this country from a debt crisis,'\" Ryan said."
        ],
        [
            "Ryan also discussed his affection for novelist Ayn Rand, saying “Atlas Shrugged” triggered his interest in economics.",
            "He said he doesn’t share her overall philosophy but said her books “showed how the pitfalls of socialism can hurt the economy.”"
        ],
        [
            "Obama, meanwhile, took on Ryan for the second straight day Tuesday, using a stop in Oskaloosa, Iowa, to criticize Ryan’s and Romney’s tax plan."
        ],
        [
            "“You may have heard that Governor Romney just chose his running mate, Congressman Ryan.",
            "He's a good man. He's a family man.",
            "He's the ideological leader of the Republicans in Congress,” Obama said.",
            "“And he's an articulate spokesperson for Governor Romney's views.",
            "The problem is, those views are wrong.”"
        ]
    ]
}
