{
    "source": "nyt",
    "main-entities": ["Chick-Fil-A", "GOP leaders"],
    "main-event": "GOP reps show support for Chick-Fil-A",
    "title": "Chick-fil-A Draws Huge Crowds for Appreciation Day",
    "url": "http://thelede.blogs.nytimes.com/2012/08/01/chick-fil-a-draws-huge-crowds-for-appreciation-day/",
    "word-count": 489,
    "date": "2012-08-01",
    "uuid": "55126d86-003a-42d7-a3f3-9427c5f8846a",
    "triplet-uuid": "450755dd-30d3-478b-933e-917be5c384ba",
    "body-paragraphs": [
        [
            "Hundreds of thousands of people across the country headed to Chick-fil-A restaurants on Wednesday, answering a call from Mike Huckabee, the former governor of Arkansas, to show support for the fast-food chain after the company’s president drew criticism for his opposition to same-sex marriage."
        ],
        [
            "Long lines were seen outside Chick-fil-A restaurants nationwide, and many customers documented their visits on social media sites and shared their reasons for eating at the chain."
        ],
        [
            "Many said they showed up because they agreed with the position of Chick-fil-A’s president on same-sex marriage, while others said they wanted to support freedom of expression for business owners."
        ],
        [
            "As my colleagues Kim Severson and Robbie Brown report from Atlanta, where Chick-fil-A began in the 1940s, the president, Dan T. Cathy, made comments last month about the biblical arguments against homosexuality.",
            "This prompted calls to boycott Chick-fil-A that were supported by the mayors of Boston and Chicago, along with plans for a same-sex kiss-in at the restaurants on Friday."
        ],
        [
            "Last weekend, Mr. Huckabee used his television and radio programs, as well as Facebook, to help organize an appreciation day for Chick-fil-A on Wednesday."
        ],
        [
            "More than 650,000 people signed up to participate, and tens of thousands “liked” photos of packed restaurants that Mr. Huckabee posted on his Facebook page on Wednesday."
        ],
        [
            "Below are some of the photos shared Wednesday on Twitter from Chick-fil-A restaurants around the country."
        ],
        [
            "Representative Michele Bachmann, Republican of Minnesota, shared a photo from her visit."
        ],
        [
            "Last week, Sarah Palin posted a photo of her visit to a Chick-fil-A in California on her Facebook page."
        ],
        [
            "Mr. Huckabee noted in regular audio updates Wednesday that Chick-fil-A did not participate in organizing the event.",
            "And there were no tweets or photos about the appreciation day on the company’s Facebook or Twitter accounts."
        ],
        [
            "In response to the outpouring of support for Chick-fil-A, many people used social media to share their disappointment."
        ],
        [
            "One Facebook user who lives near Austin, Tex., posted this status update:"
        ],
        [
            "“It has been really disconcerting how many of my FB friends have stood up on the side of hate and proudly posted their photos of Chick-fil-a — and they all have their little quotes about how they ‘love their gay friends’ but they ‘don’t approve’ of their lifestyles."
        ],
        [
            "So I am asking you kindly to please un-friend me — I have no use for friends like you.”"
        ],
        [
            "The Gay and Lesbian Alliance Against Defamation has asked supporters to donate the cost of a meal at a Chick-fil-A, about $6.50, to gay and lesbian rights groups."
        ],
        [
            "Facebook users are also signing up to participate in a “National Same-Sex Kiss Day” planned for Friday at Chick-fil-A restaurants.",
            "People are being encouraged to post photos of their kisses."
        ],
        [
            "Others are not waiting until Friday to post their photos."
        ]
    ]
}
