{
    "source": "fox",
    "main-entities": ["Chick-Fil-A", "GOP leaders", "protesters"],
    "main-event": "GOP reps show support for Chick-Fil-A",
    "title": "Chick-fil-A Appreciation Day brings out supporters, protesters",
    "url": "http://www.foxnews.com/politics/2012/08/01/chick-fil-appreciation-day-brings-out-supporters-more-protestors",
    "word-count": 650,
    "date": "2012-08-01",
    "uuid": "7117c2b3-85e1-4239-84c5-661475699dc3",
    "triplet-uuid": "450755dd-30d3-478b-933e-917be5c384ba",
    "body-paragraphs": [
        [
            "It used to be that taking a bite of a chicken sandwich just meant you were hungry.",
            "Now it has become a symbol of whether you stand for or against same-sex marriage, or – alternately – the right to express your personal views without fear of retaliation."
        ],
        [
            "At Chick-fil-A locations across the country, people voted with their wallets today, coming out to express support for the fast-food chain after CEO Dan Cathy said in an interview that he is a firm backer of traditional marriage."
        ],
        [
            "“I believe what the Bible says (about marriage),” Chauncy Fields told us after wolfing down a breakfast of chicken and biscuits.",
            "“So I came out here to support Chick-fil-A and the movement.”"
        ],
        [
            "Chris Johnson sees a double standard. “He (Dan Cathy) said the exact same thing that President Obama said,” Johnson told Fox News -- referring to the president’s past opposition to gay marriage – “And he gets negativity, and Obama gets positivity.”"
        ],
        [
            "At one Atlanta location, the restaurant was packed, while the line for the drive-thru looped twice around the building and out into the street."
        ],
        [
            "The backlash across the country against Chick-fil-A has been ferocious.",
            "After the mayors of Chicago and Boston heaped scorn upon the company, the mayor of Washington, DC, suggested it was peddling “hate chicken.”"
        ],
        [
            "Those comments drew a sharp response from Rev. William Owens of the Coalition of African American Pastors.",
            "“Some people are saying that because of the position that Chick-fil-A is taking, they don’t want them in their cities.",
            "It is a disgrace.",
            "It is the same thing that happened when I was marching for civil rights, when they didn’t want a black to come into their restaurant,\" he told a press conference in Washington, DC."
        ],
        [
            "The Chick-fil-A firestorm has taken on different meanings for different people.",
            "For some, it harks to the days of intolerance and segregation.",
            "For others, it is about religious views of marriage.",
            "But for most people who Fox News spoke to today, it is about free speech."
        ],
        [
            "“I think it comes down to a First Amendment issue.",
            "I mean, I do believe in the traditional values of marriage between a man and a woman,” youth pastor Stephen Lenahan told Fox News after a leisurely breakfast with three members of his ministry.",
            "He is also puzzled as to why Dan Cathy is such a target, when other corporate CEOs who openly support same-sex marriage are not similarly criticized by conservatives."
        ],
        [
            "Lenahan says he sees a bigger issue at work here.",
            "“There is kind of a culture war going on and people aren’t really respecting each other and difference of opinion.",
            "There’s no dialogue taking place to get to the heart of what we really believe as a nation and what is truth.”"
        ],
        [
            "Chick-fil-A Appreciation Day – as it is being called was the idea of former Arkansas governor and Fox News contributor Mike Huckabee.",
            "But as protests against Chick-fil-A swelled across the country, dozens of groups and prominent individuals joined in support of the company."
        ],
        [
            "Among the groups is Project 21, a black conservative activist organization.",
            "One of its members, Demetrios Minor, said critics of Dan Cathy have taken his statements completely out of context.",
            "“I think liberals are missing a vital point in their blind hatred of Chick-fil-A,” Minor said in a statement sent to Fox News.",
            "“Being against gay marriage is not being anti-gay.”"
        ],
        [
            "Crtitics of Chick-fil-A argue that the company’s opposition to gay marriage goes well beyond Dan Cathy’s statements.",
            "Over the years, its philanthropic wing, WinShape, has donated millions of dollars to outside organizations that actively lobby against efforts to legalize same-sex marriage."
        ],
        [
            "On Friday, supporters of same-sex marriage will have their say.",
            "They plan a “kiss-in” at Chick-fil-A restaurants across the country – encouraging gays and lesbians to share a public display of affection at the home of the chicken sandwich."
        ]
    ]
}
