{
    "source": "fox",
    "main-entities": ["Rick Santorum", "Barack Obama"],
    "main-event": "Rick Santorum defends his comments on Obama",
    "title": "Santorum: 'Phony theology' comment was about energy policy, not Christian faith",
    "url": "http://www.foxnews.com/politics/2012/02/19/santorum-talks-economy-with-phony-theology-comment-but-social-debate-ensues/",
    "word-count": 581,
    "date": "2012-02-19",
    "uuid": "14cbb6c2-87bc-4378-86fd-d359e978fdda",
    "triplet-uuid": "65cb14cb-2d27-41e5-a2be-6fd6314f4363",
    "body-paragraphs": [
        [
            "Rick Santorum said Sunday he wasn't questioning whether President Obama is a Christian when he referred to his \"phony theology\" over the weekend, but was in fact challenging policies that he says place the stewardship of the Earth above the welfare of people living on it."
        ],
        [
            "\"I wasn't suggesting the president's not a Christian.",
            "I accept the fact that the president is a Christian,\" Santorum said."
        ],
        [
            "\"I was talking about the radical environmentalist,\" he said.",
            "\"I was talking about energy, this idea that man is here to serve the Earth as opposed to husband its resources and be good stewards of the Earth.",
            "And I think that is a phony ideal."
        ],
        [
            "\"I don't believe that that's what we're here to do.",
            "That man is here to use the resources and use them wisely, to care for the Earth, to be a steward of the Earth, but we're not here to serve the Earth.",
            "The Earth is not the objective. Man is the objective.",
            "And I think a lot of radical environmentalists have it upside down,\" Santorum said."
        ],
        [
            "But the president's campaign, responding forcefully to the new frontrunner in the GOP race, said the remark is a personal affront."
        ],
        [
            "\"I can't help but think that those remarks are well over the line.",
            "It's wrong. It's destructive,\" said Robert Gibbs, the president's former press secretary who is now working on Obama's reelection effort."
        ],
        [
            "\"It's time to get rid of this.",
            "It's time to have a debate on our political positions, but not question each other's character and faith,\" he said."
        ],
        [
            "Obama campaign deputy press secretary Ben Labolt also issued a statement Saturday shortly after Santorum told voters that Obama's agenda is \"not about you.",
            "It's not about your quality of life. It's not about your jobs. It's about some phony ideal.",
            "Some phony theology. Not a theology based on the Bible. A different theology.\""
        ],
        [
            "The comment was \"the latest low in a Republican primary campaign that has been fueled by distortions, ugliness, and searing pessimism and negativity.\"",
            "It was \"a stark contrast with the president who is focused everyday on creating jobs and restoring economic security for the middle class,\" LaBolt said."
        ],
        [
            "Santorum, who has pulled ahead of Mitt Romney in polling for the 2012 Republican presidential primary nod, said Sunday that when he used the word \"theology\" he was referring to a \"world view that elevates the Earth above man.\""
        ],
        [
            "That world view, Santorum continued, suggests that man could harm the Earth by using the resources available even while relying on claims that \"frankly are just not scientifically proven, for example, the politicization of the whole global warming debate.\""
        ],
        [
            "\"I mean, this is just all an attempt to, you know, to centralize power and to give more power to the government,\" Santorum said."
        ],
        [
            "Santorum said he never questioned the president's faith and repeatedly said he believes Obama is a Christian."
        ],
        [
            "\"He says he is a Christian.",
            "But I am talking about his world view or his -- the way he approaches problems in this country.",
            "And I think they're different than how most people do in America,\" he said."
        ],
        [
            "But while Gibbs said it's time to get off the \"mindset that if we disagree, we have to disqualify each other\" comments like Santorum's show that the GOP primary \"has been a race to the bottom.",
            "We have seen nastiness, divisiveness, ugliness, distortions of opponents' records, of the president's record.\""
        ],
        [
            "Santorum appeared on CBS' \"Face the Nation.\"",
            "Gibbs was on ABC's \"This Week.\""
        ]
    ]
}
