{
    "source": "hpo",
    "main-entities": ["Rick Santorum", "Barack Obama"],
    "main-event": "Rick Santorum defends his comments on Obama",
    "title": "Santorum Calls For Ending Public Education, Prenatal Testing",
    "url": "http://www.huffingtonpost.com/2012/02/19/santorum-phony-theology_n_1287475.html",
    "word-count": 615,
    "date": "2012-02-19",
    "uuid": "c7c1dccd-747f-4f19-98f1-8e323096efe3",
    "triplet-uuid": "65cb14cb-2d27-41e5-a2be-6fd6314f4363",
    "body-paragraphs": [
        [
            "A more congenial Rick Santorum doubled down on several controversial, and religiously laden, remarks in an interview Sunday morning on CBS's \"Face the Nation,\" where he defended his recent claims that prenatal testing results in abortions, that federally provided education was \"anachronistic,\" and that President Obama's policies are not \"based on the Bible.\""
        ],
        [
            "\"I've repeatedly said I don't question the president's faith,\" Santorum told host Bob Schieffer, denying what some have said was a signal that Santorum had challenged the legitimacy of Obama's Christianity.",
            "\"I've repeatedly said that I believe the president's Christian -- he says he's Christian.",
            "But I am talking about his worldview, the way he addresses problems in this country, and they're different than most people view it in America.\""
        ],
        [
            "In a speech to Tea Party conservatives on Saturday in Columbus, Ohio, Santorum had dismissed Obama’s politics as being based in “some phony theology.”"
        ],
        [
            "\"It's not about you. It's not about your quality of life. It's not about your jobs,\" Santorum said.",
            "\"It's about some phony ideal, some phony theology. Oh, not a theology based on the Bible. A different theology.\""
        ],
        [
            "An incredulous Bob Schieffer began his interview with Santorum Sunday by asking, \"What in the world were you talking about?\""
        ],
        [
            "\"I was talking about the radical environmentalists,\" Santorum said, suggesting that they believe man should protect the earth, rather than \"steward its resources.\"",
            "\"I think that is a phony ideal.",
            "I don't believe that's what we're here to do ... We're not here to serve the earth.",
            "That is not the objective, man is the objective.\""
        ],
        [
            "Earlier in the day on Saturday, Santorum had also said that health insurance plans shouldn’t be required to cover prenatal testing, because that testing results in more abortions, as well as contending that government-run public education was “anachronistic.”"
        ],
        [
            "\"Free prenatal testing ends up in more abortions and therefore less care that has to be done, because we cull the ranks of the disabled in our society,\" Santorum told the Ohio Christian Alliance conference."
        ],
        [
            "Asked by Schieffer about his claims that prenatal testing leads to more abortions, Santorum insisted that this was \"a fact.\""
        ],
        [
            "\"We're talking about specifically prenatal testing, and specifically amniocentesis, which is a procedure that actually creates a risk of having a miscarriage when you have it, and is done for the purposes of identifying maladies of a child in the womb.",
            "And in many cases -- and in fact in most cases -- most physicians recommend, if there is a problem, they recommend abortion,\" Santorum said."
        ],
        [
            "Santorum had said that because of this trend, health insurance providers should not be forced to make the procedures available free of charge."
        ],
        [
            "Santorum also told Schieffer that government-provided education was not working and that the process ought to be customizable, like buying a car."
        ],
        [
            "\"I'm saying that local communities and parents should be the ones in control over public education, certainly not the federal government, and I think the state governments have not done a particularly good job in public education, either,\" Santorum said."
        ],
        [
            "Buying a car, by contrast he said, is \"designed to meet the needs of a customer.",
            "Federally or state-run education is not designed to meet the needs of the customer.\""
        ],
        [
            "Speaking earlier on ABC's \"This Week\" about Santorum's remarks, Obama campaign aide Robert Gibbs called his rhetoric \"well over the line.\""
        ],
        [
            "\"I think it's time in our politics that we get rid of this mindset that if we disagree, we have to disqualify each other,\" Gibbs said."
        ],
        [
            "\"I think if you make comments like that, you make comments that are well over the line,\" he added.",
            "\"I think the GOP race has been, in many cases, a race to the bottom.\""
        ]
    ]
}
