{
    "source": "nyt",
    "main-entities": ["Mitt Romney", "Barack Obama"],
    "main-event": "Romney reaffirms opposition to same sex marriage",
    "title": "Romney Reaffirms Opposition to Marriage, or Unions, for Gay Couples",
    "url": "https://www.nytimes.com/2012/05/10/us/politics/romney-reaffirms-opposition-to-marriage-or-similar-for-gay-couples.html",
    "word-count": 713,
    "date": "2012-05-10",
    "uuid": "063a36ea-f163-4a18-a29b-1a8d66c4f0e8",
    "triplet-uuid": "8dc7ccfe-5cf0-482f-9101-a7c69881da4d",
    "body-paragraphs": [
        [
            "Like many conservative Republicans, Mitt Romney is opposed not only to same-sex marriage, but also to the civil unions that many states have adopted as an alternative to full marital rights for gay couples."
        ],
        [
            "Now that President Obama, long a supporter of civil unions, has publicly embraced same-sex marriage, the question of precisely what legal status and protections should be granted to gay couples is emerging as an issue of the starkest possible contrast between the two presidential candidates."
        ],
        [
            "In short, both Mr. Romney and Mr. Obama have adopted the favored position of their ideological base on a subject that profoundly animates both of those camps."
        ],
        [
            "On Wednesday, in anticipation of Mr. Obama’s announcement, Mr. Romney laid out his belief that marriage — and anything resembling it — should be restricted to heterosexual couples, even as he acknowledged that it was “a very tender and sensitive topic.”"
        ],
        [
            "In doing so, he left open many questions about what his vision of legally recognizable gay unions would encompass, and what it would exclude."
        ],
        [
            "“My view is the same as it’s been from the beginning,” Mr. Romney told a CBS affiliate in Denver.",
            "“I don’t favor civil unions if it’s identical to marriage, and I don’t favor marriage between people of the same gender.”",
            "Asked why he opposed civil unions, in particular, he explained that in many cases they represent marriage by a different name for gay couples."
        ],
        [
            "“If a civil union is identical to marriage other than with the name, why, I don’t support that,” he said Wednesday."
        ],
        [
            "Nine states, including California, Delaware and New Jersey, now allow civil unions and broad domestic partnerships that most likely fit Mr. Romney’s description of marriage-like arrangements, meaning that they would be in the cross hairs of a President Romney, who supports a constitutional amendment to ban same-sex marriage."
        ],
        [
            "Those states offer an array of different rights to same-sex couples, among them the ability to pool resources for tax purposes, place a spouse on an employee health care plan and inherit property after a death."
        ],
        [
            "Mr. Romney has said that he favors allowing domestic partnerships that bestow certain rights on same-sex couples, like hospital visitation, but he has not delineated them in great detail."
        ],
        [
            "“Benefits of that nature may well be appropriate, and states are able to make a provision for the determination of those kinds of rights,” Mr. Romney said Wednesday."
        ],
        [
            "Republicans and Democrats, in their reactions to the president’s support for same-sex marriage, said they saw a newly wide, and seemingly unbridgeable, gap between the two leaders on the issue."
        ],
        [
            "“We now have a clear choice between Romney and Obama,” said Maggie Gallagher, a founder of the National Organization for Marriage, which opposes same-sex marriage.",
            "She called the president’s decision “a huge mistake” that would reward the Republican Party."
        ],
        [
            "Evan Wolfson, the founder of Freedom to Marry, a gay rights organization, said that now “there is absolutely no way that opponents of gay rights can hide behind any unclarity in the president’s position and make the bogus claim that it’s the same as theirs.”"
        ],
        [
            "Mr. Romney has, over the years, made it clear that his opposition to same-sex marriage and civil unions is a deeply held moral conviction, and he has not shied from using strong language to describe the offense he has taken to its introduction."
        ],
        [
            "When in 2003 the Massachusetts courts legalized same-sex marriage in the state, Mr. Romney, then governor, complained that the state had become “San Francisco East.”",
            "And, speaking with a sense of alarm about gay couples, he warned a conservative audience that “some are actually having children born to them.”"
        ],
        [
            "Democrats contend that, like Mr. Obama’s views, Mr. Romney’s feelings about gay rights have evolved, but in the opposite direction: During his campaign for the Senate in 1994, Mr. Romney vowed to seek “full equality” for gays and lesbians, in a letter to the Log Cabin Republicans of Massachusetts."
        ],
        [
            "In that letter he argued that he was more supportive of gay rights than his Democratic opponent at the time, Senator Edward M. Kennedy."
        ],
        [
            "But at the time, same-sex marriage was a little-discussed item on the agenda of national gay rights leaders, and aides say Mr. Romney has consistently opposed both marriage and civil unions that resemble marriage for gay couples."
        ]
    ]
}
