{
    "source": "hpo",
    "main-entities": ["Benjamin Netanyahu", "Barack Obama", "Secure America Now", "Romney campaign"],
    "main-event": "Benjamin Netanyahu Used In Conservative Attack Ad Against Obama",
    "title": "Israel Prime Minister Bibi Netanyahu Used In Conservative Attack Ad Against Obama",
    "url": "https://www.huffingtonpost.com/2012/09/20/netanyahu-obama-attack-ad_n_1901109.html",
    "word-count": 422,
    "date": "2012-09-20",
    "uuid": "6ce75053-9a66-4cf3-a74f-56ae99d204b8",
    "triplet-uuid": "b4dbeda7-a1f3-4711-ae77-db23809d1ed2",
    "body-paragraphs": [
        [
            "Even though Bibi Netanyahu recently decried the use of his name in election-year politicking, the Israeli prime minister is the subject of a new ad by Secure America Now, a neoconservative nonprofit organization dedicated to influencing the debate around American security and foreign policy."
        ],
        [
            "Politico reports:"
        ],
        [
            "“A Republican involved with the project said it’s airing in Miami, West Palm Beach and Ft. Myers.",
            "The flight is ultimately going to be $1 million, the official said - a media-tracking source said about $400,000 has been placed so far."
        ],
        [
            "Those markets house some of the state’s largest Jewish communities."
        ],
        [
            "The pollster for Secure America Now is John McLaughlin, who has worked with Netanyahu’s Likud Party.”"
        ],
        [
            "The ad features Netanyahu laying out Israel’s security concerns about Iran’s nuclear program, which Republicans have used to knock President Barack Obama’s sometimes frosty relationship with the Israeli prime minister. "
        ],
        [
            "Republican presidential nominee Mitt Romney has repeatedly targeted the Obama administration for not taking a firm enough stance against Iran, claiming on many occasions that the president has “thrown Israel under a bus.”",
            "The GOP also has attacked the president for declining an opportunity to meet with Netanyahu at the United Nations General Assembly later this month in an effort to paint the current White House as dismissive of Israel and its concerns."
        ],
        [
            "But Netanyahu pushed back against these criticisms in two separate interviews on Sunday, first telling CNN, “I know that people are trying to draw me into the American election.",
            "I’m not going to do that.”"
        ],
        [
            "He also rejected reports that Obama refused his request for a meeting, pinning the circumstances on a scheduling conflict, as has the White House when pressed on the subject."
        ],
        [
            "“President Obama has said that he’s determined to prevent Iran from getting nuclear weapons and I appreciate that and I respect that,” Netanyahu said on NBC’s “Meet the Press.”"
        ],
        [
            "When asked if Obama had thrown Israel under a bus, Netanyahu responded, “There is no bus.”"
        ],
        [
            "This isn’t the first ad Secure America Now has run against Obama, even though on its website the organization describes itself as representing all political ideologies.",
            "In July, the group released an ad pushing the same attack line employed by Romney, accusing the president of embarking on a so-called “apology tour” at the expense of American security. "
        ],
        [
            "The Obama administration is not mentioned by name in the latest spot, but it implicitly underscores the GOP’s narrative on the president’s relationship with the country’s closest ally."
        ]
    ]
}
