{
    "source": "fox",
    "main-entities": ["Joe Biden", "Paul Ryan"],
    "main-event": "Biden and Ryan debate",
    "title": "Sparks fly as Biden, Ryan face off in feisty vice presidential debate",
    "url": "http://www.foxnews.com/politics/2012/10/11/biden-ryan-face-off-in-high-stakes-vice-presidential-debate-in-kentucky/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+foxnews%2Fpolitics+%28Internal+-+Politics+-+Text%29",
    "word-count": 1027,
    "date": "2012-10-12",
    "uuid": "3f393d4e-1eb3-4a21-88c0-6897f13d96b7",
    "triplet-uuid": "b5eefefb-2a33-45de-abe1-f855c94165f4",
    "body-paragraphs": [
        [
            "In a head-to-head battle of proxies, Vice President Biden wasted no time Thursday trying to do what many Democrats felt President Obama failed to against Mitt Romney, going on offense with an often disdainful attack on Paul Ryan -- who stood his ground against a barrage of Biden grins, guffaws, snickers and interruptions."
        ],
        [
            "The dueling running mates turned the lone vice presidential debate into an uncharacteristically feisty affair, scrapping over everything from the economy to Libya to taxes.",
            "But it was the vice president who set the aggressive tone, blatantly striving to hit the reset after President Obama was panned for his lackluster performance at last week's opening debate."
        ],
        [
            "If Obama was too cold, Biden at times bordered on too hot, analysts said afterward."
        ],
        [
            "He chuckled and smirked through many of Ryan's responses.",
            "But unlike Obama a week ago, he let few points go unchallenged."
        ],
        [
            "Biden went after the Romney/Ryan ticket with a directness that Obama did not.",
            "Notably, he hammered Mitt Romney over his secretly videotaped comment in which he said he doesn't have to worry about the \"47 percent\" of Americans who don't pay federal income taxes."
        ],
        [
            "\"These people are my mom and dad, the people I grew up with, my neighbors,\" Biden said, adding he's \"had it up to here\" with those kinds of comments."
        ],
        [
            "Ryan shot back, in reference to Biden's tendency to make gaffes: \"As the vice president very well knows ... sometimes the words don't come out of your mouth the right way.\""
        ],
        [
            "\"But I always say what I mean,\" Biden responded."
        ],
        [
            "Ryan accused Obama of \"projecting weakness\" with his foreign policy, particularly in his response to the terror attack on the U.S. Consulate in Benghazi, Libya.",
            "At home, he accused the administration of presiding over a shoddy recovery."
        ],
        [
            "\"This is not what a real recovery looks like,\" Ryan said."
        ],
        [
            "Whether the debate will alter the course of the race remains to be seen.",
            "There are two more presidential debates on the calendar, and the polls have started to swing in Romney's favor.",
            "The tightening was reflected in the candidates' attitude onstage Thursday, each loath to give the other too many seconds of speech-time without a challenge."
        ],
        [
            "The economy, the budget deficit and foreign policy were central.",
            "Each candidate made frequent appeals to the middle class, Biden by pledging to protect programs in the federal budget and Ryan by pledging to grow the economy for everybody."
        ],
        [
            "Ryan opened the debate with tough criticism of the Obama administration over its handling of the Libya terror attack."
        ],
        [
            "\"What we are watching on our TV screens is the unraveling of the Obama foreign policy,\" Ryan said."
        ],
        [
            "With the moderator, ABC News' Martha Raddatz, opening the debate with a question about the Libya strike, which happened a month ago Thursday, Ryan criticized the administration for waiting more than a week after the strike to call it a coordinated terror attack."
        ],
        [
            "\"This is becoming more troubling by the day.",
            "They first blamed the YouTube video.",
            "Now they're trying to blame the Romney/Ryan ticket for making this an issue,\" he said.",
            "Ryan was referring to a claim by an Obama aide earlier Thursday that the only reason the attack had entered the political debate was because of Romney's criticism - a claim Romney rejected."
        ],
        [
            "Biden was quick to retort: \"With all due respect, that's just a bunch of malarkey.",
            "... Not a single thing he said is accurate.\""
        ],
        [
            "He added: \"This talk about this weakness, I don't understand what my friend's talking about.\""
        ],
        [
            "Biden also criticized Romney for making a \"political statement\"on the night of the attack, a reference to Romney's criticism of the U.S. Embassy in Cairo's early response to protests there.",
            "On the question of why the administration initially claimed the attack was the result of a protest, Biden explained \"the intelligence community told us that.\""
        ],
        [
            "The face-off Thursday night was taking on outsized importance for a vice presidential debate."
        ],
        [
            "After Obama's debate performance last week, the pressure was on Biden to recapture the momentum -- while equally on Ryan to prevent the Obama ticket from blunting Romney's surge."
        ],
        [
            "Ryan referred to the weight on Biden's shoulders about mid-way through, as the two talked over each other on Medicare."
        ],
        [
            "\"Mr. vice president, I know you're under a lot of duress to make up for lost ground, but I think people would be better served if we don't keep interrupting each other,\" Ryan said."
        ],
        [
            "On Medicare, Biden charged that the Republican ticket's plan would raise costs for future seniors with a de facto \"voucher\" system.",
            "\"Their ideas are old and their ideas are bad and they eliminate the guarantee of Medicare,\" he said."
        ],
        [
            "Ryan shot back: \"They got caught with their hand in the cookie jar turning Medicare into a piggy bank for ObamaCare.\""
        ],
        [
            "The debate veered across the spectrum of topics from the campaign trail.",
            "On Iran's nuclear program, Biden repeatedly suggested Romney and Ryan would too readily choose the military option to stop it.",
            "On abortion, he cautioned that the next president will get to choose one or two justices on the Supreme Court -- \"that's how close Roe v. Wade is.\""
        ],
        [
            "Ryan, toward the end of the debate, warned that a \"debt crisis is coming\" and claimed the sitting president offers little more than speeches to address the deficit."
        ],
        [
            "\"That's what we get in this administration -- speeches.",
            "But we're not getting leadership,\" he said."
        ],
        [
            "In a matter of days, Romney has picked up steam in both battleground and national polls.",
            "The latest Fox News national poll of likely voters showed Romney edging Obama, 46 percent to 45 percent."
        ],
        [
            "Obama has acknowledged he had a \"bad night\" in his debate last week, but the campaign indicates it will be more aggressive going forward.",
            "After Biden's more feisty performance Thursday, Obama campaign manager Jim Messina quipped that he's a \"happy warrior\" for the middle class."
        ],
        [
            "The final presidential debates will be held Oct. 16 and Oct. 22.",
            "The next one will be a town hall format focusing on a range of issues, and the last one will focus exclusively on foreign policy."
        ]
    ]
}
