{
    "source": "hpo",
    "main-entities": ["Joe Biden", "Paul Ryan"],
    "main-event": "Biden and Ryan debate",
    "title": "Biden-Ryan Debate: All About Joe",
    "url": "https://www.huffingtonpost.com/2012/10/12/biden-ryan-debate_n_1960034.html",
    "word-count": 1436,
    "date": "2012-10-12",
    "uuid": "70e6078e-6c9a-41e8-a832-e04e0931b31b",
    "triplet-uuid": "b5eefefb-2a33-45de-abe1-f855c94165f4",
    "body-paragraphs": [
        [
            "DANVILLE, Ky. –- Joe Biden did everything President Barack Obama did not last week, and a good bit more."
        ],
        [
            "The vice president dominated the spotlight in the only debate between himself and Rep. Paul Ryan (R-Wis.), charging at Republican Mitt Romney's running mate from the get-go and bombarding him with a flurry of eye rolls, interjections and accusations."
        ],
        [
            "What it accomplished among undecided voters, if anything, is hard to tell and will take days to sort out.",
            "Two instant surveys of Americans watching the debate -- one by CBS, one by CNN -- showed mixed results.",
            "But since vice presidential debates often have a negligible impact on the overall race anyway, Biden's sometimes over-the-top performance probably accomplished what he appeared intent on doing: rallying the Democratic base after Obama's woeful debate performance last week."
        ],
        [
            "Obama, at least, was cheered by the offensive."
        ],
        [
            "\"I'm going to make a special point of saying that I thought Joe Biden was terrific tonight,\" the president told reporters after stepping off Air Force One at Andrews Air Force Base in Maryland, on his way back to the White House after a day of campaigning in Florida."
        ],
        [
            "Biden looked as if he could barely stay in his seat for much of the night, interrupting Ryan repeatedly and sometimes making it difficult for the GOP nominee to get out his answers."
        ],
        [
            "“He had his Red Bull. He certainly had his caffeine,” Sen. John Thune (R-S.D.) said after the debate."
        ],
        [
            "It was a performance by the vice president guaranteed to amp up -– and buck up -– worried Democrats, who had fallen into a paralysis of anxiety after the president's debate.",
            "No one represented that Democratic angst more than blogger Andrew Sullivan, a supporter of the president."
        ],
        [
            "Obama adviser David Axelrod said \"Andrew is a unique thinker, and I can't speak for how he might react to this.",
            "I hope he is [reassured],\" Axelrod said, adding that he had \"high regard for [Sullivan] by the way.\""
        ],
        [
            "Sullivan, for the record, called the night \"a solid win for Biden\" and called Ryan \"competent.\""
        ],
        [
            "The Obama campaign team, in the spin room after the debate, focused on repeating the theme that, as Axelrod said, Biden showed \"passion\" and that he showed \"a great concern for the middle class.\"",
            "Passion was the thing Obama lacked last week, and Romney surprised the president and Democrats by talking constantly about how his policies would help the middle class."
        ],
        [
            "By contrast, Romney operatives in the spin room said Ryan clearly won on substance and composure while Biden devolved into fits of laughter and audible groans."
        ],
        [
            "“I think the way the vice president handled himself was condescending,” said Rep. Jason Chaffetz (R-Utah).",
            "“He was constantly interrupting and trying to talk over people.",
            "When my 11-year-old tries to do that at the dinner table, it’s not tolerated.”"
        ],
        [
            "Democrats were intent Thursday night to steal back any edge Romney might have deprived them of in being the party who can appeal to working class and blue-collar voters, and to any voter who considers themselves middle class, which is a large number."
        ],
        [
            "\"These guys discovered the phrase 'middle class' during the last six months on the campaign trail,\" said Rep. Chris Van Hollen (D-Md.), who has sparred with Ryan on the House Budget Committee for years and who played Ryan in debate preparation with Biden."
        ],
        [
            "Though it was Biden at the center of attention and who made it hard for Ryan to get in a word edgewise at times, the 42-year-old kept his composure for much of the night and got in some well-aimed shots at the vice president, who at 69 is his senior by 27 years.",
            "Ryan seemed focused more on winning over moderate and independent voters who are still making up their minds, less than a month before the election."
        ],
        [
            "The night's 90-minute debate, the only one for the two vice presidential candidates, fluctuated between domestic policy and foreign policy, with ABC's Martha Raddatz, a reporter with vast foreign policy experience, asking numerous questions about events overseas."
        ],
        [
            "But the number one goal for Biden all night was obvious from the outset: push back. Hard.",
            "It was the number one thing that Democrats had said Obama should have done last week, and it foreshadowed how the president will approach next Tuesday's debate with Romney, the second of three debates for the two men running for president."
        ],
        [
            "After Ryan finished his opening statement, responding to a question about the death of the U.S. ambassador to Libya in a terrorist attack in Benghazi a month ago, Biden responded: \"That's a bunch of malarkey.\""
        ],
        [
            "\"Not a single thing he said is accurate,\" Biden said."
        ],
        [
            "At times, Biden repeatedly butted in on Ryan's answers, refusing to let Ryan finish his thought.",
            "If it were anyone other than Biden, who is treated by the press as a lovable, half-crazy uncle, he would have been labeled insufferable.",
            "Instead, he got the aggressive label."
        ],
        [
            "Republicans thought it was much more than that.",
            "Republican National Committee spokesman Tim Miller called Biden “unhinged.”"
        ],
        [
            "Romney adviser Eric Fehrnstrom tweeted: “Ryan: serious, sober, steady.",
            "Biden: smirking, mocking, immature.”"
        ],
        [
            "Some of the more experienced Republicans tried to resist talking about Biden’s behavior, knowing it would come across as complaining."
        ],
        [
            "“Most people probably found the vice president’s performance a little -- well anyway, I think that people will judge for themselves,” said Ed Gillespie, one of the top advisers to Romney and one of the most seasoned Republican operatives in politics."
        ],
        [
            "But not even Gillespie, when he was asked by a reporter where he was going before he cut himself off, could resist getting some digs at Biden."
        ],
        [
            "“I don't know if his staff didn't brief him or not, but somebody should have told him that these debates are split-screen,” Gillespie said."
        ],
        [
            "“There seemed to be some frustration on his part at times, and sometimes I got the impression that he couldn't defend the facts as they were, [so] raise your voice a little louder,” Gillespie said."
        ],
        [
            "The Obama campaign, of course, relished in Republicans’ focus on Biden’s behavior instead of the substance of his remarks."
        ],
        [
            "\"Their side is all spending their time talking about laughing and facial tics,\" said Obama campaign manager Jim Messina.",
            "\"You're going to do that when you've lost a debate.",
            "And that's what happened tonight: they lost the debate.\""
        ],
        [
            "Of course, Biden was so demonstrative, so outsized, that it was hard to talk about anything else."
        ],
        [
            "Biden did another thing Obama did not a week ago.",
            "He raised the issue of Romney’s comments at a fundraiser in May in which he talked disparagingly about people who receive government benefits, claiming that he could “never convince them they should take personal responsibility and care for their lives.\""
        ],
        [
            "One of Ryan’s best one-liners came when he sought to explain these comments."
        ],
        [
            "Ryan first told a humanizing story about Romney caring for a family whose children were in a car crash, a story clearly prepared to push back against the portrait of Romney as out of touch and uncaring.",
            "And he then added: “With respect to that quote, I think the vice president very well knows that sometimes the words don't come out of your mouth the right way.”"
        ],
        [
            "Although there were extended portions of the debate that focused on Libya, Syria, and Afghanistan, Biden and Ryan did engage in a lengthy back-and-forth in the middle of the debate on Medicare and tax policy."
        ],
        [
            "Ryan was, as usual, knowledgeable and in command of the facts.",
            "But Biden, as expected, attempted to plow him over with broadsides."
        ],
        [
            "“Stop talking about how you care about people.",
            "Show me something. Show me a policy,” Biden said."
        ],
        [
            "Ryan smiled, and continued to work through a data-filled argument, mentioning the $831 billion stimulus, an 8 percent unemployment rate for 43 months, the 1.3 percent growth rate of the economy, the $90 billion for green energy programs in the stimulus, and the 12 million jobs he and Romney say their economic program would create."
        ],
        [
            "Biden didn’t worry so much about numbers.",
            "Biden’s argument on Medicare was aimed at voters’ guts, much more so than minds.",
            "He acknowledged that Romney’s Medicare plan would not cost seniors an extra $6,400 a year, despite the claim in a recently launched Obama campaign ad."
        ],
        [
            "The $6,400 figure is based on a study of one of Ryan’s earlier plans for Medicare, which he has since changed to make it more bipartisan."
        ],
        [
            "Biden, aware of this, told voters they should be suspicious somebody “who would actually put in motion a plan that … added $6,400 a year more to the cost of Medicare?”"
        ]
    ]
}
